TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Thu Mar 02 12:12:41 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\guilherme\workspace_v6_2\proj_ITS\Flash")
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    7830                      .dwattr $C$DW$662, DW_AT_name("EST_State_RoverL")
    7831                      .dwattr $C$DW$662, DW_AT_const_value(0x02)
    7832              
    7833              $C$DW$663       .dwtag  DW_TAG_enumerator
    7834                      .dwattr $C$DW$663, DW_AT_name("EST_State_Rs")
    7835                      .dwattr $C$DW$663, DW_AT_const_value(0x03)
    7836              
    7837              $C$DW$664       .dwtag  DW_TAG_enumerator
    7838                      .dwattr $C$DW$664, DW_AT_name("EST_State_RampUp")
    7839                      .dwattr $C$DW$664, DW_AT_const_value(0x04)
    7840              
    7841              $C$DW$665       .dwtag  DW_TAG_enumerator
    7842                      .dwattr $C$DW$665, DW_AT_name("EST_State_IdRated")
    7843                      .dwattr $C$DW$665, DW_AT_const_value(0x05)
    7844              
    7845              $C$DW$666       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  150

    7846                      .dwattr $C$DW$666, DW_AT_name("EST_State_RatedFlux_OL")
    7847                      .dwattr $C$DW$666, DW_AT_const_value(0x06)
    7848              
    7849              $C$DW$667       .dwtag  DW_TAG_enumerator
    7850                      .dwattr $C$DW$667, DW_AT_name("EST_State_RatedFlux")
    7851                      .dwattr $C$DW$667, DW_AT_const_value(0x07)
    7852              
    7853              $C$DW$668       .dwtag  DW_TAG_enumerator
    7854                      .dwattr $C$DW$668, DW_AT_name("EST_State_RampDown")
    7855                      .dwattr $C$DW$668, DW_AT_const_value(0x08)
    7856              
    7857              $C$DW$669       .dwtag  DW_TAG_enumerator
    7858                      .dwattr $C$DW$669, DW_AT_name("EST_State_LockRotor")
    7859                      .dwattr $C$DW$669, DW_AT_const_value(0x09)
    7860              
    7861              $C$DW$670       .dwtag  DW_TAG_enumerator
    7862                      .dwattr $C$DW$670, DW_AT_name("EST_State_Ls")
    7863                      .dwattr $C$DW$670, DW_AT_const_value(0x0a)
    7864              
    7865              $C$DW$671       .dwtag  DW_TAG_enumerator
    7866                      .dwattr $C$DW$671, DW_AT_name("EST_State_Rr")
    7867                      .dwattr $C$DW$671, DW_AT_const_value(0x0b)
    7868              
    7869              $C$DW$672       .dwtag  DW_TAG_enumerator
    7870                      .dwattr $C$DW$672, DW_AT_name("EST_State_MotorIdentified")
    7871                      .dwattr $C$DW$672, DW_AT_const_value(0x0c)
    7872              
    7873              $C$DW$673       .dwtag  DW_TAG_enumerator
    7874                      .dwattr $C$DW$673, DW_AT_name("EST_State_OnLine")
    7875                      .dwattr $C$DW$673, DW_AT_const_value(0x0d)
    7876              
    7877              $C$DW$674       .dwtag  DW_TAG_enumerator
    7878                      .dwattr $C$DW$674, DW_AT_name("EST_numStates")
    7879                      .dwattr $C$DW$674, DW_AT_const_value(0x0e)
    7880              
    7881                      .dwendtag $C$DW$T$172
    7882              
    7883              $C$DW$T$173     .dwtag  DW_TAG_typedef
    7884                      .dwattr $C$DW$T$173, DW_AT_name("EST_State_e")
    7885                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$172)
    7886                      .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    7887              
    7888              
    7889              $C$DW$T$177     .dwtag  DW_TAG_enumeration_type
    7890                      .dwattr $C$DW$T$177, DW_AT_byte_size(0x01)
    7891              $C$DW$675       .dwtag  DW_TAG_enumerator
    7892                      .dwattr $C$DW$675, DW_AT_name("CTRL_Type_PID_spd")
    7893                      .dwattr $C$DW$675, DW_AT_const_value(0x00)
    7894              
    7895              $C$DW$676       .dwtag  DW_TAG_enumerator
    7896                      .dwattr $C$DW$676, DW_AT_name("CTRL_Type_PID_Id")
    7897                      .dwattr $C$DW$676, DW_AT_const_value(0x01)
    7898              
    7899              $C$DW$677       .dwtag  DW_TAG_enumerator
    7900                      .dwattr $C$DW$677, DW_AT_name("CTRL_Type_PID_Iq")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  151

    7901                      .dwattr $C$DW$677, DW_AT_const_value(0x02)
    7902              
    7903                      .dwendtag $C$DW$T$177
    7904              
    7905              $C$DW$T$178     .dwtag  DW_TAG_typedef
    7906                      .dwattr $C$DW$T$178, DW_AT_name("CTRL_Type_e")
    7907                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$177)
    7908                      .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    7909              
    7910              $C$DW$678       .dwtag  DW_TAG_TI_far_type
    7911                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$178)
    7912              
    7913              $C$DW$T$179     .dwtag  DW_TAG_const_type
    7914                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$678)
    7915              
    7916              
    7917              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7918                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    7919                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    7920              $C$DW$679       .dwtag  DW_TAG_member
    7921                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$24)
    7922                      .dwattr $C$DW$679, DW_AT_name("ADCRESULT")
    7923                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_ADCRESULT")
    7924                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7925                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    7926              
    7927              $C$DW$680       .dwtag  DW_TAG_member
    7928                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$25)
    7929                      .dwattr $C$DW$680, DW_AT_name("resvd_1")
    7930                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_resvd_1")
    7931                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7932                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    7933              
    7934              $C$DW$681       .dwtag  DW_TAG_member
    7935                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$23)
    7936                      .dwattr $C$DW$681, DW_AT_name("ADCCTL1")
    7937                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_ADCCTL1")
    7938                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    7939                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    7940              
    7941              $C$DW$682       .dwtag  DW_TAG_member
    7942                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$23)
    7943                      .dwattr $C$DW$682, DW_AT_name("ADCCTL2")
    7944                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ADCCTL2")
    7945                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    7946                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    7947              
    7948              $C$DW$683       .dwtag  DW_TAG_member
    7949                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$26)
    7950                      .dwattr $C$DW$683, DW_AT_name("rsvd_2")
    7951                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_rsvd_2")
    7952                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    7953                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    7954              
    7955              $C$DW$684       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  152

    7956                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$23)
    7957                      .dwattr $C$DW$684, DW_AT_name("ADCINTFLG")
    7958                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ADCINTFLG")
    7959                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    7960                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    7961              
    7962              $C$DW$685       .dwtag  DW_TAG_member
    7963                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$23)
    7964                      .dwattr $C$DW$685, DW_AT_name("ADCINTFLGCLR")
    7965                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    7966                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    7967                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    7968              
    7969              $C$DW$686       .dwtag  DW_TAG_member
    7970                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$23)
    7971                      .dwattr $C$DW$686, DW_AT_name("ADCINTOVF")
    7972                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_ADCINTOVF")
    7973                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    7974                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    7975              
    7976              $C$DW$687       .dwtag  DW_TAG_member
    7977                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$23)
    7978                      .dwattr $C$DW$687, DW_AT_name("ADCINTOVFCLR")
    7979                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    7980                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    7981                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    7982              
    7983              $C$DW$688       .dwtag  DW_TAG_member
    7984                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$27)
    7985                      .dwattr $C$DW$688, DW_AT_name("INTSELxNy")
    7986                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_INTSELxNy")
    7987                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    7988                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    7989              
    7990              $C$DW$689       .dwtag  DW_TAG_member
    7991                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$28)
    7992                      .dwattr $C$DW$689, DW_AT_name("rsvd_3")
    7993                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_3")
    7994                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    7995                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    7996              
    7997              $C$DW$690       .dwtag  DW_TAG_member
    7998                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$23)
    7999                      .dwattr $C$DW$690, DW_AT_name("SOCPRICTRL")
    8000                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8001                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8002                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8003              
    8004              $C$DW$691       .dwtag  DW_TAG_member
    8005                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$23)
    8006                      .dwattr $C$DW$691, DW_AT_name("rsvd_4")
    8007                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_4")
    8008                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8009                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    8010              
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  153

    8011              $C$DW$692       .dwtag  DW_TAG_member
    8012                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$23)
    8013                      .dwattr $C$DW$692, DW_AT_name("ADCSAMPLEMODE")
    8014                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8015                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8016                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8017              
    8018              $C$DW$693       .dwtag  DW_TAG_member
    8019                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$23)
    8020                      .dwattr $C$DW$693, DW_AT_name("rsvd_5")
    8021                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_rsvd_5")
    8022                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8023                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8024              
    8025              $C$DW$694       .dwtag  DW_TAG_member
    8026                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$23)
    8027                      .dwattr $C$DW$694, DW_AT_name("ADCINTSOCSEL1")
    8028                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8029                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8030                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8031              
    8032              $C$DW$695       .dwtag  DW_TAG_member
    8033                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$23)
    8034                      .dwattr $C$DW$695, DW_AT_name("ADCINTSOCSEL2")
    8035                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8036                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8037                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    8038              
    8039              $C$DW$696       .dwtag  DW_TAG_member
    8040                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$26)
    8041                      .dwattr $C$DW$696, DW_AT_name("rsvd_6")
    8042                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_rsvd_6")
    8043                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8044                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8045              
    8046              $C$DW$697       .dwtag  DW_TAG_member
    8047                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$23)
    8048                      .dwattr $C$DW$697, DW_AT_name("ADCSOCFLG1")
    8049                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8050                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8051                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    8052              
    8053              $C$DW$698       .dwtag  DW_TAG_member
    8054                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$23)
    8055                      .dwattr $C$DW$698, DW_AT_name("rsvd_7")
    8056                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_rsvd_7")
    8057                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8058                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    8059              
    8060              $C$DW$699       .dwtag  DW_TAG_member
    8061                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$23)
    8062                      .dwattr $C$DW$699, DW_AT_name("ADCSOCFRC1")
    8063                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8064                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8065                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  154

    8066              
    8067              $C$DW$700       .dwtag  DW_TAG_member
    8068                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$23)
    8069                      .dwattr $C$DW$700, DW_AT_name("rsvd_8")
    8070                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_rsvd_8")
    8071                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8072                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    8073              
    8074              $C$DW$701       .dwtag  DW_TAG_member
    8075                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$23)
    8076                      .dwattr $C$DW$701, DW_AT_name("ADCSOCOVF1")
    8077                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8078                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8079                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    8080              
    8081              $C$DW$702       .dwtag  DW_TAG_member
    8082                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$23)
    8083                      .dwattr $C$DW$702, DW_AT_name("rsvd_9")
    8084                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_rsvd_9")
    8085                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8086                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    8087              
    8088              $C$DW$703       .dwtag  DW_TAG_member
    8089                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$23)
    8090                      .dwattr $C$DW$703, DW_AT_name("ADCSOCOVFCLR1")
    8091                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8092                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8093                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8094              
    8095              $C$DW$704       .dwtag  DW_TAG_member
    8096                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$23)
    8097                      .dwattr $C$DW$704, DW_AT_name("rsvd_10")
    8098                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_rsvd_10")
    8099                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8100                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8101              
    8102              $C$DW$705       .dwtag  DW_TAG_member
    8103                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$24)
    8104                      .dwattr $C$DW$705, DW_AT_name("ADCSOCxCTL")
    8105                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8106                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8107                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8108              
    8109              $C$DW$706       .dwtag  DW_TAG_member
    8110                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$24)
    8111                      .dwattr $C$DW$706, DW_AT_name("rsvd_11")
    8112                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_rsvd_11")
    8113                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8114                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    8115              
    8116              $C$DW$707       .dwtag  DW_TAG_member
    8117                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$23)
    8118                      .dwattr $C$DW$707, DW_AT_name("ADCREFTRIM")
    8119                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8120                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  155

    8121                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    8122              
    8123              $C$DW$708       .dwtag  DW_TAG_member
    8124                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$23)
    8125                      .dwattr $C$DW$708, DW_AT_name("ADCOFFTRIM")
    8126                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8127                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8128                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    8129              
    8130              $C$DW$709       .dwtag  DW_TAG_member
    8131                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$29)
    8132                      .dwattr $C$DW$709, DW_AT_name("resvd_12")
    8133                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_resvd_12")
    8134                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8135                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    8136              
    8137              $C$DW$710       .dwtag  DW_TAG_member
    8138                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$23)
    8139                      .dwattr $C$DW$710, DW_AT_name("ADCREV")
    8140                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_ADCREV")
    8141                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8142                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    8143              
    8144                      .dwendtag $C$DW$T$30
    8145              
    8146              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    8147                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$30)
    8148                      .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    8149              
    8150              $C$DW$T$90      .dwtag  DW_TAG_typedef
    8151                      .dwattr $C$DW$T$90, DW_AT_name("ADC_Handle")
    8152                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    8153                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    8154              
    8155              
    8156              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    8157                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    8158                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    8159              $C$DW$711       .dwtag  DW_TAG_member
    8160                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$31)
    8161                      .dwattr $C$DW$711, DW_AT_name("alpha_sf")
    8162                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_alpha_sf")
    8163                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8164                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    8165              
    8166              $C$DW$712       .dwtag  DW_TAG_member
    8167                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$31)
    8168                      .dwattr $C$DW$712, DW_AT_name("beta_sf")
    8169                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_beta_sf")
    8170                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8171                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    8172              
    8173              $C$DW$713       .dwtag  DW_TAG_member
    8174                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$32)
    8175                      .dwattr $C$DW$713, DW_AT_name("numSensors")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  156

    8176                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_numSensors")
    8177                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8178                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    8179              
    8180                      .dwendtag $C$DW$T$33
    8181              
    8182              $C$DW$T$44      .dwtag  DW_TAG_typedef
    8183                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Obj")
    8184                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    8185                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    8186              
    8187              $C$DW$T$180     .dwtag  DW_TAG_pointer_type
    8188                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$44)
    8189                      .dwattr $C$DW$T$180, DW_AT_address_class(0x20)
    8190              
    8191              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    8192                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    8193                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    8194              
    8195              $C$DW$T$43      .dwtag  DW_TAG_typedef
    8196                      .dwattr $C$DW$T$43, DW_AT_name("CLARKE_Handle")
    8197                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    8198                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    8199              
    8200              
    8201              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    8202                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    8203                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    8204              $C$DW$714       .dwtag  DW_TAG_member
    8205                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$23)
    8206                      .dwattr $C$DW$714, DW_AT_name("XCLK")
    8207                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_XCLK")
    8208                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8209                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    8210              
    8211              $C$DW$715       .dwtag  DW_TAG_member
    8212                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$23)
    8213                      .dwattr $C$DW$715, DW_AT_name("rsvd_1")
    8214                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_rsvd_1")
    8215                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8216                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    8217              
    8218              $C$DW$716       .dwtag  DW_TAG_member
    8219                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$23)
    8220                      .dwattr $C$DW$716, DW_AT_name("CLKCTL")
    8221                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_CLKCTL")
    8222                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8223                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8224              
    8225              $C$DW$717       .dwtag  DW_TAG_member
    8226                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$34)
    8227                      .dwattr $C$DW$717, DW_AT_name("rsvd_2")
    8228                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_rsvd_2")
    8229                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8230                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  157

    8231              
    8232              $C$DW$718       .dwtag  DW_TAG_member
    8233                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$23)
    8234                      .dwattr $C$DW$718, DW_AT_name("LOSPCP")
    8235                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_LOSPCP")
    8236                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8237                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8238              
    8239              $C$DW$719       .dwtag  DW_TAG_member
    8240                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$23)
    8241                      .dwattr $C$DW$719, DW_AT_name("PCLKCR0")
    8242                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_PCLKCR0")
    8243                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8244                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8245              
    8246              $C$DW$720       .dwtag  DW_TAG_member
    8247                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$23)
    8248                      .dwattr $C$DW$720, DW_AT_name("PCLKCR1")
    8249                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_PCLKCR1")
    8250                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8251                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8252              
    8253              $C$DW$721       .dwtag  DW_TAG_member
    8254                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$26)
    8255                      .dwattr $C$DW$721, DW_AT_name("rsvd_3")
    8256                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_rsvd_3")
    8257                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8258                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8259              
    8260              $C$DW$722       .dwtag  DW_TAG_member
    8261                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$23)
    8262                      .dwattr $C$DW$722, DW_AT_name("PCLKCR3")
    8263                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_PCLKCR3")
    8264                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8265                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8266              
    8267                      .dwendtag $C$DW$T$35
    8268              
    8269              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    8270                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$35)
    8271                      .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    8272              
    8273              $C$DW$T$92      .dwtag  DW_TAG_typedef
    8274                      .dwattr $C$DW$T$92, DW_AT_name("CLK_Handle")
    8275                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    8276                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    8277              
    8278              
    8279              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    8280                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    8281                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    8282              $C$DW$723       .dwtag  DW_TAG_member
    8283                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$32)
    8284                      .dwattr $C$DW$723, DW_AT_name("tmp")
    8285                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_tmp")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  158

    8286                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8287                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8288              
    8289                      .dwendtag $C$DW$T$36
    8290              
    8291              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    8292                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$36)
    8293                      .dwattr $C$DW$T$93, DW_AT_address_class(0x20)
    8294              
    8295              $C$DW$T$94      .dwtag  DW_TAG_typedef
    8296                      .dwattr $C$DW$T$94, DW_AT_name("CPU_Handle")
    8297                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    8298                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    8299              
    8300              
    8301              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    8302                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    8303                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    8304              $C$DW$724       .dwtag  DW_TAG_member
    8305                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$37)
    8306                      .dwattr $C$DW$724, DW_AT_name("version")
    8307                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_version")
    8308                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8309                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8310              
    8311              $C$DW$725       .dwtag  DW_TAG_member
    8312                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$39)
    8313                      .dwattr $C$DW$725, DW_AT_name("state")
    8314                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_state")
    8315                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8316                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8317              
    8318              $C$DW$726       .dwtag  DW_TAG_member
    8319                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$39)
    8320                      .dwattr $C$DW$726, DW_AT_name("prevState")
    8321                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_prevState")
    8322                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8323                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8324              
    8325              $C$DW$727       .dwtag  DW_TAG_member
    8326                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$41)
    8327                      .dwattr $C$DW$727, DW_AT_name("errorCode")
    8328                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_errorCode")
    8329                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8330                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8331              
    8332              $C$DW$728       .dwtag  DW_TAG_member
    8333                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$43)
    8334                      .dwattr $C$DW$728, DW_AT_name("clarkeHandle_I")
    8335                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_clarkeHandle_I")
    8336                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8337                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8338              
    8339              $C$DW$729       .dwtag  DW_TAG_member
    8340                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$44)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  159

    8341                      .dwattr $C$DW$729, DW_AT_name("clarke_I")
    8342                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_clarke_I")
    8343                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8344                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8345              
    8346              $C$DW$730       .dwtag  DW_TAG_member
    8347                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$43)
    8348                      .dwattr $C$DW$730, DW_AT_name("clarkeHandle_V")
    8349                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_clarkeHandle_V")
    8350                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8351                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8352              
    8353              $C$DW$731       .dwtag  DW_TAG_member
    8354                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$44)
    8355                      .dwattr $C$DW$731, DW_AT_name("clarke_V")
    8356                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_clarke_V")
    8357                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8358                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8359              
    8360              $C$DW$732       .dwtag  DW_TAG_member
    8361                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$46)
    8362                      .dwattr $C$DW$732, DW_AT_name("estHandle")
    8363                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_estHandle")
    8364                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8365                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8366              
    8367              $C$DW$733       .dwtag  DW_TAG_member
    8368                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$48)
    8369                      .dwattr $C$DW$733, DW_AT_name("parkHandle")
    8370                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_parkHandle")
    8371                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8372                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8373              
    8374              $C$DW$734       .dwtag  DW_TAG_member
    8375                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$49)
    8376                      .dwattr $C$DW$734, DW_AT_name("park")
    8377                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_park")
    8378                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8379                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8380              
    8381              $C$DW$735       .dwtag  DW_TAG_member
    8382                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$51)
    8383                      .dwattr $C$DW$735, DW_AT_name("pidHandle_Id")
    8384                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_pidHandle_Id")
    8385                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8386                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8387              
    8388              $C$DW$736       .dwtag  DW_TAG_member
    8389                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$52)
    8390                      .dwattr $C$DW$736, DW_AT_name("pid_Id")
    8391                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_pid_Id")
    8392                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8393                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8394              
    8395              $C$DW$737       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  160

    8396                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$51)
    8397                      .dwattr $C$DW$737, DW_AT_name("pidHandle_Iq")
    8398                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_pidHandle_Iq")
    8399                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8400                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8401              
    8402              $C$DW$738       .dwtag  DW_TAG_member
    8403                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$52)
    8404                      .dwattr $C$DW$738, DW_AT_name("pid_Iq")
    8405                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_pid_Iq")
    8406                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8407                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8408              
    8409              $C$DW$739       .dwtag  DW_TAG_member
    8410                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$51)
    8411                      .dwattr $C$DW$739, DW_AT_name("pidHandle_spd")
    8412                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_pidHandle_spd")
    8413                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8414                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8415              
    8416              $C$DW$740       .dwtag  DW_TAG_member
    8417                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$52)
    8418                      .dwattr $C$DW$740, DW_AT_name("pid_spd")
    8419                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_pid_spd")
    8420                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8421                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8422              
    8423              $C$DW$741       .dwtag  DW_TAG_member
    8424                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$54)
    8425                      .dwattr $C$DW$741, DW_AT_name("iparkHandle")
    8426                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_iparkHandle")
    8427                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8428                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8429              
    8430              $C$DW$742       .dwtag  DW_TAG_member
    8431                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$55)
    8432                      .dwattr $C$DW$742, DW_AT_name("ipark")
    8433                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_ipark")
    8434                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8435                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8436              
    8437              $C$DW$743       .dwtag  DW_TAG_member
    8438                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$57)
    8439                      .dwattr $C$DW$743, DW_AT_name("svgenHandle")
    8440                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_svgenHandle")
    8441                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8442                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8443              
    8444              $C$DW$744       .dwtag  DW_TAG_member
    8445                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$58)
    8446                      .dwattr $C$DW$744, DW_AT_name("svgen")
    8447                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_svgen")
    8448                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8449                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8450              
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  161

    8451              $C$DW$745       .dwtag  DW_TAG_member
    8452                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$60)
    8453                      .dwattr $C$DW$745, DW_AT_name("trajHandle_Id")
    8454                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_trajHandle_Id")
    8455                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8456                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8457              
    8458              $C$DW$746       .dwtag  DW_TAG_member
    8459                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$61)
    8460                      .dwattr $C$DW$746, DW_AT_name("traj_Id")
    8461                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_traj_Id")
    8462                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    8463                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8464              
    8465              $C$DW$747       .dwtag  DW_TAG_member
    8466                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$60)
    8467                      .dwattr $C$DW$747, DW_AT_name("trajHandle_spd")
    8468                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_trajHandle_spd")
    8469                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    8470                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8471              
    8472              $C$DW$748       .dwtag  DW_TAG_member
    8473                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$61)
    8474                      .dwattr $C$DW$748, DW_AT_name("traj_spd")
    8475                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_traj_spd")
    8476                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    8477                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    8478              
    8479              $C$DW$749       .dwtag  DW_TAG_member
    8480                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$60)
    8481                      .dwattr $C$DW$749, DW_AT_name("trajHandle_spdMax")
    8482                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    8483                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    8484                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    8485              
    8486              $C$DW$750       .dwtag  DW_TAG_member
    8487                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$61)
    8488                      .dwattr $C$DW$750, DW_AT_name("traj_spdMax")
    8489                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_traj_spdMax")
    8490                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    8491                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    8492              
    8493              $C$DW$751       .dwtag  DW_TAG_member
    8494                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$62)
    8495                      .dwattr $C$DW$751, DW_AT_name("motorParams")
    8496                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_motorParams")
    8497                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    8498                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    8499              
    8500              $C$DW$752       .dwtag  DW_TAG_member
    8501                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$65)
    8502                      .dwattr $C$DW$752, DW_AT_name("waitTimes")
    8503                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_waitTimes")
    8504                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    8505                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  162

    8506              
    8507              $C$DW$753       .dwtag  DW_TAG_member
    8508                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$64)
    8509                      .dwattr $C$DW$753, DW_AT_name("counter_state")
    8510                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_counter_state")
    8511                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    8512                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    8513              
    8514              $C$DW$754       .dwtag  DW_TAG_member
    8515                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$66)
    8516                      .dwattr $C$DW$754, DW_AT_name("numIsrTicksPerCtrlTick")
    8517                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    8518                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    8519                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    8520              
    8521              $C$DW$755       .dwtag  DW_TAG_member
    8522                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$66)
    8523                      .dwattr $C$DW$755, DW_AT_name("numCtrlTicksPerCurrentTick")
    8524                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    8525                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    8526                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    8527              
    8528              $C$DW$756       .dwtag  DW_TAG_member
    8529                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$66)
    8530                      .dwattr $C$DW$756, DW_AT_name("numCtrlTicksPerSpeedTick")
    8531                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    8532                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    8533                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    8534              
    8535              $C$DW$757       .dwtag  DW_TAG_member
    8536                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$66)
    8537                      .dwattr $C$DW$757, DW_AT_name("numCtrlTicksPerTrajTick")
    8538                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    8539                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    8540                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    8541              
    8542              $C$DW$758       .dwtag  DW_TAG_member
    8543                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$64)
    8544                      .dwattr $C$DW$758, DW_AT_name("ctrlFreq_Hz")
    8545                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    8546                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    8547                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    8548              
    8549              $C$DW$759       .dwtag  DW_TAG_member
    8550                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$64)
    8551                      .dwattr $C$DW$759, DW_AT_name("trajFreq_Hz")
    8552                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_trajFreq_Hz")
    8553                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    8554                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    8555              
    8556              $C$DW$760       .dwtag  DW_TAG_member
    8557                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$31)
    8558                      .dwattr $C$DW$760, DW_AT_name("trajPeriod_sec")
    8559                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_trajPeriod_sec")
    8560                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  163

    8561                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    8562              
    8563              $C$DW$761       .dwtag  DW_TAG_member
    8564                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$67)
    8565                      .dwattr $C$DW$761, DW_AT_name("ctrlPeriod_sec")
    8566                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    8567                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    8568                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    8569              
    8570              $C$DW$762       .dwtag  DW_TAG_member
    8571                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$31)
    8572                      .dwattr $C$DW$762, DW_AT_name("maxVsMag_pu")
    8573                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_maxVsMag_pu")
    8574                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    8575                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    8576              
    8577              $C$DW$763       .dwtag  DW_TAG_member
    8578                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$68)
    8579                      .dwattr $C$DW$763, DW_AT_name("Iab_in")
    8580                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_Iab_in")
    8581                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    8582                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    8583              
    8584              $C$DW$764       .dwtag  DW_TAG_member
    8585                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$68)
    8586                      .dwattr $C$DW$764, DW_AT_name("Iab_filt")
    8587                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_Iab_filt")
    8588                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    8589                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    8590              
    8591              $C$DW$765       .dwtag  DW_TAG_member
    8592                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$68)
    8593                      .dwattr $C$DW$765, DW_AT_name("Idq_in")
    8594                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_Idq_in")
    8595                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    8596                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    8597              
    8598              $C$DW$766       .dwtag  DW_TAG_member
    8599                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$68)
    8600                      .dwattr $C$DW$766, DW_AT_name("Vab_in")
    8601                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_Vab_in")
    8602                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    8603                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    8604              
    8605              $C$DW$767       .dwtag  DW_TAG_member
    8606                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$31)
    8607                      .dwattr $C$DW$767, DW_AT_name("spd_out")
    8608                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_spd_out")
    8609                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    8610                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8611              
    8612              $C$DW$768       .dwtag  DW_TAG_member
    8613                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$68)
    8614                      .dwattr $C$DW$768, DW_AT_name("Vab_out")
    8615                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_Vab_out")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  164

    8616                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    8617                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8618              
    8619              $C$DW$769       .dwtag  DW_TAG_member
    8620                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$68)
    8621                      .dwattr $C$DW$769, DW_AT_name("Vdq_out")
    8622                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_Vdq_out")
    8623                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    8624                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8625              
    8626              $C$DW$770       .dwtag  DW_TAG_member
    8627                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$67)
    8628                      .dwattr $C$DW$770, DW_AT_name("Rhf")
    8629                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_Rhf")
    8630                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    8631                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8632              
    8633              $C$DW$771       .dwtag  DW_TAG_member
    8634                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$67)
    8635                      .dwattr $C$DW$771, DW_AT_name("Lhf")
    8636                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Lhf")
    8637                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    8638                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8639              
    8640              $C$DW$772       .dwtag  DW_TAG_member
    8641                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$67)
    8642                      .dwattr $C$DW$772, DW_AT_name("RoverL")
    8643                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_RoverL")
    8644                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    8645                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8646              
    8647              $C$DW$773       .dwtag  DW_TAG_member
    8648                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$31)
    8649                      .dwattr $C$DW$773, DW_AT_name("Kp_Id")
    8650                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Kp_Id")
    8651                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    8652                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8653              
    8654              $C$DW$774       .dwtag  DW_TAG_member
    8655                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$31)
    8656                      .dwattr $C$DW$774, DW_AT_name("Kp_Iq")
    8657                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_Kp_Iq")
    8658                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    8659                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8660              
    8661              $C$DW$775       .dwtag  DW_TAG_member
    8662                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$31)
    8663                      .dwattr $C$DW$775, DW_AT_name("Kp_spd")
    8664                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_Kp_spd")
    8665                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    8666                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8667              
    8668              $C$DW$776       .dwtag  DW_TAG_member
    8669                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$31)
    8670                      .dwattr $C$DW$776, DW_AT_name("Ki_Id")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  165

    8671                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Ki_Id")
    8672                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    8673                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8674              
    8675              $C$DW$777       .dwtag  DW_TAG_member
    8676                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$31)
    8677                      .dwattr $C$DW$777, DW_AT_name("Ki_Iq")
    8678                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Ki_Iq")
    8679                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    8680                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    8681              
    8682              $C$DW$778       .dwtag  DW_TAG_member
    8683                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$31)
    8684                      .dwattr $C$DW$778, DW_AT_name("Ki_spd")
    8685                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Ki_spd")
    8686                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    8687                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8688              
    8689              $C$DW$779       .dwtag  DW_TAG_member
    8690                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$31)
    8691                      .dwattr $C$DW$779, DW_AT_name("Kd_Id")
    8692                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Kd_Id")
    8693                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    8694                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8695              
    8696              $C$DW$780       .dwtag  DW_TAG_member
    8697                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$31)
    8698                      .dwattr $C$DW$780, DW_AT_name("Kd_Iq")
    8699                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_Kd_Iq")
    8700                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    8701                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8702              
    8703              $C$DW$781       .dwtag  DW_TAG_member
    8704                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$31)
    8705                      .dwattr $C$DW$781, DW_AT_name("Kd_spd")
    8706                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Kd_spd")
    8707                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    8708                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8709              
    8710              $C$DW$782       .dwtag  DW_TAG_member
    8711                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$31)
    8712                      .dwattr $C$DW$782, DW_AT_name("Ui_Id")
    8713                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Ui_Id")
    8714                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    8715                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    8716              
    8717              $C$DW$783       .dwtag  DW_TAG_member
    8718                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$31)
    8719                      .dwattr $C$DW$783, DW_AT_name("Ui_Iq")
    8720                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Ui_Iq")
    8721                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    8722                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    8723              
    8724              $C$DW$784       .dwtag  DW_TAG_member
    8725                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  166

    8726                      .dwattr $C$DW$784, DW_AT_name("Ui_spd")
    8727                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_Ui_spd")
    8728                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    8729                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    8730              
    8731              $C$DW$785       .dwtag  DW_TAG_member
    8732                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$68)
    8733                      .dwattr $C$DW$785, DW_AT_name("Idq_ref")
    8734                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Idq_ref")
    8735                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    8736                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    8737              
    8738              $C$DW$786       .dwtag  DW_TAG_member
    8739                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$31)
    8740                      .dwattr $C$DW$786, DW_AT_name("IdRated")
    8741                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_IdRated")
    8742                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    8743                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    8744              
    8745              $C$DW$787       .dwtag  DW_TAG_member
    8746                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$31)
    8747                      .dwattr $C$DW$787, DW_AT_name("spd_ref")
    8748                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_spd_ref")
    8749                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    8750                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    8751              
    8752              $C$DW$788       .dwtag  DW_TAG_member
    8753                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$31)
    8754                      .dwattr $C$DW$788, DW_AT_name("spd_max")
    8755                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_spd_max")
    8756                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    8757                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    8758              
    8759              $C$DW$789       .dwtag  DW_TAG_member
    8760                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$66)
    8761                      .dwattr $C$DW$789, DW_AT_name("counter_current")
    8762                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_counter_current")
    8763                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    8764                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    8765              
    8766              $C$DW$790       .dwtag  DW_TAG_member
    8767                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$66)
    8768                      .dwattr $C$DW$790, DW_AT_name("counter_isr")
    8769                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_counter_isr")
    8770                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    8771                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    8772              
    8773              $C$DW$791       .dwtag  DW_TAG_member
    8774                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$66)
    8775                      .dwattr $C$DW$791, DW_AT_name("counter_speed")
    8776                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_counter_speed")
    8777                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    8778                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    8779              
    8780              $C$DW$792       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  167

    8781                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$66)
    8782                      .dwattr $C$DW$792, DW_AT_name("counter_traj")
    8783                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_counter_traj")
    8784                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    8785                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    8786              
    8787              $C$DW$793       .dwtag  DW_TAG_member
    8788                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$69)
    8789                      .dwattr $C$DW$793, DW_AT_name("flag_enableCtrl")
    8790                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_flag_enableCtrl")
    8791                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    8792                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    8793              
    8794              $C$DW$794       .dwtag  DW_TAG_member
    8795                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$69)
    8796                      .dwattr $C$DW$794, DW_AT_name("flag_enableDcBusComp")
    8797                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    8798                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    8799                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    8800              
    8801              $C$DW$795       .dwtag  DW_TAG_member
    8802                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$69)
    8803                      .dwattr $C$DW$795, DW_AT_name("flag_enablePowerWarp")
    8804                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    8805                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    8806                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    8807              
    8808              $C$DW$796       .dwtag  DW_TAG_member
    8809                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$69)
    8810                      .dwattr $C$DW$796, DW_AT_name("flag_enableOffset")
    8811                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_flag_enableOffset")
    8812                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    8813                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    8814              
    8815              $C$DW$797       .dwtag  DW_TAG_member
    8816                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$69)
    8817                      .dwattr $C$DW$797, DW_AT_name("flag_enableSpeedCtrl")
    8818                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    8819                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    8820                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    8821              
    8822              $C$DW$798       .dwtag  DW_TAG_member
    8823                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$69)
    8824                      .dwattr $C$DW$798, DW_AT_name("flag_enableUserMotorParams")
    8825                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    8826                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    8827                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    8828              
    8829              $C$DW$799       .dwtag  DW_TAG_member
    8830                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$68)
    8831                      .dwattr $C$DW$799, DW_AT_name("Idq_offset_pu")
    8832                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_Idq_offset_pu")
    8833                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    8834                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    8835              
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  168

    8836              $C$DW$800       .dwtag  DW_TAG_member
    8837                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$68)
    8838                      .dwattr $C$DW$800, DW_AT_name("Vdq_offset_pu")
    8839                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    8840                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    8841                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    8842              
    8843              $C$DW$801       .dwtag  DW_TAG_member
    8844                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$31)
    8845                      .dwattr $C$DW$801, DW_AT_name("angle_pu")
    8846                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_angle_pu")
    8847                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    8848                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    8849              
    8850              $C$DW$802       .dwtag  DW_TAG_member
    8851                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$31)
    8852                      .dwattr $C$DW$802, DW_AT_name("speed_ref_pu")
    8853                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_speed_ref_pu")
    8854                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    8855                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    8856              
    8857              $C$DW$803       .dwtag  DW_TAG_member
    8858                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$31)
    8859                      .dwattr $C$DW$803, DW_AT_name("speed_fb_pu")
    8860                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_speed_fb_pu")
    8861                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    8862                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    8863              
    8864              $C$DW$804       .dwtag  DW_TAG_member
    8865                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$31)
    8866                      .dwattr $C$DW$804, DW_AT_name("speed_outMax_pu")
    8867                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_speed_outMax_pu")
    8868                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    8869                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    8870              
    8871              $C$DW$805       .dwtag  DW_TAG_member
    8872                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$69)
    8873                      .dwattr $C$DW$805, DW_AT_name("flag_enableCurrentCtrl")
    8874                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    8875                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    8876                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    8877              
    8878                      .dwendtag $C$DW$T$70
    8879              
    8880              $C$DW$T$181     .dwtag  DW_TAG_typedef
    8881                      .dwattr $C$DW$T$181, DW_AT_name("CTRL_Obj")
    8882                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$70)
    8883                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    8884              
    8885              $C$DW$T$167     .dwtag  DW_TAG_pointer_type
    8886                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$70)
    8887                      .dwattr $C$DW$T$167, DW_AT_address_class(0x20)
    8888              
    8889              $C$DW$T$168     .dwtag  DW_TAG_typedef
    8890                      .dwattr $C$DW$T$168, DW_AT_name("CTRL_Handle")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  169

    8891                      .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$167)
    8892                      .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    8893              
    8894              $C$DW$806       .dwtag  DW_TAG_TI_far_type
    8895                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$168)
    8896              
    8897              $C$DW$T$182     .dwtag  DW_TAG_const_type
    8898                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$806)
    8899              
    8900              
    8901              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    8902                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    8903                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    8904              $C$DW$807       .dwtag  DW_TAG_member
    8905                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$22)
    8906                      .dwattr $C$DW$807, DW_AT_name("rsvd")
    8907                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_rsvd")
    8908                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8909                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    8910              
    8911              $C$DW$808       .dwtag  DW_TAG_member
    8912                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$72)
    8913                      .dwattr $C$DW$808, DW_AT_name("targetProc")
    8914                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_targetProc")
    8915                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8916                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    8917              
    8918              $C$DW$809       .dwtag  DW_TAG_member
    8919                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$22)
    8920                      .dwattr $C$DW$809, DW_AT_name("major")
    8921                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_major")
    8922                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8923                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    8924              
    8925              $C$DW$810       .dwtag  DW_TAG_member
    8926                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$22)
    8927                      .dwattr $C$DW$810, DW_AT_name("minor")
    8928                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_minor")
    8929                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8930                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    8931              
    8932                      .dwendtag $C$DW$T$73
    8933              
    8934              $C$DW$T$37      .dwtag  DW_TAG_typedef
    8935                      .dwattr $C$DW$T$37, DW_AT_name("CTRL_Version")
    8936                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    8937                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    8938              
    8939              
    8940              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    8941                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8301_Obj_")
    8942                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    8943              $C$DW$811       .dwtag  DW_TAG_member
    8944                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$75)
    8945                      .dwattr $C$DW$811, DW_AT_name("spiHandle")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  170

    8946                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_spiHandle")
    8947                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8948                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    8949              
    8950              $C$DW$812       .dwtag  DW_TAG_member
    8951                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$77)
    8952                      .dwattr $C$DW$812, DW_AT_name("gpioHandle")
    8953                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_gpioHandle")
    8954                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8955                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    8956              
    8957              $C$DW$813       .dwtag  DW_TAG_member
    8958                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$79)
    8959                      .dwattr $C$DW$813, DW_AT_name("gpioNumber")
    8960                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_gpioNumber")
    8961                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8962                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    8963              
    8964              $C$DW$814       .dwtag  DW_TAG_member
    8965                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$69)
    8966                      .dwattr $C$DW$814, DW_AT_name("RxTimeOut")
    8967                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_RxTimeOut")
    8968                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8969                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    8970              
    8971              $C$DW$815       .dwtag  DW_TAG_member
    8972                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$69)
    8973                      .dwattr $C$DW$815, DW_AT_name("enableTimeOut")
    8974                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_enableTimeOut")
    8975                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8976                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    8977              
    8978                      .dwendtag $C$DW$T$80
    8979              
    8980              $C$DW$T$122     .dwtag  DW_TAG_typedef
    8981                      .dwattr $C$DW$T$122, DW_AT_name("DRV8301_Obj")
    8982                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$80)
    8983                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    8984              
    8985              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    8986                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$80)
    8987                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    8988              
    8989              $C$DW$T$121     .dwtag  DW_TAG_typedef
    8990                      .dwattr $C$DW$T$121, DW_AT_name("DRV8301_Handle")
    8991                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    8992                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    8993              
    8994              
    8995              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8996                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    8997                      .dwattr $C$DW$T$19, DW_AT_declaration
    8998                      .dwendtag $C$DW$T$19
    8999              
    9000              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  171

    9001                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$19)
    9002                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    9003              
    9004              $C$DW$T$46      .dwtag  DW_TAG_typedef
    9005                      .dwattr $C$DW$T$46, DW_AT_name("EST_Handle")
    9006                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    9007                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    9008              
    9009              
    9010              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    9011                      .dwattr $C$DW$T$81, DW_AT_name("_FILTER_FO_")
    9012                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0a)
    9013              $C$DW$816       .dwtag  DW_TAG_member
    9014                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$31)
    9015                      .dwattr $C$DW$816, DW_AT_name("a1")
    9016                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_a1")
    9017                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9018                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    9019              
    9020              $C$DW$817       .dwtag  DW_TAG_member
    9021                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$31)
    9022                      .dwattr $C$DW$817, DW_AT_name("b0")
    9023                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_b0")
    9024                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9025                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    9026              
    9027              $C$DW$818       .dwtag  DW_TAG_member
    9028                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$31)
    9029                      .dwattr $C$DW$818, DW_AT_name("b1")
    9030                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_b1")
    9031                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9032                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    9033              
    9034              $C$DW$819       .dwtag  DW_TAG_member
    9035                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$31)
    9036                      .dwattr $C$DW$819, DW_AT_name("x1")
    9037                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_x1")
    9038                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9039                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    9040              
    9041              $C$DW$820       .dwtag  DW_TAG_member
    9042                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$31)
    9043                      .dwattr $C$DW$820, DW_AT_name("y1")
    9044                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_y1")
    9045                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9046                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    9047              
    9048                      .dwendtag $C$DW$T$81
    9049              
    9050              $C$DW$T$133     .dwtag  DW_TAG_typedef
    9051                      .dwattr $C$DW$T$133, DW_AT_name("FILTER_FO_Obj")
    9052                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$81)
    9053                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    9054              
    9055              $C$DW$T$184     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  172

    9056                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$133)
    9057                      .dwattr $C$DW$T$184, DW_AT_address_class(0x20)
    9058              
    9059              
    9060              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9061                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    9062                      .dwattr $C$DW$T$20, DW_AT_declaration
    9063                      .dwendtag $C$DW$T$20
    9064              
    9065              $C$DW$T$134     .dwtag  DW_TAG_pointer_type
    9066                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$20)
    9067                      .dwattr $C$DW$T$134, DW_AT_address_class(0x20)
    9068              
    9069              $C$DW$T$135     .dwtag  DW_TAG_typedef
    9070                      .dwattr $C$DW$T$135, DW_AT_name("FILTER_FO_Handle")
    9071                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    9072                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    9073              
    9074              
    9075              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    9076                      .dwattr $C$DW$T$82, DW_AT_name("_FLASH_Obj_")
    9077                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x08)
    9078              $C$DW$821       .dwtag  DW_TAG_member
    9079                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$23)
    9080                      .dwattr $C$DW$821, DW_AT_name("FOPT")
    9081                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_FOPT")
    9082                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9083                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    9084              
    9085              $C$DW$822       .dwtag  DW_TAG_member
    9086                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$23)
    9087                      .dwattr $C$DW$822, DW_AT_name("rsvd_1")
    9088                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_rsvd_1")
    9089                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9090                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    9091              
    9092              $C$DW$823       .dwtag  DW_TAG_member
    9093                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$23)
    9094                      .dwattr $C$DW$823, DW_AT_name("FPWR")
    9095                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_FPWR")
    9096                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9097                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    9098              
    9099              $C$DW$824       .dwtag  DW_TAG_member
    9100                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$23)
    9101                      .dwattr $C$DW$824, DW_AT_name("FSTATUS")
    9102                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_FSTATUS")
    9103                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9104                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    9105              
    9106              $C$DW$825       .dwtag  DW_TAG_member
    9107                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$23)
    9108                      .dwattr $C$DW$825, DW_AT_name("FSTDBYWAIT")
    9109                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    9110                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  173

    9111                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    9112              
    9113              $C$DW$826       .dwtag  DW_TAG_member
    9114                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$23)
    9115                      .dwattr $C$DW$826, DW_AT_name("FACTIVEWAIT")
    9116                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    9117                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9118                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    9119              
    9120              $C$DW$827       .dwtag  DW_TAG_member
    9121                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$23)
    9122                      .dwattr $C$DW$827, DW_AT_name("FBANKWAIT")
    9123                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_FBANKWAIT")
    9124                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9125                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    9126              
    9127              $C$DW$828       .dwtag  DW_TAG_member
    9128                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$23)
    9129                      .dwattr $C$DW$828, DW_AT_name("FOTPWAIT")
    9130                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_FOTPWAIT")
    9131                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9132                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    9133              
    9134                      .dwendtag $C$DW$T$82
    9135              
    9136              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    9137                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$82)
    9138                      .dwattr $C$DW$T$95, DW_AT_address_class(0x20)
    9139              
    9140              $C$DW$T$96      .dwtag  DW_TAG_typedef
    9141                      .dwattr $C$DW$T$96, DW_AT_name("FLASH_Handle")
    9142                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    9143                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    9144              
    9145              
    9146              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    9147                      .dwattr $C$DW$T$86, DW_AT_name("_GPIO_Obj_")
    9148                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x6a)
    9149              $C$DW$829       .dwtag  DW_TAG_member
    9150                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$83)
    9151                      .dwattr $C$DW$829, DW_AT_name("GPACTRL")
    9152                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_GPACTRL")
    9153                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9154                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    9155              
    9156              $C$DW$830       .dwtag  DW_TAG_member
    9157                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$83)
    9158                      .dwattr $C$DW$830, DW_AT_name("GPAQSEL1")
    9159                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_GPAQSEL1")
    9160                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9161                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    9162              
    9163              $C$DW$831       .dwtag  DW_TAG_member
    9164                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$83)
    9165                      .dwattr $C$DW$831, DW_AT_name("GPAQSEL2")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0950010                         PAGE  174

    9166                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_GPAQSEL2")
    9167                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9168                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    9169              
    9170              $C$DW$832       .dwtag  DW_TAG_member
    9171                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$83)
    9172                      .dwattr $C$DW$832, DW_AT_name("GPAMUX1")
    9173                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_GPAMUX1")
    9174                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9175                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    9176              
    9177              $C$DW$833       .dwtag  DW_TAG_member
    9178                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$83)
    9179                      .dwattr $C$DW$833, DW_AT_name("GPAMUX2")
    9180                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_GPAMUX2")
    9181                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9182                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    9183              
    9184              $C$DW$834       .dwtag  DW_TAG_member
    9185                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$83)
    9186                      .dwattr $C$DW$834, DW_AT_name("GPADIR")
    9187                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_GPADIR")
    9188                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
