TMS320C2000 Assembler PC v15.12.3 Fri Feb 24 10:50:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1110010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Fri Feb 24 10:50:34 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/fw/src/32b/fw.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\guilherme\workspace_v6_2\proj_ITS\Flash")
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\opt2000.exe C:\\Users\\GUILHE~1\\AppData\\Local\\Tem
      14              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\ac2000.exe -@C:\\Users\\GUILHE~1\\AppData\\Local\\Te
      15 00000000               .sect   ".text"
      16                      .clink
      17                      .global _FW_init
      18              
      19              $C$DW$1 .dwtag  DW_TAG_subprogram
      20                      .dwattr $C$DW$1, DW_AT_name("FW_init")
      21                      .dwattr $C$DW$1, DW_AT_low_pc(_FW_init)
      22                      .dwattr $C$DW$1, DW_AT_high_pc(0x00)
      23                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_FW_init")
      24                      .dwattr $C$DW$1, DW_AT_external
      25                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$24)
      26                      .dwattr $C$DW$1, DW_AT_TI_begin_file("C:/ti/motorware/motorware_1_01_00_16/sw/modules/fw/src/32b/fw.c
      27                      .dwattr $C$DW$1, DW_AT_TI_begin_line(0x37)
      28                      .dwattr $C$DW$1, DW_AT_TI_begin_column(0x0b)
      29                      .dwattr $C$DW$1, DW_AT_TI_max_frame_size(-2)
      30                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_16/sw/modules/fw/src/32b/fw.c",line 56,column 1,is_st
      31              
      32                      .dwfde $C$DW$CIE, _FW_init
      33              $C$DW$2 .dwtag  DW_TAG_formal_parameter
      34                      .dwattr $C$DW$2, DW_AT_name("pMemory")
      35                      .dwattr $C$DW$2, DW_AT_TI_symbol_name("_pMemory")
      36                      .dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)
      37                      .dwattr $C$DW$2, DW_AT_location[DW_OP_reg12]
      38              
      39              $C$DW$3 .dwtag  DW_TAG_formal_parameter
      40                      .dwattr $C$DW$3, DW_AT_name("numBytes")
      41                      .dwattr $C$DW$3, DW_AT_TI_symbol_name("_numBytes")
      42                      .dwattr $C$DW$3, DW_AT_type(*$C$DW$T$26)
      43                      .dwattr $C$DW$3, DW_AT_location[DW_OP_reg0]
      44              
      45              
      46              ;***************************************************************
      47              ;* FNAME: _FW_init                      FR SIZE:   0           *
      48              ;*                                                             *
      49              ;* FUNCTION ENVIRONMENT                                        *
      50              ;*                                                             *
      51              ;* FUNCTION PROPERTIES                                         *
      52              ;*                            0 Parameter,  0 Auto,  0 SOE     *
      53              ;***************************************************************
      54              
      55              _FW_init:
TMS320C2000 Assembler PC v15.12.3 Fri Feb 24 10:50:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1110010                         PAGE    2

      56              ;* AR6   assigned to _numBytes
      57              $C$DW$4 .dwtag  DW_TAG_variable
      58                      .dwattr $C$DW$4, DW_AT_name("numBytes")
      59                      .dwattr $C$DW$4, DW_AT_TI_symbol_name("_numBytes")
      60                      .dwattr $C$DW$4, DW_AT_type(*$C$DW$T$26)
      61                      .dwattr $C$DW$4, DW_AT_location[DW_OP_reg16]
      62              
      63                      .dwcfi  cfa_offset, -2
      64                      .dwcfi  save_reg_to_mem, 26, 0
      65 00000000 1EA6          MOVL      XAR6,ACC              ; [CPU_] |56| 
      66                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_16/sw/modules/fw/src/32b/fw.c",line 60,column 5,is_st
      67 00000001 0214          MOVB      ACC,#20               ; [CPU_] |60| 
      68 00000002 0FA6          CMPL      ACC,XAR6              ; [CPU_] |60| 
      69 00000003 6902          B         $C$L1,LOS             ; [CPU_] |60| 
      70                      ; branchcc occurs ; [] |60| 
      71 00000004 D400          MOVB      XAR4,#0               ; [CPU_] |60| 
      72              $C$L1:    
      73              $C$DW$5 .dwtag  DW_TAG_TI_branch
      74                      .dwattr $C$DW$5, DW_AT_low_pc(0x00)
      75                      .dwattr $C$DW$5, DW_AT_TI_return
      76              
      77 00000005 0006          LRETR     ; [CPU_] 
      78                      ; return occurs ; [] 
      79                      .dwattr $C$DW$1, DW_AT_TI_end_file("C:/ti/motorware/motorware_1_01_00_16/sw/modules/fw/src/32b/fw.c")
      80                      .dwattr $C$DW$1, DW_AT_TI_end_line(0x42)
      81                      .dwattr $C$DW$1, DW_AT_TI_end_column(0x01)
      82                      .dwendentry
      83                      .dwendtag $C$DW$1
      84              
      85              
      86              ;***************************************************************
      87              ;* TYPE INFORMATION                                            *
      88              ;***************************************************************
      89              
      90              $C$DW$T$22      .dwtag  DW_TAG_structure_type
      91                      .dwattr $C$DW$T$22, DW_AT_name("_FW_Obj_")
      92                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x14)
      93              $C$DW$6 .dwtag  DW_TAG_member
      94                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
      95                      .dwattr $C$DW$6, DW_AT_name("numIsrTicksPerFwTick")
      96                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_numIsrTicksPerFwTick")
      97                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
      98                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
      99              
     100              $C$DW$7 .dwtag  DW_TAG_member
     101                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     102                      .dwattr $C$DW$7, DW_AT_name("counter_fw")
     103                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_counter_fw")
     104                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     105                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     106              
     107              $C$DW$8 .dwtag  DW_TAG_member
     108                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$20)
     109                      .dwattr $C$DW$8, DW_AT_name("delta_inc")
     110                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_delta_inc")
TMS320C2000 Assembler PC v15.12.3 Fri Feb 24 10:50:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1110010                         PAGE    3

     111                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     112                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     113              
     114              $C$DW$9 .dwtag  DW_TAG_member
     115                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$20)
     116                      .dwattr $C$DW$9, DW_AT_name("delta_dec")
     117                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_delta_dec")
     118                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     119                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     120              
     121              $C$DW$10        .dwtag  DW_TAG_member
     122                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$20)
     123                      .dwattr $C$DW$10, DW_AT_name("refValue")
     124                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_refValue")
     125                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     126                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     127              
     128              $C$DW$11        .dwtag  DW_TAG_member
     129                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$20)
     130                      .dwattr $C$DW$11, DW_AT_name("fbackValue")
     131                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_fbackValue")
     132                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     133                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     134              
     135              $C$DW$12        .dwtag  DW_TAG_member
     136                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$20)
     137                      .dwattr $C$DW$12, DW_AT_name("output")
     138                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_output")
     139                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     140                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     141              
     142              $C$DW$13        .dwtag  DW_TAG_member
     143                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$20)
     144                      .dwattr $C$DW$13, DW_AT_name("outMin")
     145                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_outMin")
     146                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     147                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     148              
     149              $C$DW$14        .dwtag  DW_TAG_member
     150                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
     151                      .dwattr $C$DW$14, DW_AT_name("outMax")
     152                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_outMax")
     153                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     154                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     155              
     156              $C$DW$15        .dwtag  DW_TAG_member
     157                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$21)
     158                      .dwattr $C$DW$15, DW_AT_name("flag_enableFw")
     159                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_flag_enableFw")
     160                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     161                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     162              
     163                      .dwendtag $C$DW$T$22
     164              
     165              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v15.12.3 Fri Feb 24 10:50:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1110010                         PAGE    4

     166                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     167                      .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
     168              
     169              $C$DW$T$24      .dwtag  DW_TAG_typedef
     170                      .dwattr $C$DW$T$24, DW_AT_name("FW_Handle")
     171                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     172                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
     173              
     174              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     175                      .dwattr $C$DW$T$2, DW_AT_name("void")
     176              
     177              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     178                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     179                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     180              
     181              $C$DW$T$4       .dwtag  DW_TAG_base_type
     182                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     183                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     184                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     185              
     186              $C$DW$T$5       .dwtag  DW_TAG_base_type
     187                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     188                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     189                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     190              
     191              $C$DW$T$6       .dwtag  DW_TAG_base_type
     192                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     193                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     194                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     195              
     196              $C$DW$T$7       .dwtag  DW_TAG_base_type
     197                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     198                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     199                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     200              
     201              $C$DW$T$8       .dwtag  DW_TAG_base_type
     202                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     203                      .dwattr $C$DW$T$8, DW_AT_name("short")
     204                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     205              
     206              $C$DW$T$9       .dwtag  DW_TAG_base_type
     207                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     208                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     209                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     210              
     211              $C$DW$T$10      .dwtag  DW_TAG_base_type
     212                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     213                      .dwattr $C$DW$T$10, DW_AT_name("int")
     214                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     215              
     216              $C$DW$T$11      .dwtag  DW_TAG_base_type
     217                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     218                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     219                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     220              
TMS320C2000 Assembler PC v15.12.3 Fri Feb 24 10:50:34 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
