TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Thu Mar 02 12:12:43 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/hal/boards/boostxldrv83
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\guilherme\workspace_v6_2\proj_ITS\Flash")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SPI_setCharLength")

   12890                      .dwattr $C$DW$1703, DW_AT_name("SPI_Mode_Master")
   12891                      .dwattr $C$DW$1703, DW_AT_const_value(0x04)
   12892              
   12893                      .dwendtag $C$DW$T$318
   12894              
   12895              $C$DW$T$319     .dwtag  DW_TAG_typedef
   12896                      .dwattr $C$DW$T$319, DW_AT_name("SPI_Mode_e")
   12897                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$T$318)
   12898                      .dwattr $C$DW$T$319, DW_AT_language(DW_LANG_C)
   12899              
   12900              $C$DW$1704      .dwtag  DW_TAG_TI_far_type
   12901                      .dwattr $C$DW$1704, DW_AT_type(*$C$DW$T$319)
   12902              
   12903              $C$DW$T$320     .dwtag  DW_TAG_const_type
   12904                      .dwattr $C$DW$T$320, DW_AT_type(*$C$DW$1704)
   12905              
   12906              
   12907              $C$DW$T$321     .dwtag  DW_TAG_enumeration_type
   12908                      .dwattr $C$DW$T$321, DW_AT_byte_size(0x01)
   12909              $C$DW$1705      .dwtag  DW_TAG_enumerator
   12910                      .dwattr $C$DW$1705, DW_AT_name("SPI_TxSuspend_00")
   12911                      .dwattr $C$DW$1705, DW_AT_const_value(0x00)
   12912              
   12913              $C$DW$1706      .dwtag  DW_TAG_enumerator
   12914                      .dwattr $C$DW$1706, DW_AT_name("SPI_TxSuspend_10")
   12915                      .dwattr $C$DW$1706, DW_AT_const_value(0x20)
   12916              
   12917              $C$DW$1707      .dwtag  DW_TAG_enumerator
   12918                      .dwattr $C$DW$1707, DW_AT_name("SPI_TxSuspend_free")
   12919                      .dwattr $C$DW$1707, DW_AT_const_value(0x10)
   12920              
   12921                      .dwendtag $C$DW$T$321
   12922              
   12923              $C$DW$T$322     .dwtag  DW_TAG_typedef
   12924                      .dwattr $C$DW$T$322, DW_AT_name("SPI_EmulationSuspend_e")
   12925                      .dwattr $C$DW$T$322, DW_AT_type(*$C$DW$T$321)
   12926                      .dwattr $C$DW$T$322, DW_AT_language(DW_LANG_C)
   12927              
   12928              $C$DW$1708      .dwtag  DW_TAG_TI_far_type
   12929                      .dwattr $C$DW$1708, DW_AT_type(*$C$DW$T$322)
   12930              
   12931              $C$DW$T$323     .dwtag  DW_TAG_const_type
   12932                      .dwattr $C$DW$T$323, DW_AT_type(*$C$DW$1708)
   12933              
   12934              
   12935              $C$DW$T$324     .dwtag  DW_TAG_enumeration_type
   12936                      .dwattr $C$DW$T$324, DW_AT_byte_size(0x01)
   12937              $C$DW$1709      .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  245

   12938                      .dwattr $C$DW$1709, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement")
   12939                      .dwattr $C$DW$1709, DW_AT_const_value(0x00)
   12940              
   12941              $C$DW$1710      .dwtag  DW_TAG_enumerator
   12942                      .dwattr $C$DW$1710, DW_AT_name("TIMER_EmulationMode_StopAtZero")
   12943                      .dwattr $C$DW$1710, DW_AT_const_value(0x400)
   12944              
   12945              $C$DW$1711      .dwtag  DW_TAG_enumerator
   12946                      .dwattr $C$DW$1711, DW_AT_name("TIMER_EmulationMode_RunFree")
   12947                      .dwattr $C$DW$1711, DW_AT_const_value(0x800)
   12948              
   12949                      .dwendtag $C$DW$T$324
   12950              
   12951              $C$DW$T$325     .dwtag  DW_TAG_typedef
   12952                      .dwattr $C$DW$T$325, DW_AT_name("TIMER_EmulationMode_e")
   12953                      .dwattr $C$DW$T$325, DW_AT_type(*$C$DW$T$324)
   12954                      .dwattr $C$DW$T$325, DW_AT_language(DW_LANG_C)
   12955              
   12956              $C$DW$1712      .dwtag  DW_TAG_TI_far_type
   12957                      .dwattr $C$DW$1712, DW_AT_type(*$C$DW$T$325)
   12958              
   12959              $C$DW$T$326     .dwtag  DW_TAG_const_type
   12960                      .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$1712)
   12961              
   12962              
   12963              $C$DW$T$327     .dwtag  DW_TAG_enumeration_type
   12964                      .dwattr $C$DW$T$327, DW_AT_byte_size(0x01)
   12965              $C$DW$1713      .dwtag  DW_TAG_enumerator
   12966                      .dwattr $C$DW$1713, DW_AT_name("HAL_SensorType_Current")
   12967                      .dwattr $C$DW$1713, DW_AT_const_value(0x00)
   12968              
   12969              $C$DW$1714      .dwtag  DW_TAG_enumerator
   12970                      .dwattr $C$DW$1714, DW_AT_name("HAL_SensorType_Voltage")
   12971                      .dwattr $C$DW$1714, DW_AT_const_value(0x01)
   12972              
   12973                      .dwendtag $C$DW$T$327
   12974              
   12975              $C$DW$T$328     .dwtag  DW_TAG_typedef
   12976                      .dwattr $C$DW$T$328, DW_AT_name("HAL_SensorType_e")
   12977                      .dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$327)
   12978                      .dwattr $C$DW$T$328, DW_AT_language(DW_LANG_C)
   12979              
   12980              
   12981              $C$DW$T$29      .dwtag  DW_TAG_structure_type
   12982                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
   12983                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
   12984              $C$DW$1715      .dwtag  DW_TAG_member
   12985                      .dwattr $C$DW$1715, DW_AT_type(*$C$DW$T$23)
   12986                      .dwattr $C$DW$1715, DW_AT_name("ADCRESULT")
   12987                      .dwattr $C$DW$1715, DW_AT_TI_symbol_name("_ADCRESULT")
   12988                      .dwattr $C$DW$1715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12989                      .dwattr $C$DW$1715, DW_AT_accessibility(DW_ACCESS_public)
   12990              
   12991              $C$DW$1716      .dwtag  DW_TAG_member
   12992                      .dwattr $C$DW$1716, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  246

   12993                      .dwattr $C$DW$1716, DW_AT_name("resvd_1")
   12994                      .dwattr $C$DW$1716, DW_AT_TI_symbol_name("_resvd_1")
   12995                      .dwattr $C$DW$1716, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12996                      .dwattr $C$DW$1716, DW_AT_accessibility(DW_ACCESS_public)
   12997              
   12998              $C$DW$1717      .dwtag  DW_TAG_member
   12999                      .dwattr $C$DW$1717, DW_AT_type(*$C$DW$T$22)
   13000                      .dwattr $C$DW$1717, DW_AT_name("ADCCTL1")
   13001                      .dwattr $C$DW$1717, DW_AT_TI_symbol_name("_ADCCTL1")
   13002                      .dwattr $C$DW$1717, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   13003                      .dwattr $C$DW$1717, DW_AT_accessibility(DW_ACCESS_public)
   13004              
   13005              $C$DW$1718      .dwtag  DW_TAG_member
   13006                      .dwattr $C$DW$1718, DW_AT_type(*$C$DW$T$22)
   13007                      .dwattr $C$DW$1718, DW_AT_name("ADCCTL2")
   13008                      .dwattr $C$DW$1718, DW_AT_TI_symbol_name("_ADCCTL2")
   13009                      .dwattr $C$DW$1718, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   13010                      .dwattr $C$DW$1718, DW_AT_accessibility(DW_ACCESS_public)
   13011              
   13012              $C$DW$1719      .dwtag  DW_TAG_member
   13013                      .dwattr $C$DW$1719, DW_AT_type(*$C$DW$T$25)
   13014                      .dwattr $C$DW$1719, DW_AT_name("rsvd_2")
   13015                      .dwattr $C$DW$1719, DW_AT_TI_symbol_name("_rsvd_2")
   13016                      .dwattr $C$DW$1719, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   13017                      .dwattr $C$DW$1719, DW_AT_accessibility(DW_ACCESS_public)
   13018              
   13019              $C$DW$1720      .dwtag  DW_TAG_member
   13020                      .dwattr $C$DW$1720, DW_AT_type(*$C$DW$T$22)
   13021                      .dwattr $C$DW$1720, DW_AT_name("ADCINTFLG")
   13022                      .dwattr $C$DW$1720, DW_AT_TI_symbol_name("_ADCINTFLG")
   13023                      .dwattr $C$DW$1720, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   13024                      .dwattr $C$DW$1720, DW_AT_accessibility(DW_ACCESS_public)
   13025              
   13026              $C$DW$1721      .dwtag  DW_TAG_member
   13027                      .dwattr $C$DW$1721, DW_AT_type(*$C$DW$T$22)
   13028                      .dwattr $C$DW$1721, DW_AT_name("ADCINTFLGCLR")
   13029                      .dwattr $C$DW$1721, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   13030                      .dwattr $C$DW$1721, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   13031                      .dwattr $C$DW$1721, DW_AT_accessibility(DW_ACCESS_public)
   13032              
   13033              $C$DW$1722      .dwtag  DW_TAG_member
   13034                      .dwattr $C$DW$1722, DW_AT_type(*$C$DW$T$22)
   13035                      .dwattr $C$DW$1722, DW_AT_name("ADCINTOVF")
   13036                      .dwattr $C$DW$1722, DW_AT_TI_symbol_name("_ADCINTOVF")
   13037                      .dwattr $C$DW$1722, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   13038                      .dwattr $C$DW$1722, DW_AT_accessibility(DW_ACCESS_public)
   13039              
   13040              $C$DW$1723      .dwtag  DW_TAG_member
   13041                      .dwattr $C$DW$1723, DW_AT_type(*$C$DW$T$22)
   13042                      .dwattr $C$DW$1723, DW_AT_name("ADCINTOVFCLR")
   13043                      .dwattr $C$DW$1723, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   13044                      .dwattr $C$DW$1723, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   13045                      .dwattr $C$DW$1723, DW_AT_accessibility(DW_ACCESS_public)
   13046              
   13047              $C$DW$1724      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  247

   13048                      .dwattr $C$DW$1724, DW_AT_type(*$C$DW$T$26)
   13049                      .dwattr $C$DW$1724, DW_AT_name("INTSELxNy")
   13050                      .dwattr $C$DW$1724, DW_AT_TI_symbol_name("_INTSELxNy")
   13051                      .dwattr $C$DW$1724, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   13052                      .dwattr $C$DW$1724, DW_AT_accessibility(DW_ACCESS_public)
   13053              
   13054              $C$DW$1725      .dwtag  DW_TAG_member
   13055                      .dwattr $C$DW$1725, DW_AT_type(*$C$DW$T$27)
   13056                      .dwattr $C$DW$1725, DW_AT_name("rsvd_3")
   13057                      .dwattr $C$DW$1725, DW_AT_TI_symbol_name("_rsvd_3")
   13058                      .dwattr $C$DW$1725, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   13059                      .dwattr $C$DW$1725, DW_AT_accessibility(DW_ACCESS_public)
   13060              
   13061              $C$DW$1726      .dwtag  DW_TAG_member
   13062                      .dwattr $C$DW$1726, DW_AT_type(*$C$DW$T$22)
   13063                      .dwattr $C$DW$1726, DW_AT_name("SOCPRICTRL")
   13064                      .dwattr $C$DW$1726, DW_AT_TI_symbol_name("_SOCPRICTRL")
   13065                      .dwattr $C$DW$1726, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   13066                      .dwattr $C$DW$1726, DW_AT_accessibility(DW_ACCESS_public)
   13067              
   13068              $C$DW$1727      .dwtag  DW_TAG_member
   13069                      .dwattr $C$DW$1727, DW_AT_type(*$C$DW$T$22)
   13070                      .dwattr $C$DW$1727, DW_AT_name("rsvd_4")
   13071                      .dwattr $C$DW$1727, DW_AT_TI_symbol_name("_rsvd_4")
   13072                      .dwattr $C$DW$1727, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   13073                      .dwattr $C$DW$1727, DW_AT_accessibility(DW_ACCESS_public)
   13074              
   13075              $C$DW$1728      .dwtag  DW_TAG_member
   13076                      .dwattr $C$DW$1728, DW_AT_type(*$C$DW$T$22)
   13077                      .dwattr $C$DW$1728, DW_AT_name("ADCSAMPLEMODE")
   13078                      .dwattr $C$DW$1728, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   13079                      .dwattr $C$DW$1728, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   13080                      .dwattr $C$DW$1728, DW_AT_accessibility(DW_ACCESS_public)
   13081              
   13082              $C$DW$1729      .dwtag  DW_TAG_member
   13083                      .dwattr $C$DW$1729, DW_AT_type(*$C$DW$T$22)
   13084                      .dwattr $C$DW$1729, DW_AT_name("rsvd_5")
   13085                      .dwattr $C$DW$1729, DW_AT_TI_symbol_name("_rsvd_5")
   13086                      .dwattr $C$DW$1729, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   13087                      .dwattr $C$DW$1729, DW_AT_accessibility(DW_ACCESS_public)
   13088              
   13089              $C$DW$1730      .dwtag  DW_TAG_member
   13090                      .dwattr $C$DW$1730, DW_AT_type(*$C$DW$T$22)
   13091                      .dwattr $C$DW$1730, DW_AT_name("ADCINTSOCSEL1")
   13092                      .dwattr $C$DW$1730, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   13093                      .dwattr $C$DW$1730, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   13094                      .dwattr $C$DW$1730, DW_AT_accessibility(DW_ACCESS_public)
   13095              
   13096              $C$DW$1731      .dwtag  DW_TAG_member
   13097                      .dwattr $C$DW$1731, DW_AT_type(*$C$DW$T$22)
   13098                      .dwattr $C$DW$1731, DW_AT_name("ADCINTSOCSEL2")
   13099                      .dwattr $C$DW$1731, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   13100                      .dwattr $C$DW$1731, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   13101                      .dwattr $C$DW$1731, DW_AT_accessibility(DW_ACCESS_public)
   13102              
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  248

   13103              $C$DW$1732      .dwtag  DW_TAG_member
   13104                      .dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$25)
   13105                      .dwattr $C$DW$1732, DW_AT_name("rsvd_6")
   13106                      .dwattr $C$DW$1732, DW_AT_TI_symbol_name("_rsvd_6")
   13107                      .dwattr $C$DW$1732, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   13108                      .dwattr $C$DW$1732, DW_AT_accessibility(DW_ACCESS_public)
   13109              
   13110              $C$DW$1733      .dwtag  DW_TAG_member
   13111                      .dwattr $C$DW$1733, DW_AT_type(*$C$DW$T$22)
   13112                      .dwattr $C$DW$1733, DW_AT_name("ADCSOCFLG1")
   13113                      .dwattr $C$DW$1733, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   13114                      .dwattr $C$DW$1733, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   13115                      .dwattr $C$DW$1733, DW_AT_accessibility(DW_ACCESS_public)
   13116              
   13117              $C$DW$1734      .dwtag  DW_TAG_member
   13118                      .dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$22)
   13119                      .dwattr $C$DW$1734, DW_AT_name("rsvd_7")
   13120                      .dwattr $C$DW$1734, DW_AT_TI_symbol_name("_rsvd_7")
   13121                      .dwattr $C$DW$1734, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   13122                      .dwattr $C$DW$1734, DW_AT_accessibility(DW_ACCESS_public)
   13123              
   13124              $C$DW$1735      .dwtag  DW_TAG_member
   13125                      .dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$22)
   13126                      .dwattr $C$DW$1735, DW_AT_name("ADCSOCFRC1")
   13127                      .dwattr $C$DW$1735, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   13128                      .dwattr $C$DW$1735, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   13129                      .dwattr $C$DW$1735, DW_AT_accessibility(DW_ACCESS_public)
   13130              
   13131              $C$DW$1736      .dwtag  DW_TAG_member
   13132                      .dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$22)
   13133                      .dwattr $C$DW$1736, DW_AT_name("rsvd_8")
   13134                      .dwattr $C$DW$1736, DW_AT_TI_symbol_name("_rsvd_8")
   13135                      .dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   13136                      .dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
   13137              
   13138              $C$DW$1737      .dwtag  DW_TAG_member
   13139                      .dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$22)
   13140                      .dwattr $C$DW$1737, DW_AT_name("ADCSOCOVF1")
   13141                      .dwattr $C$DW$1737, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   13142                      .dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   13143                      .dwattr $C$DW$1737, DW_AT_accessibility(DW_ACCESS_public)
   13144              
   13145              $C$DW$1738      .dwtag  DW_TAG_member
   13146                      .dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$22)
   13147                      .dwattr $C$DW$1738, DW_AT_name("rsvd_9")
   13148                      .dwattr $C$DW$1738, DW_AT_TI_symbol_name("_rsvd_9")
   13149                      .dwattr $C$DW$1738, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   13150                      .dwattr $C$DW$1738, DW_AT_accessibility(DW_ACCESS_public)
   13151              
   13152              $C$DW$1739      .dwtag  DW_TAG_member
   13153                      .dwattr $C$DW$1739, DW_AT_type(*$C$DW$T$22)
   13154                      .dwattr $C$DW$1739, DW_AT_name("ADCSOCOVFCLR1")
   13155                      .dwattr $C$DW$1739, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   13156                      .dwattr $C$DW$1739, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   13157                      .dwattr $C$DW$1739, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  249

   13158              
   13159              $C$DW$1740      .dwtag  DW_TAG_member
   13160                      .dwattr $C$DW$1740, DW_AT_type(*$C$DW$T$22)
   13161                      .dwattr $C$DW$1740, DW_AT_name("rsvd_10")
   13162                      .dwattr $C$DW$1740, DW_AT_TI_symbol_name("_rsvd_10")
   13163                      .dwattr $C$DW$1740, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   13164                      .dwattr $C$DW$1740, DW_AT_accessibility(DW_ACCESS_public)
   13165              
   13166              $C$DW$1741      .dwtag  DW_TAG_member
   13167                      .dwattr $C$DW$1741, DW_AT_type(*$C$DW$T$23)
   13168                      .dwattr $C$DW$1741, DW_AT_name("ADCSOCxCTL")
   13169                      .dwattr $C$DW$1741, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   13170                      .dwattr $C$DW$1741, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   13171                      .dwattr $C$DW$1741, DW_AT_accessibility(DW_ACCESS_public)
   13172              
   13173              $C$DW$1742      .dwtag  DW_TAG_member
   13174                      .dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$23)
   13175                      .dwattr $C$DW$1742, DW_AT_name("rsvd_11")
   13176                      .dwattr $C$DW$1742, DW_AT_TI_symbol_name("_rsvd_11")
   13177                      .dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   13178                      .dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
   13179              
   13180              $C$DW$1743      .dwtag  DW_TAG_member
   13181                      .dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$22)
   13182                      .dwattr $C$DW$1743, DW_AT_name("ADCREFTRIM")
   13183                      .dwattr $C$DW$1743, DW_AT_TI_symbol_name("_ADCREFTRIM")
   13184                      .dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   13185                      .dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
   13186              
   13187              $C$DW$1744      .dwtag  DW_TAG_member
   13188                      .dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$22)
   13189                      .dwattr $C$DW$1744, DW_AT_name("ADCOFFTRIM")
   13190                      .dwattr $C$DW$1744, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   13191                      .dwattr $C$DW$1744, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   13192                      .dwattr $C$DW$1744, DW_AT_accessibility(DW_ACCESS_public)
   13193              
   13194              $C$DW$1745      .dwtag  DW_TAG_member
   13195                      .dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$28)
   13196                      .dwattr $C$DW$1745, DW_AT_name("resvd_12")
   13197                      .dwattr $C$DW$1745, DW_AT_TI_symbol_name("_resvd_12")
   13198                      .dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   13199                      .dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
   13200              
   13201              $C$DW$1746      .dwtag  DW_TAG_member
   13202                      .dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$22)
   13203                      .dwattr $C$DW$1746, DW_AT_name("ADCREV")
   13204                      .dwattr $C$DW$1746, DW_AT_TI_symbol_name("_ADCREV")
   13205                      .dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   13206                      .dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
   13207              
   13208                      .dwendtag $C$DW$T$29
   13209              
   13210              $C$DW$T$330     .dwtag  DW_TAG_typedef
   13211                      .dwattr $C$DW$T$330, DW_AT_name("ADC_Obj")
   13212                      .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  250

   13213                      .dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
   13214              
   13215              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   13216                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$29)
   13217                      .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
   13218              
   13219              $C$DW$T$80      .dwtag  DW_TAG_typedef
   13220                      .dwattr $C$DW$T$80, DW_AT_name("ADC_Handle")
   13221                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
   13222                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   13223              
   13224              
   13225              $C$DW$T$31      .dwtag  DW_TAG_structure_type
   13226                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
   13227                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
   13228              $C$DW$1747      .dwtag  DW_TAG_member
   13229                      .dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$22)
   13230                      .dwattr $C$DW$1747, DW_AT_name("XCLK")
   13231                      .dwattr $C$DW$1747, DW_AT_TI_symbol_name("_XCLK")
   13232                      .dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13233                      .dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
   13234              
   13235              $C$DW$1748      .dwtag  DW_TAG_member
   13236                      .dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$22)
   13237                      .dwattr $C$DW$1748, DW_AT_name("rsvd_1")
   13238                      .dwattr $C$DW$1748, DW_AT_TI_symbol_name("_rsvd_1")
   13239                      .dwattr $C$DW$1748, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13240                      .dwattr $C$DW$1748, DW_AT_accessibility(DW_ACCESS_public)
   13241              
   13242              $C$DW$1749      .dwtag  DW_TAG_member
   13243                      .dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$22)
   13244                      .dwattr $C$DW$1749, DW_AT_name("CLKCTL")
   13245                      .dwattr $C$DW$1749, DW_AT_TI_symbol_name("_CLKCTL")
   13246                      .dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13247                      .dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
   13248              
   13249              $C$DW$1750      .dwtag  DW_TAG_member
   13250                      .dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$30)
   13251                      .dwattr $C$DW$1750, DW_AT_name("rsvd_2")
   13252                      .dwattr $C$DW$1750, DW_AT_TI_symbol_name("_rsvd_2")
   13253                      .dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13254                      .dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
   13255              
   13256              $C$DW$1751      .dwtag  DW_TAG_member
   13257                      .dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$22)
   13258                      .dwattr $C$DW$1751, DW_AT_name("LOSPCP")
   13259                      .dwattr $C$DW$1751, DW_AT_TI_symbol_name("_LOSPCP")
   13260                      .dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13261                      .dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
   13262              
   13263              $C$DW$1752      .dwtag  DW_TAG_member
   13264                      .dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$22)
   13265                      .dwattr $C$DW$1752, DW_AT_name("PCLKCR0")
   13266                      .dwattr $C$DW$1752, DW_AT_TI_symbol_name("_PCLKCR0")
   13267                      .dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  251

   13268                      .dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
   13269              
   13270              $C$DW$1753      .dwtag  DW_TAG_member
   13271                      .dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$22)
   13272                      .dwattr $C$DW$1753, DW_AT_name("PCLKCR1")
   13273                      .dwattr $C$DW$1753, DW_AT_TI_symbol_name("_PCLKCR1")
   13274                      .dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13275                      .dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
   13276              
   13277              $C$DW$1754      .dwtag  DW_TAG_member
   13278                      .dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$25)
   13279                      .dwattr $C$DW$1754, DW_AT_name("rsvd_3")
   13280                      .dwattr $C$DW$1754, DW_AT_TI_symbol_name("_rsvd_3")
   13281                      .dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13282                      .dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
   13283              
   13284              $C$DW$1755      .dwtag  DW_TAG_member
   13285                      .dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$22)
   13286                      .dwattr $C$DW$1755, DW_AT_name("PCLKCR3")
   13287                      .dwattr $C$DW$1755, DW_AT_TI_symbol_name("_PCLKCR3")
   13288                      .dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13289                      .dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
   13290              
   13291                      .dwendtag $C$DW$T$31
   13292              
   13293              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
   13294                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$31)
   13295                      .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
   13296              
   13297              $C$DW$T$82      .dwtag  DW_TAG_typedef
   13298                      .dwattr $C$DW$T$82, DW_AT_name("CLK_Handle")
   13299                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
   13300                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   13301              
   13302              
   13303              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   13304                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
   13305                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
   13306              $C$DW$1756      .dwtag  DW_TAG_member
   13307                      .dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$32)
   13308                      .dwattr $C$DW$1756, DW_AT_name("tmp")
   13309                      .dwattr $C$DW$1756, DW_AT_TI_symbol_name("_tmp")
   13310                      .dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13311                      .dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
   13312              
   13313                      .dwendtag $C$DW$T$33
   13314              
   13315              $C$DW$T$339     .dwtag  DW_TAG_typedef
   13316                      .dwattr $C$DW$T$339, DW_AT_name("CPU_Obj")
   13317                      .dwattr $C$DW$T$339, DW_AT_type(*$C$DW$T$33)
   13318                      .dwattr $C$DW$T$339, DW_AT_language(DW_LANG_C)
   13319              
   13320              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
   13321                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
   13322                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  252

   13323              
   13324              $C$DW$T$84      .dwtag  DW_TAG_typedef
   13325                      .dwattr $C$DW$T$84, DW_AT_name("CPU_Handle")
   13326                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
   13327                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
   13328              
   13329              
   13330              $C$DW$T$41      .dwtag  DW_TAG_structure_type
   13331                      .dwattr $C$DW$T$41, DW_AT_name("_DRV8301_Obj_")
   13332                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
   13333              $C$DW$1757      .dwtag  DW_TAG_member
   13334                      .dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$35)
   13335                      .dwattr $C$DW$1757, DW_AT_name("spiHandle")
   13336                      .dwattr $C$DW$1757, DW_AT_TI_symbol_name("_spiHandle")
   13337                      .dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13338                      .dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
   13339              
   13340              $C$DW$1758      .dwtag  DW_TAG_member
   13341                      .dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$37)
   13342                      .dwattr $C$DW$1758, DW_AT_name("gpioHandle")
   13343                      .dwattr $C$DW$1758, DW_AT_TI_symbol_name("_gpioHandle")
   13344                      .dwattr $C$DW$1758, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13345                      .dwattr $C$DW$1758, DW_AT_accessibility(DW_ACCESS_public)
   13346              
   13347              $C$DW$1759      .dwtag  DW_TAG_member
   13348                      .dwattr $C$DW$1759, DW_AT_type(*$C$DW$T$39)
   13349                      .dwattr $C$DW$1759, DW_AT_name("gpioNumber")
   13350                      .dwattr $C$DW$1759, DW_AT_TI_symbol_name("_gpioNumber")
   13351                      .dwattr $C$DW$1759, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13352                      .dwattr $C$DW$1759, DW_AT_accessibility(DW_ACCESS_public)
   13353              
   13354              $C$DW$1760      .dwtag  DW_TAG_member
   13355                      .dwattr $C$DW$1760, DW_AT_type(*$C$DW$T$40)
   13356                      .dwattr $C$DW$1760, DW_AT_name("RxTimeOut")
   13357                      .dwattr $C$DW$1760, DW_AT_TI_symbol_name("_RxTimeOut")
   13358                      .dwattr $C$DW$1760, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13359                      .dwattr $C$DW$1760, DW_AT_accessibility(DW_ACCESS_public)
   13360              
   13361              $C$DW$1761      .dwtag  DW_TAG_member
   13362                      .dwattr $C$DW$1761, DW_AT_type(*$C$DW$T$40)
   13363                      .dwattr $C$DW$1761, DW_AT_name("enableTimeOut")
   13364                      .dwattr $C$DW$1761, DW_AT_TI_symbol_name("_enableTimeOut")
   13365                      .dwattr $C$DW$1761, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13366                      .dwattr $C$DW$1761, DW_AT_accessibility(DW_ACCESS_public)
   13367              
   13368                      .dwendtag $C$DW$T$41
   13369              
   13370              $C$DW$T$112     .dwtag  DW_TAG_typedef
   13371                      .dwattr $C$DW$T$112, DW_AT_name("DRV8301_Obj")
   13372                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$41)
   13373                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
   13374              
   13375              $C$DW$T$110     .dwtag  DW_TAG_pointer_type
   13376                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$41)
   13377                      .dwattr $C$DW$T$110, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  253

   13378              
   13379              $C$DW$T$111     .dwtag  DW_TAG_typedef
   13380                      .dwattr $C$DW$T$111, DW_AT_name("DRV8301_Handle")
   13381                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
   13382                      .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
   13383              
   13384              
   13385              $C$DW$T$52      .dwtag  DW_TAG_structure_type
   13386                      .dwattr $C$DW$T$52, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   13387                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x05)
   13388              $C$DW$1762      .dwtag  DW_TAG_member
   13389                      .dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$43)
   13390                      .dwattr $C$DW$1762, DW_AT_name("DRV8301_CURRENT")
   13391                      .dwattr $C$DW$1762, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   13392                      .dwattr $C$DW$1762, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13393                      .dwattr $C$DW$1762, DW_AT_accessibility(DW_ACCESS_public)
   13394              
   13395              $C$DW$1763      .dwtag  DW_TAG_member
   13396                      .dwattr $C$DW$1763, DW_AT_type(*$C$DW$T$45)
   13397                      .dwattr $C$DW$1763, DW_AT_name("DRV8301_RESET")
   13398                      .dwattr $C$DW$1763, DW_AT_TI_symbol_name("_DRV8301_RESET")
   13399                      .dwattr $C$DW$1763, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13400                      .dwattr $C$DW$1763, DW_AT_accessibility(DW_ACCESS_public)
   13401              
   13402              $C$DW$1764      .dwtag  DW_TAG_member
   13403                      .dwattr $C$DW$1764, DW_AT_type(*$C$DW$T$47)
   13404                      .dwattr $C$DW$1764, DW_AT_name("PWM_MODE")
   13405                      .dwattr $C$DW$1764, DW_AT_TI_symbol_name("_PWM_MODE")
   13406                      .dwattr $C$DW$1764, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13407                      .dwattr $C$DW$1764, DW_AT_accessibility(DW_ACCESS_public)
   13408              
   13409              $C$DW$1765      .dwtag  DW_TAG_member
   13410                      .dwattr $C$DW$1765, DW_AT_type(*$C$DW$T$49)
   13411                      .dwattr $C$DW$1765, DW_AT_name("OC_MODE")
   13412                      .dwattr $C$DW$1765, DW_AT_TI_symbol_name("_OC_MODE")
   13413                      .dwattr $C$DW$1765, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13414                      .dwattr $C$DW$1765, DW_AT_accessibility(DW_ACCESS_public)
   13415              
   13416              $C$DW$1766      .dwtag  DW_TAG_member
   13417                      .dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$51)
   13418                      .dwattr $C$DW$1766, DW_AT_name("OC_ADJ_SET")
   13419                      .dwattr $C$DW$1766, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   13420                      .dwattr $C$DW$1766, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13421                      .dwattr $C$DW$1766, DW_AT_accessibility(DW_ACCESS_public)
   13422              
   13423                      .dwendtag $C$DW$T$52
   13424              
   13425              $C$DW$T$66      .dwtag  DW_TAG_typedef
   13426                      .dwattr $C$DW$T$66, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   13427                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$52)
   13428                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   13429              
   13430              
   13431              $C$DW$T$61      .dwtag  DW_TAG_structure_type
   13432                      .dwattr $C$DW$T$61, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  254

   13433                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
   13434              $C$DW$1767      .dwtag  DW_TAG_member
   13435                      .dwattr $C$DW$1767, DW_AT_type(*$C$DW$T$54)
   13436                      .dwattr $C$DW$1767, DW_AT_name("OCTW_SET")
   13437                      .dwattr $C$DW$1767, DW_AT_TI_symbol_name("_OCTW_SET")
   13438                      .dwattr $C$DW$1767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13439                      .dwattr $C$DW$1767, DW_AT_accessibility(DW_ACCESS_public)
   13440              
   13441              $C$DW$1768      .dwtag  DW_TAG_member
   13442                      .dwattr $C$DW$1768, DW_AT_type(*$C$DW$T$56)
   13443                      .dwattr $C$DW$1768, DW_AT_name("GAIN")
   13444                      .dwattr $C$DW$1768, DW_AT_TI_symbol_name("_GAIN")
   13445                      .dwattr $C$DW$1768, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13446                      .dwattr $C$DW$1768, DW_AT_accessibility(DW_ACCESS_public)
   13447              
   13448              $C$DW$1769      .dwtag  DW_TAG_member
   13449                      .dwattr $C$DW$1769, DW_AT_type(*$C$DW$T$58)
   13450                      .dwattr $C$DW$1769, DW_AT_name("DC_CAL_CH1p2")
   13451                      .dwattr $C$DW$1769, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   13452                      .dwattr $C$DW$1769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13453                      .dwattr $C$DW$1769, DW_AT_accessibility(DW_ACCESS_public)
   13454              
   13455              $C$DW$1770      .dwtag  DW_TAG_member
   13456                      .dwattr $C$DW$1770, DW_AT_type(*$C$DW$T$60)
   13457                      .dwattr $C$DW$1770, DW_AT_name("OC_TOFF")
   13458                      .dwattr $C$DW$1770, DW_AT_TI_symbol_name("_OC_TOFF")
   13459                      .dwattr $C$DW$1770, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13460                      .dwattr $C$DW$1770, DW_AT_accessibility(DW_ACCESS_public)
   13461              
   13462                      .dwendtag $C$DW$T$61
   13463              
   13464              $C$DW$T$67      .dwtag  DW_TAG_typedef
   13465                      .dwattr $C$DW$T$67, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   13466                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$61)
   13467                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   13468              
   13469              
   13470              $C$DW$T$62      .dwtag  DW_TAG_structure_type
   13471                      .dwattr $C$DW$T$62, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   13472                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x0b)
   13473              $C$DW$1771      .dwtag  DW_TAG_member
   13474                      .dwattr $C$DW$1771, DW_AT_type(*$C$DW$T$40)
   13475                      .dwattr $C$DW$1771, DW_AT_name("FAULT")
   13476                      .dwattr $C$DW$1771, DW_AT_TI_symbol_name("_FAULT")
   13477                      .dwattr $C$DW$1771, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13478                      .dwattr $C$DW$1771, DW_AT_accessibility(DW_ACCESS_public)
   13479              
   13480              $C$DW$1772      .dwtag  DW_TAG_member
   13481                      .dwattr $C$DW$1772, DW_AT_type(*$C$DW$T$40)
   13482                      .dwattr $C$DW$1772, DW_AT_name("GVDD_UV")
   13483                      .dwattr $C$DW$1772, DW_AT_TI_symbol_name("_GVDD_UV")
   13484                      .dwattr $C$DW$1772, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13485                      .dwattr $C$DW$1772, DW_AT_accessibility(DW_ACCESS_public)
   13486              
   13487              $C$DW$1773      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  255

   13488                      .dwattr $C$DW$1773, DW_AT_type(*$C$DW$T$40)
   13489                      .dwattr $C$DW$1773, DW_AT_name("PVDD_UV")
   13490                      .dwattr $C$DW$1773, DW_AT_TI_symbol_name("_PVDD_UV")
   13491                      .dwattr $C$DW$1773, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13492                      .dwattr $C$DW$1773, DW_AT_accessibility(DW_ACCESS_public)
   13493              
   13494              $C$DW$1774      .dwtag  DW_TAG_member
   13495                      .dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$40)
   13496                      .dwattr $C$DW$1774, DW_AT_name("OTSD")
   13497                      .dwattr $C$DW$1774, DW_AT_TI_symbol_name("_OTSD")
   13498                      .dwattr $C$DW$1774, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13499                      .dwattr $C$DW$1774, DW_AT_accessibility(DW_ACCESS_public)
   13500              
   13501              $C$DW$1775      .dwtag  DW_TAG_member
   13502                      .dwattr $C$DW$1775, DW_AT_type(*$C$DW$T$40)
   13503                      .dwattr $C$DW$1775, DW_AT_name("OTW")
   13504                      .dwattr $C$DW$1775, DW_AT_TI_symbol_name("_OTW")
   13505                      .dwattr $C$DW$1775, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13506                      .dwattr $C$DW$1775, DW_AT_accessibility(DW_ACCESS_public)
   13507              
   13508              $C$DW$1776      .dwtag  DW_TAG_member
   13509                      .dwattr $C$DW$1776, DW_AT_type(*$C$DW$T$40)
   13510                      .dwattr $C$DW$1776, DW_AT_name("FETHA_OC")
   13511                      .dwattr $C$DW$1776, DW_AT_TI_symbol_name("_FETHA_OC")
   13512                      .dwattr $C$DW$1776, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13513                      .dwattr $C$DW$1776, DW_AT_accessibility(DW_ACCESS_public)
   13514              
   13515              $C$DW$1777      .dwtag  DW_TAG_member
   13516                      .dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$40)
   13517                      .dwattr $C$DW$1777, DW_AT_name("FETLA_OC")
   13518                      .dwattr $C$DW$1777, DW_AT_TI_symbol_name("_FETLA_OC")
   13519                      .dwattr $C$DW$1777, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13520                      .dwattr $C$DW$1777, DW_AT_accessibility(DW_ACCESS_public)
   13521              
   13522              $C$DW$1778      .dwtag  DW_TAG_member
   13523                      .dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$40)
   13524                      .dwattr $C$DW$1778, DW_AT_name("FETHB_OC")
   13525                      .dwattr $C$DW$1778, DW_AT_TI_symbol_name("_FETHB_OC")
   13526                      .dwattr $C$DW$1778, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13527                      .dwattr $C$DW$1778, DW_AT_accessibility(DW_ACCESS_public)
   13528              
   13529              $C$DW$1779      .dwtag  DW_TAG_member
   13530                      .dwattr $C$DW$1779, DW_AT_type(*$C$DW$T$40)
   13531                      .dwattr $C$DW$1779, DW_AT_name("FETLB_OC")
   13532                      .dwattr $C$DW$1779, DW_AT_TI_symbol_name("_FETLB_OC")
   13533                      .dwattr $C$DW$1779, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13534                      .dwattr $C$DW$1779, DW_AT_accessibility(DW_ACCESS_public)
   13535              
   13536              $C$DW$1780      .dwtag  DW_TAG_member
   13537                      .dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$40)
   13538                      .dwattr $C$DW$1780, DW_AT_name("FETHC_OC")
   13539                      .dwattr $C$DW$1780, DW_AT_TI_symbol_name("_FETHC_OC")
   13540                      .dwattr $C$DW$1780, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13541                      .dwattr $C$DW$1780, DW_AT_accessibility(DW_ACCESS_public)
   13542              
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  256

   13543              $C$DW$1781      .dwtag  DW_TAG_member
   13544                      .dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$40)
   13545                      .dwattr $C$DW$1781, DW_AT_name("FETLC_OC")
   13546                      .dwattr $C$DW$1781, DW_AT_TI_symbol_name("_FETLC_OC")
   13547                      .dwattr $C$DW$1781, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13548                      .dwattr $C$DW$1781, DW_AT_accessibility(DW_ACCESS_public)
   13549              
   13550                      .dwendtag $C$DW$T$62
   13551              
   13552              $C$DW$T$64      .dwtag  DW_TAG_typedef
   13553                      .dwattr $C$DW$T$64, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   13554                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$62)
   13555                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   13556              
   13557              
   13558              $C$DW$T$63      .dwtag  DW_TAG_structure_type
   13559                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   13560                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x02)
   13561              $C$DW$1782      .dwtag  DW_TAG_member
   13562                      .dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$40)
   13563                      .dwattr $C$DW$1782, DW_AT_name("GVDD_OV")
   13564                      .dwattr $C$DW$1782, DW_AT_TI_symbol_name("_GVDD_OV")
   13565                      .dwattr $C$DW$1782, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13566                      .dwattr $C$DW$1782, DW_AT_accessibility(DW_ACCESS_public)
   13567              
   13568              $C$DW$1783      .dwtag  DW_TAG_member
   13569                      .dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$21)
   13570                      .dwattr $C$DW$1783, DW_AT_name("DeviceID")
   13571                      .dwattr $C$DW$1783, DW_AT_TI_symbol_name("_DeviceID")
   13572                      .dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13573                      .dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
   13574              
   13575                      .dwendtag $C$DW$T$63
   13576              
   13577              $C$DW$T$65      .dwtag  DW_TAG_typedef
   13578                      .dwattr $C$DW$T$65, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   13579                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
   13580                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
   13581              
   13582              
   13583              $C$DW$T$68      .dwtag  DW_TAG_structure_type
   13584                      .dwattr $C$DW$T$68, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   13585                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x18)
   13586              $C$DW$1784      .dwtag  DW_TAG_member
   13587                      .dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$64)
   13588                      .dwattr $C$DW$1784, DW_AT_name("Stat_Reg_1")
   13589                      .dwattr $C$DW$1784, DW_AT_TI_symbol_name("_Stat_Reg_1")
   13590                      .dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13591                      .dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
   13592              
   13593              $C$DW$1785      .dwtag  DW_TAG_member
   13594                      .dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$65)
   13595                      .dwattr $C$DW$1785, DW_AT_name("Stat_Reg_2")
   13596                      .dwattr $C$DW$1785, DW_AT_TI_symbol_name("_Stat_Reg_2")
   13597                      .dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  257

   13598                      .dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
   13599              
   13600              $C$DW$1786      .dwtag  DW_TAG_member
   13601                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$66)
   13602                      .dwattr $C$DW$1786, DW_AT_name("Ctrl_Reg_1")
   13603                      .dwattr $C$DW$1786, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   13604                      .dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13605                      .dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
   13606              
   13607              $C$DW$1787      .dwtag  DW_TAG_member
   13608                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$67)
   13609                      .dwattr $C$DW$1787, DW_AT_name("Ctrl_Reg_2")
   13610                      .dwattr $C$DW$1787, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   13611                      .dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13612                      .dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
   13613              
   13614              $C$DW$1788      .dwtag  DW_TAG_member
   13615                      .dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$40)
   13616                      .dwattr $C$DW$1788, DW_AT_name("SndCmd")
   13617                      .dwattr $C$DW$1788, DW_AT_TI_symbol_name("_SndCmd")
   13618                      .dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   13619                      .dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
   13620              
   13621              $C$DW$1789      .dwtag  DW_TAG_member
   13622                      .dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$40)
   13623                      .dwattr $C$DW$1789, DW_AT_name("RcvCmd")
   13624                      .dwattr $C$DW$1789, DW_AT_TI_symbol_name("_RcvCmd")
   13625                      .dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   13626                      .dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
   13627              
   13628                      .dwendtag $C$DW$T$68
   13629              
   13630              $C$DW$T$346     .dwtag  DW_TAG_typedef
   13631                      .dwattr $C$DW$T$346, DW_AT_name("DRV_SPI_8301_Vars_t")
   13632                      .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$68)
   13633                      .dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
   13634              
   13635              $C$DW$T$347     .dwtag  DW_TAG_pointer_type
   13636                      .dwattr $C$DW$T$347, DW_AT_type(*$C$DW$T$346)
   13637                      .dwattr $C$DW$T$347, DW_AT_address_class(0x20)
   13638              
   13639              
   13640              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   13641                      .dwattr $C$DW$T$70, DW_AT_name("_FILTER_FO_")
   13642                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
   13643              $C$DW$1790      .dwtag  DW_TAG_member
   13644                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$69)
   13645                      .dwattr $C$DW$1790, DW_AT_name("a1")
   13646                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_a1")
   13647                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13648                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
   13649              
   13650              $C$DW$1791      .dwtag  DW_TAG_member
   13651                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$69)
   13652                      .dwattr $C$DW$1791, DW_AT_name("b0")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  258

   13653                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_b0")
   13654                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13655                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
   13656              
   13657              $C$DW$1792      .dwtag  DW_TAG_member
   13658                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$69)
   13659                      .dwattr $C$DW$1792, DW_AT_name("b1")
   13660                      .dwattr $C$DW$1792, DW_AT_TI_symbol_name("_b1")
   13661                      .dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13662                      .dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
   13663              
   13664              $C$DW$1793      .dwtag  DW_TAG_member
   13665                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$69)
   13666                      .dwattr $C$DW$1793, DW_AT_name("x1")
   13667                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_x1")
   13668                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13669                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
   13670              
   13671              $C$DW$1794      .dwtag  DW_TAG_member
   13672                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$69)
   13673                      .dwattr $C$DW$1794, DW_AT_name("y1")
   13674                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_y1")
   13675                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13676                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
   13677              
   13678                      .dwendtag $C$DW$T$70
   13679              
   13680              $C$DW$T$116     .dwtag  DW_TAG_typedef
   13681                      .dwattr $C$DW$T$116, DW_AT_name("FILTER_FO_Obj")
   13682                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$70)
   13683                      .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
   13684              
   13685              
   13686              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   13687                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   13688                      .dwattr $C$DW$T$19, DW_AT_declaration
   13689                      .dwendtag $C$DW$T$19
   13690              
   13691              $C$DW$T$117     .dwtag  DW_TAG_pointer_type
   13692                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$19)
   13693                      .dwattr $C$DW$T$117, DW_AT_address_class(0x20)
   13694              
   13695              $C$DW$T$118     .dwtag  DW_TAG_typedef
   13696                      .dwattr $C$DW$T$118, DW_AT_name("FILTER_FO_Handle")
   13697                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
   13698                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
   13699              
   13700              
   13701              $C$DW$T$71      .dwtag  DW_TAG_structure_type
   13702                      .dwattr $C$DW$T$71, DW_AT_name("_FLASH_Obj_")
   13703                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x08)
   13704              $C$DW$1795      .dwtag  DW_TAG_member
   13705                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$22)
   13706                      .dwattr $C$DW$1795, DW_AT_name("FOPT")
   13707                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_FOPT")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  259

   13708                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13709                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
   13710              
   13711              $C$DW$1796      .dwtag  DW_TAG_member
   13712                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$22)
   13713                      .dwattr $C$DW$1796, DW_AT_name("rsvd_1")
   13714                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_rsvd_1")
   13715                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13716                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
   13717              
   13718              $C$DW$1797      .dwtag  DW_TAG_member
   13719                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$22)
   13720                      .dwattr $C$DW$1797, DW_AT_name("FPWR")
   13721                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_FPWR")
   13722                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13723                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
   13724              
   13725              $C$DW$1798      .dwtag  DW_TAG_member
   13726                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$22)
   13727                      .dwattr $C$DW$1798, DW_AT_name("FSTATUS")
   13728                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_FSTATUS")
   13729                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13730                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
   13731              
   13732              $C$DW$1799      .dwtag  DW_TAG_member
   13733                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$22)
   13734                      .dwattr $C$DW$1799, DW_AT_name("FSTDBYWAIT")
   13735                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   13736                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13737                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
   13738              
   13739              $C$DW$1800      .dwtag  DW_TAG_member
   13740                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$22)
   13741                      .dwattr $C$DW$1800, DW_AT_name("FACTIVEWAIT")
   13742                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   13743                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13744                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
   13745              
   13746              $C$DW$1801      .dwtag  DW_TAG_member
   13747                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$22)
   13748                      .dwattr $C$DW$1801, DW_AT_name("FBANKWAIT")
   13749                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_FBANKWAIT")
   13750                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13751                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
   13752              
   13753              $C$DW$1802      .dwtag  DW_TAG_member
   13754                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$22)
   13755                      .dwattr $C$DW$1802, DW_AT_name("FOTPWAIT")
   13756                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_FOTPWAIT")
   13757                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13758                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
   13759              
   13760                      .dwendtag $C$DW$T$71
   13761              
   13762              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  260

   13763                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$71)
   13764                      .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
   13765              
   13766              $C$DW$T$86      .dwtag  DW_TAG_typedef
   13767                      .dwattr $C$DW$T$86, DW_AT_name("FLASH_Handle")
   13768                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
   13769                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
   13770              
   13771              
   13772              $C$DW$T$76      .dwtag  DW_TAG_structure_type
   13773                      .dwattr $C$DW$T$76, DW_AT_name("_GPIO_Obj_")
   13774                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x6a)
   13775              $C$DW$1803      .dwtag  DW_TAG_member
   13776                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$73)
   13777                      .dwattr $C$DW$1803, DW_AT_name("GPACTRL")
   13778                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_GPACTRL")
   13779                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13780                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
   13781              
   13782              $C$DW$1804      .dwtag  DW_TAG_member
   13783                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$73)
   13784                      .dwattr $C$DW$1804, DW_AT_name("GPAQSEL1")
   13785                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_GPAQSEL1")
   13786                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13787                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
   13788              
   13789              $C$DW$1805      .dwtag  DW_TAG_member
   13790                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$73)
   13791                      .dwattr $C$DW$1805, DW_AT_name("GPAQSEL2")
   13792                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_GPAQSEL2")
   13793                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13794                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
   13795              
   13796              $C$DW$1806      .dwtag  DW_TAG_member
   13797                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$73)
   13798                      .dwattr $C$DW$1806, DW_AT_name("GPAMUX1")
   13799                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_GPAMUX1")
   13800                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13801                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
   13802              
   13803              $C$DW$1807      .dwtag  DW_TAG_member
   13804                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$73)
   13805                      .dwattr $C$DW$1807, DW_AT_name("GPAMUX2")
   13806                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_GPAMUX2")
   13807                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13808                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
   13809              
   13810              $C$DW$1808      .dwtag  DW_TAG_member
   13811                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$73)
   13812                      .dwattr $C$DW$1808, DW_AT_name("GPADIR")
   13813                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_GPADIR")
   13814                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13815                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
   13816              
   13817              $C$DW$1809      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  261

   13818                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$73)
   13819                      .dwattr $C$DW$1809, DW_AT_name("GPAPUD")
   13820                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_GPAPUD")
   13821                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13822                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
   13823              
   13824              $C$DW$1810      .dwtag  DW_TAG_member
   13825                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$25)
   13826                      .dwattr $C$DW$1810, DW_AT_name("rsvd_1")
   13827                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_rsvd_1")
   13828                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13829                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
   13830              
   13831              $C$DW$1811      .dwtag  DW_TAG_member
   13832                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$73)
   13833                      .dwattr $C$DW$1811, DW_AT_name("GPBCTRL")
   13834                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_GPBCTRL")
   13835                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13836                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
   13837              
   13838              $C$DW$1812      .dwtag  DW_TAG_member
   13839                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$73)
   13840                      .dwattr $C$DW$1812, DW_AT_name("GPBQSEL1")
   13841                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_GPBQSEL1")
   13842                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13843                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
   13844              
   13845              $C$DW$1813      .dwtag  DW_TAG_member
   13846                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$25)
   13847                      .dwattr $C$DW$1813, DW_AT_name("rsvd_2")
   13848                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_rsvd_2")
   13849                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   13850                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   13851              
   13852              $C$DW$1814      .dwtag  DW_TAG_member
   13853                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$73)
   13854                      .dwattr $C$DW$1814, DW_AT_name("GPBMUX1")
   13855                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_GPBMUX1")
   13856                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   13857                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
   13858              
   13859              $C$DW$1815      .dwtag  DW_TAG_member
   13860                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$25)
   13861                      .dwattr $C$DW$1815, DW_AT_name("rsvd_3")
   13862                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_rsvd_3")
   13863                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   13864                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   13865              
   13866              $C$DW$1816      .dwtag  DW_TAG_member
   13867                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$73)
   13868                      .dwattr $C$DW$1816, DW_AT_name("GPBDIR")
   13869                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_GPBDIR")
   13870                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   13871                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   13872              
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  262

   13873              $C$DW$1817      .dwtag  DW_TAG_member
   13874                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$73)
   13875                      .dwattr $C$DW$1817, DW_AT_name("GPBPUD")
   13876                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_GPBPUD")
   13877                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   13878                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   13879              
   13880              $C$DW$1818      .dwtag  DW_TAG_member
   13881                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$74)
   13882                      .dwattr $C$DW$1818, DW_AT_name("rsvd_4")
   13883                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_rsvd_4")
   13884                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   13885                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   13886              
   13887              $C$DW$1819      .dwtag  DW_TAG_member
   13888                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$73)
   13889                      .dwattr $C$DW$1819, DW_AT_name("AIOMUX1")
   13890                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_AIOMUX1")
   13891                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   13892                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   13893              
   13894              $C$DW$1820      .dwtag  DW_TAG_member
   13895                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$25)
   13896                      .dwattr $C$DW$1820, DW_AT_name("rsvd_5")
   13897                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_rsvd_5")
   13898                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   13899                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   13900              
   13901              $C$DW$1821      .dwtag  DW_TAG_member
   13902                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$73)
   13903                      .dwattr $C$DW$1821, DW_AT_name("AIODIR")
   13904                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_AIODIR")
   13905                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   13906                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   13907              
   13908              $C$DW$1822      .dwtag  DW_TAG_member
   13909                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$75)
   13910                      .dwattr $C$DW$1822, DW_AT_name("rsvd_6")
   13911                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_rsvd_6")
   13912                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   13913                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   13914              
   13915              $C$DW$1823      .dwtag  DW_TAG_member
   13916                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$73)
   13917                      .dwattr $C$DW$1823, DW_AT_name("GPADAT")
   13918                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_GPADAT")
   13919                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   13920                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   13921              
   13922              $C$DW$1824      .dwtag  DW_TAG_member
   13923                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$73)
   13924                      .dwattr $C$DW$1824, DW_AT_name("GPASET")
   13925                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_GPASET")
   13926                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   13927                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  263

   13928              
   13929              $C$DW$1825      .dwtag  DW_TAG_member
   13930                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$73)
   13931                      .dwattr $C$DW$1825, DW_AT_name("GPACLEAR")
   13932                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_GPACLEAR")
   13933                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   13934                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   13935              
   13936              $C$DW$1826      .dwtag  DW_TAG_member
   13937                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$73)
   13938                      .dwattr $C$DW$1826, DW_AT_name("GPATOGGLE")
   13939                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_GPATOGGLE")
   13940                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   13941                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   13942              
   13943              $C$DW$1827      .dwtag  DW_TAG_member
   13944                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$73)
   13945                      .dwattr $C$DW$1827, DW_AT_name("GPBDAT")
   13946                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_GPBDAT")
   13947                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   13948                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   13949              
   13950              $C$DW$1828      .dwtag  DW_TAG_member
   13951                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$73)
   13952                      .dwattr $C$DW$1828, DW_AT_name("GPBSET")
   13953                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_GPBSET")
   13954                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   13955                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   13956              
   13957              $C$DW$1829      .dwtag  DW_TAG_member
   13958                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$73)
   13959                      .dwattr $C$DW$1829, DW_AT_name("GPBCLEAR")
   13960                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_GPBCLEAR")
   13961                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   13962                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   13963              
   13964              $C$DW$1830      .dwtag  DW_TAG_member
   13965                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$73)
   13966                      .dwattr $C$DW$1830, DW_AT_name("GPBTOGGLE")
   13967                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_GPBTOGGLE")
   13968                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   13969                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   13970              
   13971              $C$DW$1831      .dwtag  DW_TAG_member
   13972                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$30)
   13973                      .dwattr $C$DW$1831, DW_AT_name("rsvd_7")
   13974                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_rsvd_7")
   13975                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   13976                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   13977              
   13978              $C$DW$1832      .dwtag  DW_TAG_member
   13979                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$73)
   13980                      .dwattr $C$DW$1832, DW_AT_name("AIODAT")
   13981                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_AIODAT")
   13982                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  264

   13983                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   13984              
   13985              $C$DW$1833      .dwtag  DW_TAG_member
   13986                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$73)
   13987                      .dwattr $C$DW$1833, DW_AT_name("AIOSET")
   13988                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_AIOSET")
   13989                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   13990                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   13991              
   13992              $C$DW$1834      .dwtag  DW_TAG_member
   13993                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$73)
   13994                      .dwattr $C$DW$1834, DW_AT_name("AIOCLEAR")
   13995                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_AIOCLEAR")
   13996                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   13997                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   13998              
   13999              $C$DW$1835      .dwtag  DW_TAG_member
   14000                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$73)
   14001                      .dwattr $C$DW$1835, DW_AT_name("AIOTOGGLE")
   14002                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_AIOTOGGLE")
   14003                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   14004                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   14005              
   14006              $C$DW$1836      .dwtag  DW_TAG_member
   14007                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$27)
   14008                      .dwattr $C$DW$1836, DW_AT_name("GPIOXINTnSEL")
   14009                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   14010                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   14011                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   14012              
   14013              $C$DW$1837      .dwtag  DW_TAG_member
   14014                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$26)
   14015                      .dwattr $C$DW$1837, DW_AT_name("rsvd_8")
   14016                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_rsvd_8")
   14017                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   14018                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   14019              
   14020              $C$DW$1838      .dwtag  DW_TAG_member
   14021                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$73)
   14022                      .dwattr $C$DW$1838, DW_AT_name("GPIOLPMSEL")
   14023                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   14024                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   14025                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   14026              
   14027                      .dwendtag $C$DW$T$76
   14028              
   14029              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
   14030                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$76)
   14031                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
   14032              
   14033              $C$DW$T$37      .dwtag  DW_TAG_typedef
   14034                      .dwattr $C$DW$T$37, DW_AT_name("GPIO_Handle")
   14035                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
   14036                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
   14037              
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  265

   14038              
   14039              $C$DW$T$78      .dwtag  DW_TAG_structure_type
   14040                      .dwattr $C$DW$T$78, DW_AT_name("_HAL_AdcData_t_")
   14041                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0e)
   14042              $C$DW$1839      .dwtag  DW_TAG_member
   14043                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$77)
   14044                      .dwattr $C$DW$1839, DW_AT_name("I")
   14045                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_I")
   14046                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14047                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   14048              
   14049              $C$DW$1840      .dwtag  DW_TAG_member
   14050                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$77)
   14051                      .dwattr $C$DW$1840, DW_AT_name("V")
   14052                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_V")
   14053                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14054                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   14055              
   14056              $C$DW$1841      .dwtag  DW_TAG_member
   14057                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$69)
   14058                      .dwattr $C$DW$1841, DW_AT_name("dcBus")
   14059                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_dcBus")
   14060                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14061                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   14062              
   14063                      .dwendtag $C$DW$T$78
   14064              
   14065              $C$DW$T$108     .dwtag  DW_TAG_typedef
   14066                      .dwattr $C$DW$T$108, DW_AT_name("HAL_AdcData_t")
   14067                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$78)
   14068                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
   14069              
   14070              
   14071              $C$DW$T$113     .dwtag  DW_TAG_structure_type
   14072                      .dwattr $C$DW$T$113, DW_AT_name("_HAL_Obj_")
   14073                      .dwattr $C$DW$T$113, DW_AT_byte_size(0xc2)
   14074              $C$DW$1842      .dwtag  DW_TAG_member
   14075                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$80)
   14076                      .dwattr $C$DW$1842, DW_AT_name("adcHandle")
   14077                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_adcHandle")
   14078                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14079                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   14080              
   14081              $C$DW$1843      .dwtag  DW_TAG_member
   14082                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$82)
   14083                      .dwattr $C$DW$1843, DW_AT_name("clkHandle")
   14084                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_clkHandle")
   14085                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14086                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   14087              
   14088              $C$DW$1844      .dwtag  DW_TAG_member
   14089                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$84)
   14090                      .dwattr $C$DW$1844, DW_AT_name("cpuHandle")
   14091                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_cpuHandle")
   14092                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  266

   14093                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   14094              
   14095              $C$DW$1845      .dwtag  DW_TAG_member
   14096                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$86)
   14097                      .dwattr $C$DW$1845, DW_AT_name("flashHandle")
   14098                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_flashHandle")
   14099                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14100                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   14101              
   14102              $C$DW$1846      .dwtag  DW_TAG_member
   14103                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$37)
   14104                      .dwattr $C$DW$1846, DW_AT_name("gpioHandle")
   14105                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_gpioHandle")
   14106                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14107                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   14108              
   14109              $C$DW$1847      .dwtag  DW_TAG_member
   14110                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$89)
   14111                      .dwattr $C$DW$1847, DW_AT_name("offsetHandle_I")
   14112                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_offsetHandle_I")
   14113                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14114                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   14115              
   14116              $C$DW$1848      .dwtag  DW_TAG_member
   14117                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$91)
   14118                      .dwattr $C$DW$1848, DW_AT_name("offset_I")
   14119                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_offset_I")
   14120                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14121                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   14122              
   14123              $C$DW$1849      .dwtag  DW_TAG_member
   14124                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$89)
   14125                      .dwattr $C$DW$1849, DW_AT_name("offsetHandle_V")
   14126                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_offsetHandle_V")
   14127                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   14128                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   14129              
   14130              $C$DW$1850      .dwtag  DW_TAG_member
   14131                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$91)
   14132                      .dwattr $C$DW$1850, DW_AT_name("offset_V")
   14133                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_offset_V")
   14134                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   14135                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   14136              
   14137              $C$DW$1851      .dwtag  DW_TAG_member
   14138                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$93)
   14139                      .dwattr $C$DW$1851, DW_AT_name("oscHandle")
   14140                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_oscHandle")
   14141                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   14142                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   14143              
   14144              $C$DW$1852      .dwtag  DW_TAG_member
   14145                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$95)
   14146                      .dwattr $C$DW$1852, DW_AT_name("pieHandle")
   14147                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_pieHandle")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  267

   14148                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   14149                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   14150              
   14151              $C$DW$1853      .dwtag  DW_TAG_member
   14152                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$97)
   14153                      .dwattr $C$DW$1853, DW_AT_name("pllHandle")
   14154                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_pllHandle")
   14155                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   14156                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   14157              
   14158              $C$DW$1854      .dwtag  DW_TAG_member
   14159                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$100)
   14160                      .dwattr $C$DW$1854, DW_AT_name("pwmHandle")
   14161                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_pwmHandle")
   14162                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   14163                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   14164              
   14165              $C$DW$1855      .dwtag  DW_TAG_member
   14166                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$100)
   14167                      .dwattr $C$DW$1855, DW_AT_name("pwmDacHandle")
   14168                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_pwmDacHandle")
   14169                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   14170                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   14171              
   14172              $C$DW$1856      .dwtag  DW_TAG_member
   14173                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$102)
   14174                      .dwattr $C$DW$1856, DW_AT_name("pwrHandle")
   14175                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_pwrHandle")
   14176                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   14177                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   14178              
   14179              $C$DW$1857      .dwtag  DW_TAG_member
   14180                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$105)
   14181                      .dwattr $C$DW$1857, DW_AT_name("timerHandle")
   14182                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_timerHandle")
   14183                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   14184                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   14185              
   14186              $C$DW$1858      .dwtag  DW_TAG_member
   14187                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$107)
   14188                      .dwattr $C$DW$1858, DW_AT_name("wdogHandle")
   14189                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_wdogHandle")
   14190                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   14191                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   14192              
   14193              $C$DW$1859      .dwtag  DW_TAG_member
   14194                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$108)
   14195                      .dwattr $C$DW$1859, DW_AT_name("adcBias")
   14196                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_adcBias")
   14197                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   14198                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   14199              
   14200              $C$DW$1860      .dwtag  DW_TAG_member
   14201                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$69)
   14202                      .dwattr $C$DW$1860, DW_AT_name("current_sf")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1310010                         PAGE  268

   14203                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_current_sf")
   14204                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
   14205                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   14206              
   14207              $C$DW$1861      .dwtag  DW_TAG_member
   14208                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$69)
   14209                      .dwattr $C$DW$1861, DW_AT_name("voltage_sf")
   14210                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_voltage_sf")
   14211                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
   14212                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   14213              
   14214              $C$DW$1862      .dwtag  DW_TAG_member
   14215                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$32)
   14216                      .dwattr $C$DW$1862, DW_AT_name("numCurrentSensors")
   14217                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_numCurrentSensors")
   14218                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
   14219                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   14220              
   14221              $C$DW$1863      .dwtag  DW_TAG_member
   14222                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$32)
   14223                      .dwattr $C$DW$1863, DW_AT_name("numVoltageSensors")
   14224                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_numVoltageSensors")
   14225                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0xa5]
   14226                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   14227              
   14228              $C$DW$1864      .dwtag  DW_TAG_member
   14229                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$35)
   14230                      .dwattr $C$DW$1864, DW_AT_name("spiAHandle")
   14231                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_spiAHandle")
   14232                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
   14233                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   14234              
   14235              $C$DW$1865      .dwtag  DW_TAG_member
   14236                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$109)
   14237                      .dwattr $C$DW$1865, DW_AT_name("spiA")
   14238                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_spiA")
   14239                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
   14240                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   14241              
   14242              $C$DW$1866      .dwtag  DW_TAG_member
   14243                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$111)
   14244                      .dwattr $C$DW$1866, DW_AT_name("drv8301Handle")
   14245                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_drv8301Handle")
   14246                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
   14247                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   14248              
   14249              $C$DW$1867      .dwtag  DW_TAG_member
