TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Tue Jul 26 20:21:16 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\aignacio\workspace_v6_1_3\proj_ITS\Flash")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  104

    5336                      .dwattr $C$DW$580, DW_AT_const_value(0x08)
    5337              
    5338              $C$DW$581       .dwtag  DW_TAG_enumerator
    5339                      .dwattr $C$DW$581, DW_AT_name("PIE_GroupNumber_10")
    5340                      .dwattr $C$DW$581, DW_AT_const_value(0x09)
    5341              
    5342              $C$DW$582       .dwtag  DW_TAG_enumerator
    5343                      .dwattr $C$DW$582, DW_AT_name("PIE_GroupNumber_11")
    5344                      .dwattr $C$DW$582, DW_AT_const_value(0x0a)
    5345              
    5346              $C$DW$583       .dwtag  DW_TAG_enumerator
    5347                      .dwattr $C$DW$583, DW_AT_name("PIE_GroupNumber_12")
    5348                      .dwattr $C$DW$583, DW_AT_const_value(0x0b)
    5349              
    5350                      .dwendtag $C$DW$T$225
    5351              
    5352              $C$DW$T$226     .dwtag  DW_TAG_typedef
    5353                      .dwattr $C$DW$T$226, DW_AT_name("PIE_GroupNumber_e")
    5354                      .dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$225)
    5355                      .dwattr $C$DW$T$226, DW_AT_language(DW_LANG_C)
    5356              
    5357              
    5358              $C$DW$T$228     .dwtag  DW_TAG_enumeration_type
    5359                      .dwattr $C$DW$T$228, DW_AT_byte_size(0x01)
    5360              $C$DW$584       .dwtag  DW_TAG_enumerator
    5361                      .dwattr $C$DW$584, DW_AT_name("CTRL_Type_PID_spd")
    5362                      .dwattr $C$DW$584, DW_AT_const_value(0x00)
    5363              
    5364              $C$DW$585       .dwtag  DW_TAG_enumerator
    5365                      .dwattr $C$DW$585, DW_AT_name("CTRL_Type_PID_Id")
    5366                      .dwattr $C$DW$585, DW_AT_const_value(0x01)
    5367              
    5368              $C$DW$586       .dwtag  DW_TAG_enumerator
    5369                      .dwattr $C$DW$586, DW_AT_name("CTRL_Type_PID_Iq")
    5370                      .dwattr $C$DW$586, DW_AT_const_value(0x02)
    5371              
    5372                      .dwendtag $C$DW$T$228
    5373              
    5374              $C$DW$T$229     .dwtag  DW_TAG_typedef
    5375                      .dwattr $C$DW$T$229, DW_AT_name("CTRL_Type_e")
    5376                      .dwattr $C$DW$T$229, DW_AT_type(*$C$DW$T$228)
    5377                      .dwattr $C$DW$T$229, DW_AT_language(DW_LANG_C)
    5378              
    5379              
    5380              $C$DW$T$231     .dwtag  DW_TAG_enumeration_type
    5381                      .dwattr $C$DW$T$231, DW_AT_byte_size(0x01)
    5382              $C$DW$587       .dwtag  DW_TAG_enumerator
    5383                      .dwattr $C$DW$587, DW_AT_name("HAL_SensorType_Current")
    5384                      .dwattr $C$DW$587, DW_AT_const_value(0x00)
    5385              
    5386              $C$DW$588       .dwtag  DW_TAG_enumerator
    5387                      .dwattr $C$DW$588, DW_AT_name("HAL_SensorType_Voltage")
    5388                      .dwattr $C$DW$588, DW_AT_const_value(0x01)
    5389              
    5390                      .dwendtag $C$DW$T$231
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  105

    5391              
    5392              $C$DW$T$232     .dwtag  DW_TAG_typedef
    5393                      .dwattr $C$DW$T$232, DW_AT_name("HAL_SensorType_e")
    5394                      .dwattr $C$DW$T$232, DW_AT_type(*$C$DW$T$231)
    5395                      .dwattr $C$DW$T$232, DW_AT_language(DW_LANG_C)
    5396              
    5397              
    5398              $C$DW$T$234     .dwtag  DW_TAG_enumeration_type
    5399                      .dwattr $C$DW$T$234, DW_AT_byte_size(0x01)
    5400              $C$DW$589       .dwtag  DW_TAG_enumerator
    5401                      .dwattr $C$DW$589, DW_AT_name("PWM_Number_1")
    5402                      .dwattr $C$DW$589, DW_AT_const_value(0x00)
    5403              
    5404              $C$DW$590       .dwtag  DW_TAG_enumerator
    5405                      .dwattr $C$DW$590, DW_AT_name("PWM_Number_2")
    5406                      .dwattr $C$DW$590, DW_AT_const_value(0x01)
    5407              
    5408              $C$DW$591       .dwtag  DW_TAG_enumerator
    5409                      .dwattr $C$DW$591, DW_AT_name("PWM_Number_3")
    5410                      .dwattr $C$DW$591, DW_AT_const_value(0x02)
    5411              
    5412              $C$DW$592       .dwtag  DW_TAG_enumerator
    5413                      .dwattr $C$DW$592, DW_AT_name("PWM_Number_4")
    5414                      .dwattr $C$DW$592, DW_AT_const_value(0x03)
    5415              
    5416                      .dwendtag $C$DW$T$234
    5417              
    5418              $C$DW$T$235     .dwtag  DW_TAG_typedef
    5419                      .dwattr $C$DW$T$235, DW_AT_name("PWM_Number_e")
    5420                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$234)
    5421                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    5422              
    5423              
    5424              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5425                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    5426                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    5427              $C$DW$593       .dwtag  DW_TAG_member
    5428                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$24)
    5429                      .dwattr $C$DW$593, DW_AT_name("ADCRESULT")
    5430                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_ADCRESULT")
    5431                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5432                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    5433              
    5434              $C$DW$594       .dwtag  DW_TAG_member
    5435                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$25)
    5436                      .dwattr $C$DW$594, DW_AT_name("resvd_1")
    5437                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_resvd_1")
    5438                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5439                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    5440              
    5441              $C$DW$595       .dwtag  DW_TAG_member
    5442                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$23)
    5443                      .dwattr $C$DW$595, DW_AT_name("ADCCTL1")
    5444                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_ADCCTL1")
    5445                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  106

    5446                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    5447              
    5448              $C$DW$596       .dwtag  DW_TAG_member
    5449                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$23)
    5450                      .dwattr $C$DW$596, DW_AT_name("ADCCTL2")
    5451                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_ADCCTL2")
    5452                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    5453                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    5454              
    5455              $C$DW$597       .dwtag  DW_TAG_member
    5456                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$26)
    5457                      .dwattr $C$DW$597, DW_AT_name("rsvd_2")
    5458                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_rsvd_2")
    5459                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    5460                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    5461              
    5462              $C$DW$598       .dwtag  DW_TAG_member
    5463                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$23)
    5464                      .dwattr $C$DW$598, DW_AT_name("ADCINTFLG")
    5465                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_ADCINTFLG")
    5466                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    5467                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    5468              
    5469              $C$DW$599       .dwtag  DW_TAG_member
    5470                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$23)
    5471                      .dwattr $C$DW$599, DW_AT_name("ADCINTFLGCLR")
    5472                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    5473                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    5474                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    5475              
    5476              $C$DW$600       .dwtag  DW_TAG_member
    5477                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$23)
    5478                      .dwattr $C$DW$600, DW_AT_name("ADCINTOVF")
    5479                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_ADCINTOVF")
    5480                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    5481                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    5482              
    5483              $C$DW$601       .dwtag  DW_TAG_member
    5484                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$23)
    5485                      .dwattr $C$DW$601, DW_AT_name("ADCINTOVFCLR")
    5486                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    5487                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    5488                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    5489              
    5490              $C$DW$602       .dwtag  DW_TAG_member
    5491                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$27)
    5492                      .dwattr $C$DW$602, DW_AT_name("INTSELxNy")
    5493                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_INTSELxNy")
    5494                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    5495                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    5496              
    5497              $C$DW$603       .dwtag  DW_TAG_member
    5498                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$28)
    5499                      .dwattr $C$DW$603, DW_AT_name("rsvd_3")
    5500                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_rsvd_3")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  107

    5501                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    5502                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    5503              
    5504              $C$DW$604       .dwtag  DW_TAG_member
    5505                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$23)
    5506                      .dwattr $C$DW$604, DW_AT_name("SOCPRICTRL")
    5507                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_SOCPRICTRL")
    5508                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    5509                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    5510              
    5511              $C$DW$605       .dwtag  DW_TAG_member
    5512                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$23)
    5513                      .dwattr $C$DW$605, DW_AT_name("rsvd_4")
    5514                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_rsvd_4")
    5515                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    5516                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    5517              
    5518              $C$DW$606       .dwtag  DW_TAG_member
    5519                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$23)
    5520                      .dwattr $C$DW$606, DW_AT_name("ADCSAMPLEMODE")
    5521                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    5522                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    5523                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    5524              
    5525              $C$DW$607       .dwtag  DW_TAG_member
    5526                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$23)
    5527                      .dwattr $C$DW$607, DW_AT_name("rsvd_5")
    5528                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_rsvd_5")
    5529                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    5530                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    5531              
    5532              $C$DW$608       .dwtag  DW_TAG_member
    5533                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$23)
    5534                      .dwattr $C$DW$608, DW_AT_name("ADCINTSOCSEL1")
    5535                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    5536                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    5537                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    5538              
    5539              $C$DW$609       .dwtag  DW_TAG_member
    5540                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$23)
    5541                      .dwattr $C$DW$609, DW_AT_name("ADCINTSOCSEL2")
    5542                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    5543                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    5544                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    5545              
    5546              $C$DW$610       .dwtag  DW_TAG_member
    5547                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$26)
    5548                      .dwattr $C$DW$610, DW_AT_name("rsvd_6")
    5549                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_rsvd_6")
    5550                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    5551                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    5552              
    5553              $C$DW$611       .dwtag  DW_TAG_member
    5554                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$23)
    5555                      .dwattr $C$DW$611, DW_AT_name("ADCSOCFLG1")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  108

    5556                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    5557                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    5558                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    5559              
    5560              $C$DW$612       .dwtag  DW_TAG_member
    5561                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$23)
    5562                      .dwattr $C$DW$612, DW_AT_name("rsvd_7")
    5563                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_rsvd_7")
    5564                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    5565                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    5566              
    5567              $C$DW$613       .dwtag  DW_TAG_member
    5568                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$23)
    5569                      .dwattr $C$DW$613, DW_AT_name("ADCSOCFRC1")
    5570                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    5571                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    5572                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    5573              
    5574              $C$DW$614       .dwtag  DW_TAG_member
    5575                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$23)
    5576                      .dwattr $C$DW$614, DW_AT_name("rsvd_8")
    5577                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_rsvd_8")
    5578                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    5579                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    5580              
    5581              $C$DW$615       .dwtag  DW_TAG_member
    5582                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$23)
    5583                      .dwattr $C$DW$615, DW_AT_name("ADCSOCOVF1")
    5584                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    5585                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    5586                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    5587              
    5588              $C$DW$616       .dwtag  DW_TAG_member
    5589                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$23)
    5590                      .dwattr $C$DW$616, DW_AT_name("rsvd_9")
    5591                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_rsvd_9")
    5592                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    5593                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    5594              
    5595              $C$DW$617       .dwtag  DW_TAG_member
    5596                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$23)
    5597                      .dwattr $C$DW$617, DW_AT_name("ADCSOCOVFCLR1")
    5598                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    5599                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    5600                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    5601              
    5602              $C$DW$618       .dwtag  DW_TAG_member
    5603                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$23)
    5604                      .dwattr $C$DW$618, DW_AT_name("rsvd_10")
    5605                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_rsvd_10")
    5606                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    5607                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    5608              
    5609              $C$DW$619       .dwtag  DW_TAG_member
    5610                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  109

    5611                      .dwattr $C$DW$619, DW_AT_name("ADCSOCxCTL")
    5612                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    5613                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    5614                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    5615              
    5616              $C$DW$620       .dwtag  DW_TAG_member
    5617                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$24)
    5618                      .dwattr $C$DW$620, DW_AT_name("rsvd_11")
    5619                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_rsvd_11")
    5620                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    5621                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    5622              
    5623              $C$DW$621       .dwtag  DW_TAG_member
    5624                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$23)
    5625                      .dwattr $C$DW$621, DW_AT_name("ADCREFTRIM")
    5626                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_ADCREFTRIM")
    5627                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    5628                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    5629              
    5630              $C$DW$622       .dwtag  DW_TAG_member
    5631                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$23)
    5632                      .dwattr $C$DW$622, DW_AT_name("ADCOFFTRIM")
    5633                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    5634                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    5635                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    5636              
    5637              $C$DW$623       .dwtag  DW_TAG_member
    5638                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$29)
    5639                      .dwattr $C$DW$623, DW_AT_name("resvd_12")
    5640                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_resvd_12")
    5641                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    5642                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    5643              
    5644              $C$DW$624       .dwtag  DW_TAG_member
    5645                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$23)
    5646                      .dwattr $C$DW$624, DW_AT_name("ADCREV")
    5647                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_ADCREV")
    5648                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    5649                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    5650              
    5651                      .dwendtag $C$DW$T$30
    5652              
    5653              $C$DW$T$237     .dwtag  DW_TAG_typedef
    5654                      .dwattr $C$DW$T$237, DW_AT_name("ADC_Obj")
    5655                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$30)
    5656                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    5657              
    5658              $C$DW$T$116     .dwtag  DW_TAG_pointer_type
    5659                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$30)
    5660                      .dwattr $C$DW$T$116, DW_AT_address_class(0x20)
    5661              
    5662              $C$DW$T$117     .dwtag  DW_TAG_typedef
    5663                      .dwattr $C$DW$T$117, DW_AT_name("ADC_Handle")
    5664                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    5665                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  110

    5666              
    5667              
    5668              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5669                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    5670                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    5671              $C$DW$625       .dwtag  DW_TAG_member
    5672                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$31)
    5673                      .dwattr $C$DW$625, DW_AT_name("alpha_sf")
    5674                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_alpha_sf")
    5675                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5676                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    5677              
    5678              $C$DW$626       .dwtag  DW_TAG_member
    5679                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$31)
    5680                      .dwattr $C$DW$626, DW_AT_name("beta_sf")
    5681                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_beta_sf")
    5682                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5683                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    5684              
    5685              $C$DW$627       .dwtag  DW_TAG_member
    5686                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$32)
    5687                      .dwattr $C$DW$627, DW_AT_name("numSensors")
    5688                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_numSensors")
    5689                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5690                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    5691              
    5692                      .dwendtag $C$DW$T$33
    5693              
    5694              $C$DW$T$44      .dwtag  DW_TAG_typedef
    5695                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Obj")
    5696                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    5697                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    5698              
    5699              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    5700                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    5701                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    5702              
    5703              $C$DW$T$43      .dwtag  DW_TAG_typedef
    5704                      .dwattr $C$DW$T$43, DW_AT_name("CLARKE_Handle")
    5705                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    5706                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    5707              
    5708              
    5709              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5710                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    5711                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    5712              $C$DW$628       .dwtag  DW_TAG_member
    5713                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$23)
    5714                      .dwattr $C$DW$628, DW_AT_name("XCLK")
    5715                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_XCLK")
    5716                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5717                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    5718              
    5719              $C$DW$629       .dwtag  DW_TAG_member
    5720                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  111

    5721                      .dwattr $C$DW$629, DW_AT_name("rsvd_1")
    5722                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_rsvd_1")
    5723                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5724                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    5725              
    5726              $C$DW$630       .dwtag  DW_TAG_member
    5727                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$23)
    5728                      .dwattr $C$DW$630, DW_AT_name("CLKCTL")
    5729                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_CLKCTL")
    5730                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5731                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    5732              
    5733              $C$DW$631       .dwtag  DW_TAG_member
    5734                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$34)
    5735                      .dwattr $C$DW$631, DW_AT_name("rsvd_2")
    5736                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_rsvd_2")
    5737                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5738                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    5739              
    5740              $C$DW$632       .dwtag  DW_TAG_member
    5741                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$23)
    5742                      .dwattr $C$DW$632, DW_AT_name("LOSPCP")
    5743                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_LOSPCP")
    5744                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5745                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    5746              
    5747              $C$DW$633       .dwtag  DW_TAG_member
    5748                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$23)
    5749                      .dwattr $C$DW$633, DW_AT_name("PCLKCR0")
    5750                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_PCLKCR0")
    5751                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5752                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    5753              
    5754              $C$DW$634       .dwtag  DW_TAG_member
    5755                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$23)
    5756                      .dwattr $C$DW$634, DW_AT_name("PCLKCR1")
    5757                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_PCLKCR1")
    5758                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5759                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    5760              
    5761              $C$DW$635       .dwtag  DW_TAG_member
    5762                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$26)
    5763                      .dwattr $C$DW$635, DW_AT_name("rsvd_3")
    5764                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_rsvd_3")
    5765                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5766                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    5767              
    5768              $C$DW$636       .dwtag  DW_TAG_member
    5769                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$23)
    5770                      .dwattr $C$DW$636, DW_AT_name("PCLKCR3")
    5771                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_PCLKCR3")
    5772                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5773                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    5774              
    5775                      .dwendtag $C$DW$T$35
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  112

    5776              
    5777              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    5778                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$35)
    5779                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
    5780              
    5781              $C$DW$T$119     .dwtag  DW_TAG_typedef
    5782                      .dwattr $C$DW$T$119, DW_AT_name("CLK_Handle")
    5783                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    5784                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    5785              
    5786              
    5787              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5788                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    5789                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    5790              $C$DW$637       .dwtag  DW_TAG_member
    5791                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$32)
    5792                      .dwattr $C$DW$637, DW_AT_name("tmp")
    5793                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_tmp")
    5794                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5795                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    5796              
    5797                      .dwendtag $C$DW$T$36
    5798              
    5799              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    5800                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$36)
    5801                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    5802              
    5803              $C$DW$T$121     .dwtag  DW_TAG_typedef
    5804                      .dwattr $C$DW$T$121, DW_AT_name("CPU_Handle")
    5805                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    5806                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    5807              
    5808              
    5809              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    5810                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    5811                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    5812              $C$DW$638       .dwtag  DW_TAG_member
    5813                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$37)
    5814                      .dwattr $C$DW$638, DW_AT_name("version")
    5815                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_version")
    5816                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5817                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    5818              
    5819              $C$DW$639       .dwtag  DW_TAG_member
    5820                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$39)
    5821                      .dwattr $C$DW$639, DW_AT_name("state")
    5822                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_state")
    5823                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5824                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    5825              
    5826              $C$DW$640       .dwtag  DW_TAG_member
    5827                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$39)
    5828                      .dwattr $C$DW$640, DW_AT_name("prevState")
    5829                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_prevState")
    5830                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  113

    5831                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    5832              
    5833              $C$DW$641       .dwtag  DW_TAG_member
    5834                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$41)
    5835                      .dwattr $C$DW$641, DW_AT_name("errorCode")
    5836                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_errorCode")
    5837                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5838                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    5839              
    5840              $C$DW$642       .dwtag  DW_TAG_member
    5841                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$43)
    5842                      .dwattr $C$DW$642, DW_AT_name("clarkeHandle_I")
    5843                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_clarkeHandle_I")
    5844                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5845                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    5846              
    5847              $C$DW$643       .dwtag  DW_TAG_member
    5848                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$44)
    5849                      .dwattr $C$DW$643, DW_AT_name("clarke_I")
    5850                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_clarke_I")
    5851                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5852                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    5853              
    5854              $C$DW$644       .dwtag  DW_TAG_member
    5855                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$43)
    5856                      .dwattr $C$DW$644, DW_AT_name("clarkeHandle_V")
    5857                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_clarkeHandle_V")
    5858                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5859                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    5860              
    5861              $C$DW$645       .dwtag  DW_TAG_member
    5862                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$44)
    5863                      .dwattr $C$DW$645, DW_AT_name("clarke_V")
    5864                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_clarke_V")
    5865                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5866                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    5867              
    5868              $C$DW$646       .dwtag  DW_TAG_member
    5869                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$46)
    5870                      .dwattr $C$DW$646, DW_AT_name("estHandle")
    5871                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_estHandle")
    5872                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5873                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    5874              
    5875              $C$DW$647       .dwtag  DW_TAG_member
    5876                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$48)
    5877                      .dwattr $C$DW$647, DW_AT_name("parkHandle")
    5878                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_parkHandle")
    5879                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5880                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    5881              
    5882              $C$DW$648       .dwtag  DW_TAG_member
    5883                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$49)
    5884                      .dwattr $C$DW$648, DW_AT_name("park")
    5885                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_park")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  114

    5886                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5887                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    5888              
    5889              $C$DW$649       .dwtag  DW_TAG_member
    5890                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$51)
    5891                      .dwattr $C$DW$649, DW_AT_name("pidHandle_Id")
    5892                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_pidHandle_Id")
    5893                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5894                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    5895              
    5896              $C$DW$650       .dwtag  DW_TAG_member
    5897                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$52)
    5898                      .dwattr $C$DW$650, DW_AT_name("pid_Id")
    5899                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_pid_Id")
    5900                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5901                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    5902              
    5903              $C$DW$651       .dwtag  DW_TAG_member
    5904                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$51)
    5905                      .dwattr $C$DW$651, DW_AT_name("pidHandle_Iq")
    5906                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_pidHandle_Iq")
    5907                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5908                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    5909              
    5910              $C$DW$652       .dwtag  DW_TAG_member
    5911                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$52)
    5912                      .dwattr $C$DW$652, DW_AT_name("pid_Iq")
    5913                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_pid_Iq")
    5914                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5915                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    5916              
    5917              $C$DW$653       .dwtag  DW_TAG_member
    5918                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$51)
    5919                      .dwattr $C$DW$653, DW_AT_name("pidHandle_spd")
    5920                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_pidHandle_spd")
    5921                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5922                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    5923              
    5924              $C$DW$654       .dwtag  DW_TAG_member
    5925                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$52)
    5926                      .dwattr $C$DW$654, DW_AT_name("pid_spd")
    5927                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_pid_spd")
    5928                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5929                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    5930              
    5931              $C$DW$655       .dwtag  DW_TAG_member
    5932                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$54)
    5933                      .dwattr $C$DW$655, DW_AT_name("iparkHandle")
    5934                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_iparkHandle")
    5935                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    5936                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    5937              
    5938              $C$DW$656       .dwtag  DW_TAG_member
    5939                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$55)
    5940                      .dwattr $C$DW$656, DW_AT_name("ipark")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  115

    5941                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_ipark")
    5942                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5943                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    5944              
    5945              $C$DW$657       .dwtag  DW_TAG_member
    5946                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$57)
    5947                      .dwattr $C$DW$657, DW_AT_name("svgenHandle")
    5948                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_svgenHandle")
    5949                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5950                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    5951              
    5952              $C$DW$658       .dwtag  DW_TAG_member
    5953                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$58)
    5954                      .dwattr $C$DW$658, DW_AT_name("svgen")
    5955                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_svgen")
    5956                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5957                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    5958              
    5959              $C$DW$659       .dwtag  DW_TAG_member
    5960                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$60)
    5961                      .dwattr $C$DW$659, DW_AT_name("trajHandle_Id")
    5962                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_trajHandle_Id")
    5963                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5964                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    5965              
    5966              $C$DW$660       .dwtag  DW_TAG_member
    5967                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$61)
    5968                      .dwattr $C$DW$660, DW_AT_name("traj_Id")
    5969                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_traj_Id")
    5970                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    5971                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    5972              
    5973              $C$DW$661       .dwtag  DW_TAG_member
    5974                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$60)
    5975                      .dwattr $C$DW$661, DW_AT_name("trajHandle_spd")
    5976                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_trajHandle_spd")
    5977                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    5978                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    5979              
    5980              $C$DW$662       .dwtag  DW_TAG_member
    5981                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$61)
    5982                      .dwattr $C$DW$662, DW_AT_name("traj_spd")
    5983                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_traj_spd")
    5984                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    5985                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    5986              
    5987              $C$DW$663       .dwtag  DW_TAG_member
    5988                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$60)
    5989                      .dwattr $C$DW$663, DW_AT_name("trajHandle_spdMax")
    5990                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    5991                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5992                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    5993              
    5994              $C$DW$664       .dwtag  DW_TAG_member
    5995                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$61)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  116

    5996                      .dwattr $C$DW$664, DW_AT_name("traj_spdMax")
    5997                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_traj_spdMax")
    5998                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5999                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6000              
    6001              $C$DW$665       .dwtag  DW_TAG_member
    6002                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$62)
    6003                      .dwattr $C$DW$665, DW_AT_name("motorParams")
    6004                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_motorParams")
    6005                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6006                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6007              
    6008              $C$DW$666       .dwtag  DW_TAG_member
    6009                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$65)
    6010                      .dwattr $C$DW$666, DW_AT_name("waitTimes")
    6011                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_waitTimes")
    6012                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6013                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6014              
    6015              $C$DW$667       .dwtag  DW_TAG_member
    6016                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$64)
    6017                      .dwattr $C$DW$667, DW_AT_name("counter_state")
    6018                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_counter_state")
    6019                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6020                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6021              
    6022              $C$DW$668       .dwtag  DW_TAG_member
    6023                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$66)
    6024                      .dwattr $C$DW$668, DW_AT_name("numIsrTicksPerCtrlTick")
    6025                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6026                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6027                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6028              
    6029              $C$DW$669       .dwtag  DW_TAG_member
    6030                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$66)
    6031                      .dwattr $C$DW$669, DW_AT_name("numCtrlTicksPerCurrentTick")
    6032                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6033                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6034                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6035              
    6036              $C$DW$670       .dwtag  DW_TAG_member
    6037                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$66)
    6038                      .dwattr $C$DW$670, DW_AT_name("numCtrlTicksPerSpeedTick")
    6039                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6040                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6041                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6042              
    6043              $C$DW$671       .dwtag  DW_TAG_member
    6044                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$66)
    6045                      .dwattr $C$DW$671, DW_AT_name("numCtrlTicksPerTrajTick")
    6046                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6047                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6048                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6049              
    6050              $C$DW$672       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  117

    6051                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$64)
    6052                      .dwattr $C$DW$672, DW_AT_name("ctrlFreq_Hz")
    6053                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6054                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6055                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6056              
    6057              $C$DW$673       .dwtag  DW_TAG_member
    6058                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$64)
    6059                      .dwattr $C$DW$673, DW_AT_name("trajFreq_Hz")
    6060                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6061                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6062                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6063              
    6064              $C$DW$674       .dwtag  DW_TAG_member
    6065                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$31)
    6066                      .dwattr $C$DW$674, DW_AT_name("trajPeriod_sec")
    6067                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6068                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6069                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6070              
    6071              $C$DW$675       .dwtag  DW_TAG_member
    6072                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$67)
    6073                      .dwattr $C$DW$675, DW_AT_name("ctrlPeriod_sec")
    6074                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    6075                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6076                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6077              
    6078              $C$DW$676       .dwtag  DW_TAG_member
    6079                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$31)
    6080                      .dwattr $C$DW$676, DW_AT_name("maxVsMag_pu")
    6081                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6082                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6083                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6084              
    6085              $C$DW$677       .dwtag  DW_TAG_member
    6086                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$68)
    6087                      .dwattr $C$DW$677, DW_AT_name("Iab_in")
    6088                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_Iab_in")
    6089                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    6090                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6091              
    6092              $C$DW$678       .dwtag  DW_TAG_member
    6093                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$68)
    6094                      .dwattr $C$DW$678, DW_AT_name("Iab_filt")
    6095                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_Iab_filt")
    6096                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6097                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6098              
    6099              $C$DW$679       .dwtag  DW_TAG_member
    6100                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$68)
    6101                      .dwattr $C$DW$679, DW_AT_name("Idq_in")
    6102                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_Idq_in")
    6103                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6104                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6105              
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  118

    6106              $C$DW$680       .dwtag  DW_TAG_member
    6107                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$68)
    6108                      .dwattr $C$DW$680, DW_AT_name("Vab_in")
    6109                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_Vab_in")
    6110                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6111                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6112              
    6113              $C$DW$681       .dwtag  DW_TAG_member
    6114                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$31)
    6115                      .dwattr $C$DW$681, DW_AT_name("spd_out")
    6116                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_spd_out")
    6117                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6118                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6119              
    6120              $C$DW$682       .dwtag  DW_TAG_member
    6121                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$68)
    6122                      .dwattr $C$DW$682, DW_AT_name("Vab_out")
    6123                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_Vab_out")
    6124                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6125                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6126              
    6127              $C$DW$683       .dwtag  DW_TAG_member
    6128                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$68)
    6129                      .dwattr $C$DW$683, DW_AT_name("Vdq_out")
    6130                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_Vdq_out")
    6131                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6132                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6133              
    6134              $C$DW$684       .dwtag  DW_TAG_member
    6135                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$67)
    6136                      .dwattr $C$DW$684, DW_AT_name("Rhf")
    6137                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_Rhf")
    6138                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6139                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6140              
    6141              $C$DW$685       .dwtag  DW_TAG_member
    6142                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$67)
    6143                      .dwattr $C$DW$685, DW_AT_name("Lhf")
    6144                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_Lhf")
    6145                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6146                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6147              
    6148              $C$DW$686       .dwtag  DW_TAG_member
    6149                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$67)
    6150                      .dwattr $C$DW$686, DW_AT_name("RoverL")
    6151                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_RoverL")
    6152                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6153                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6154              
    6155              $C$DW$687       .dwtag  DW_TAG_member
    6156                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$31)
    6157                      .dwattr $C$DW$687, DW_AT_name("Kp_Id")
    6158                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_Kp_Id")
    6159                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6160                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  119

    6161              
    6162              $C$DW$688       .dwtag  DW_TAG_member
    6163                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$31)
    6164                      .dwattr $C$DW$688, DW_AT_name("Kp_Iq")
    6165                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_Kp_Iq")
    6166                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6167                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6168              
    6169              $C$DW$689       .dwtag  DW_TAG_member
    6170                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$31)
    6171                      .dwattr $C$DW$689, DW_AT_name("Kp_spd")
    6172                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_Kp_spd")
    6173                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    6174                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6175              
    6176              $C$DW$690       .dwtag  DW_TAG_member
    6177                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$31)
    6178                      .dwattr $C$DW$690, DW_AT_name("Ki_Id")
    6179                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_Ki_Id")
    6180                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6181                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6182              
    6183              $C$DW$691       .dwtag  DW_TAG_member
    6184                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$31)
    6185                      .dwattr $C$DW$691, DW_AT_name("Ki_Iq")
    6186                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_Ki_Iq")
    6187                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6188                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6189              
    6190              $C$DW$692       .dwtag  DW_TAG_member
    6191                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$31)
    6192                      .dwattr $C$DW$692, DW_AT_name("Ki_spd")
    6193                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_Ki_spd")
    6194                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6195                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6196              
    6197              $C$DW$693       .dwtag  DW_TAG_member
    6198                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$31)
    6199                      .dwattr $C$DW$693, DW_AT_name("Kd_Id")
    6200                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_Kd_Id")
    6201                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6202                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6203              
    6204              $C$DW$694       .dwtag  DW_TAG_member
    6205                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$31)
    6206                      .dwattr $C$DW$694, DW_AT_name("Kd_Iq")
    6207                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_Kd_Iq")
    6208                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6209                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6210              
    6211              $C$DW$695       .dwtag  DW_TAG_member
    6212                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$31)
    6213                      .dwattr $C$DW$695, DW_AT_name("Kd_spd")
    6214                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_Kd_spd")
    6215                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  120

    6216                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6217              
    6218              $C$DW$696       .dwtag  DW_TAG_member
    6219                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$31)
    6220                      .dwattr $C$DW$696, DW_AT_name("Ui_Id")
    6221                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_Ui_Id")
    6222                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6223                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6224              
    6225              $C$DW$697       .dwtag  DW_TAG_member
    6226                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$31)
    6227                      .dwattr $C$DW$697, DW_AT_name("Ui_Iq")
    6228                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Ui_Iq")
    6229                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6230                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6231              
    6232              $C$DW$698       .dwtag  DW_TAG_member
    6233                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$31)
    6234                      .dwattr $C$DW$698, DW_AT_name("Ui_spd")
    6235                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_Ui_spd")
    6236                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6237                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6238              
    6239              $C$DW$699       .dwtag  DW_TAG_member
    6240                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$68)
    6241                      .dwattr $C$DW$699, DW_AT_name("Idq_ref")
    6242                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_Idq_ref")
    6243                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6244                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6245              
    6246              $C$DW$700       .dwtag  DW_TAG_member
    6247                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$31)
    6248                      .dwattr $C$DW$700, DW_AT_name("IdRated")
    6249                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_IdRated")
    6250                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    6251                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6252              
    6253              $C$DW$701       .dwtag  DW_TAG_member
    6254                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$31)
    6255                      .dwattr $C$DW$701, DW_AT_name("spd_ref")
    6256                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_spd_ref")
    6257                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    6258                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6259              
    6260              $C$DW$702       .dwtag  DW_TAG_member
    6261                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$31)
    6262                      .dwattr $C$DW$702, DW_AT_name("spd_max")
    6263                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_spd_max")
    6264                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    6265                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6266              
    6267              $C$DW$703       .dwtag  DW_TAG_member
    6268                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$66)
    6269                      .dwattr $C$DW$703, DW_AT_name("counter_current")
    6270                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_counter_current")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  121

    6271                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    6272                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6273              
    6274              $C$DW$704       .dwtag  DW_TAG_member
    6275                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$66)
    6276                      .dwattr $C$DW$704, DW_AT_name("counter_isr")
    6277                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_counter_isr")
    6278                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    6279                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6280              
    6281              $C$DW$705       .dwtag  DW_TAG_member
    6282                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$66)
    6283                      .dwattr $C$DW$705, DW_AT_name("counter_speed")
    6284                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_counter_speed")
    6285                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    6286                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6287              
    6288              $C$DW$706       .dwtag  DW_TAG_member
    6289                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$66)
    6290                      .dwattr $C$DW$706, DW_AT_name("counter_traj")
    6291                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_counter_traj")
    6292                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    6293                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6294              
    6295              $C$DW$707       .dwtag  DW_TAG_member
    6296                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$69)
    6297                      .dwattr $C$DW$707, DW_AT_name("flag_enableCtrl")
    6298                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_flag_enableCtrl")
    6299                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    6300                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6301              
    6302              $C$DW$708       .dwtag  DW_TAG_member
    6303                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$69)
    6304                      .dwattr $C$DW$708, DW_AT_name("flag_enableDcBusComp")
    6305                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    6306                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    6307                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6308              
    6309              $C$DW$709       .dwtag  DW_TAG_member
    6310                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$69)
    6311                      .dwattr $C$DW$709, DW_AT_name("flag_enablePowerWarp")
    6312                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    6313                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    6314                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6315              
    6316              $C$DW$710       .dwtag  DW_TAG_member
    6317                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$69)
    6318                      .dwattr $C$DW$710, DW_AT_name("flag_enableOffset")
    6319                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_flag_enableOffset")
    6320                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    6321                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6322              
    6323              $C$DW$711       .dwtag  DW_TAG_member
    6324                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$69)
    6325                      .dwattr $C$DW$711, DW_AT_name("flag_enableSpeedCtrl")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  122

    6326                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    6327                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    6328                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6329              
    6330              $C$DW$712       .dwtag  DW_TAG_member
    6331                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$69)
    6332                      .dwattr $C$DW$712, DW_AT_name("flag_enableUserMotorParams")
    6333                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    6334                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    6335                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6336              
    6337              $C$DW$713       .dwtag  DW_TAG_member
    6338                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$68)
    6339                      .dwattr $C$DW$713, DW_AT_name("Idq_offset_pu")
    6340                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_Idq_offset_pu")
    6341                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    6342                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6343              
    6344              $C$DW$714       .dwtag  DW_TAG_member
    6345                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$68)
    6346                      .dwattr $C$DW$714, DW_AT_name("Vdq_offset_pu")
    6347                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    6348                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    6349                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6350              
    6351              $C$DW$715       .dwtag  DW_TAG_member
    6352                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$31)
    6353                      .dwattr $C$DW$715, DW_AT_name("angle_pu")
    6354                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_angle_pu")
    6355                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    6356                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6357              
    6358              $C$DW$716       .dwtag  DW_TAG_member
    6359                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$31)
    6360                      .dwattr $C$DW$716, DW_AT_name("speed_ref_pu")
    6361                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_speed_ref_pu")
    6362                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    6363                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6364              
    6365              $C$DW$717       .dwtag  DW_TAG_member
    6366                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$31)
    6367                      .dwattr $C$DW$717, DW_AT_name("speed_fb_pu")
    6368                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_speed_fb_pu")
    6369                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    6370                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6371              
    6372              $C$DW$718       .dwtag  DW_TAG_member
    6373                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$31)
    6374                      .dwattr $C$DW$718, DW_AT_name("speed_outMax_pu")
    6375                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_speed_outMax_pu")
    6376                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    6377                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6378              
    6379              $C$DW$719       .dwtag  DW_TAG_member
    6380                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  123

    6381                      .dwattr $C$DW$719, DW_AT_name("flag_enableCurrentCtrl")
    6382                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    6383                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    6384                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6385              
    6386                      .dwendtag $C$DW$T$70
    6387              
    6388              $C$DW$T$238     .dwtag  DW_TAG_typedef
    6389                      .dwattr $C$DW$T$238, DW_AT_name("CTRL_Obj")
    6390                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$70)
    6391                      .dwattr $C$DW$T$238, DW_AT_language(DW_LANG_C)
    6392              
    6393              $C$DW$T$239     .dwtag  DW_TAG_pointer_type
    6394                      .dwattr $C$DW$T$239, DW_AT_type(*$C$DW$T$238)
    6395                      .dwattr $C$DW$T$239, DW_AT_address_class(0x20)
    6396              
    6397              $C$DW$T$200     .dwtag  DW_TAG_pointer_type
    6398                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$70)
    6399                      .dwattr $C$DW$T$200, DW_AT_address_class(0x20)
    6400              
    6401              $C$DW$T$201     .dwtag  DW_TAG_typedef
    6402                      .dwattr $C$DW$T$201, DW_AT_name("CTRL_Handle")
    6403                      .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$200)
    6404                      .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    6405              
    6406              $C$DW$720       .dwtag  DW_TAG_TI_far_type
    6407                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$201)
    6408              
    6409              $C$DW$T$240     .dwtag  DW_TAG_const_type
    6410                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$720)
    6411              
    6412              
    6413              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    6414                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    6415                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    6416              $C$DW$721       .dwtag  DW_TAG_member
    6417                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$22)
    6418                      .dwattr $C$DW$721, DW_AT_name("rsvd")
    6419                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_rsvd")
    6420                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6421                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6422              
    6423              $C$DW$722       .dwtag  DW_TAG_member
    6424                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$72)
    6425                      .dwattr $C$DW$722, DW_AT_name("targetProc")
    6426                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_targetProc")
    6427                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6428                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6429              
    6430              $C$DW$723       .dwtag  DW_TAG_member
    6431                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$22)
    6432                      .dwattr $C$DW$723, DW_AT_name("major")
    6433                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_major")
    6434                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6435                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  124

    6436              
    6437              $C$DW$724       .dwtag  DW_TAG_member
    6438                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$22)
    6439                      .dwattr $C$DW$724, DW_AT_name("minor")
    6440                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_minor")
    6441                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6442                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6443              
    6444                      .dwendtag $C$DW$T$73
    6445              
    6446              $C$DW$T$37      .dwtag  DW_TAG_typedef
    6447                      .dwattr $C$DW$T$37, DW_AT_name("CTRL_Version")
    6448                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    6449                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    6450              
    6451              $C$DW$T$248     .dwtag  DW_TAG_pointer_type
    6452                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$37)
    6453                      .dwattr $C$DW$T$248, DW_AT_address_class(0x20)
    6454              
    6455              
    6456              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    6457                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8301_Obj_")
    6458                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    6459              $C$DW$725       .dwtag  DW_TAG_member
    6460                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$75)
    6461                      .dwattr $C$DW$725, DW_AT_name("spiHandle")
    6462                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_spiHandle")
    6463                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6464                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6465              
    6466              $C$DW$726       .dwtag  DW_TAG_member
    6467                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$77)
    6468                      .dwattr $C$DW$726, DW_AT_name("gpioHandle")
    6469                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_gpioHandle")
    6470                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6471                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6472              
    6473              $C$DW$727       .dwtag  DW_TAG_member
    6474                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$79)
    6475                      .dwattr $C$DW$727, DW_AT_name("gpioNumber")
    6476                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_gpioNumber")
    6477                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6478                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6479              
    6480              $C$DW$728       .dwtag  DW_TAG_member
    6481                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$69)
    6482                      .dwattr $C$DW$728, DW_AT_name("RxTimeOut")
    6483                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_RxTimeOut")
    6484                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6485                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6486              
    6487              $C$DW$729       .dwtag  DW_TAG_member
    6488                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$69)
    6489                      .dwattr $C$DW$729, DW_AT_name("enableTimeOut")
    6490                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_enableTimeOut")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  125

    6491                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6492                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6493              
    6494                      .dwendtag $C$DW$T$80
    6495              
    6496              $C$DW$T$149     .dwtag  DW_TAG_typedef
    6497                      .dwattr $C$DW$T$149, DW_AT_name("DRV8301_Obj")
    6498                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$80)
    6499                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    6500              
    6501              $C$DW$T$147     .dwtag  DW_TAG_pointer_type
    6502                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$80)
    6503                      .dwattr $C$DW$T$147, DW_AT_address_class(0x20)
    6504              
    6505              $C$DW$T$148     .dwtag  DW_TAG_typedef
    6506                      .dwattr $C$DW$T$148, DW_AT_name("DRV8301_Handle")
    6507                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$147)
    6508                      .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
    6509              
    6510              
    6511              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    6512                      .dwattr $C$DW$T$91, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    6513                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x05)
    6514              $C$DW$730       .dwtag  DW_TAG_member
    6515                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$82)
    6516                      .dwattr $C$DW$730, DW_AT_name("DRV8301_CURRENT")
    6517                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    6518                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6519                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    6520              
    6521              $C$DW$731       .dwtag  DW_TAG_member
    6522                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$84)
    6523                      .dwattr $C$DW$731, DW_AT_name("DRV8301_RESET")
    6524                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_DRV8301_RESET")
    6525                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6526                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    6527              
    6528              $C$DW$732       .dwtag  DW_TAG_member
    6529                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$86)
    6530                      .dwattr $C$DW$732, DW_AT_name("PWM_MODE")
    6531                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_PWM_MODE")
    6532                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6533                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    6534              
    6535              $C$DW$733       .dwtag  DW_TAG_member
    6536                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$88)
    6537                      .dwattr $C$DW$733, DW_AT_name("OC_MODE")
    6538                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_OC_MODE")
    6539                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6540                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    6541              
    6542              $C$DW$734       .dwtag  DW_TAG_member
    6543                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$90)
    6544                      .dwattr $C$DW$734, DW_AT_name("OC_ADJ_SET")
    6545                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_OC_ADJ_SET")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  126

    6546                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6547                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    6548              
    6549                      .dwendtag $C$DW$T$91
    6550              
    6551              $C$DW$T$105     .dwtag  DW_TAG_typedef
    6552                      .dwattr $C$DW$T$105, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    6553                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$91)
    6554                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    6555              
    6556              
    6557              $C$DW$T$100     .dwtag  DW_TAG_structure_type
    6558                      .dwattr $C$DW$T$100, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    6559                      .dwattr $C$DW$T$100, DW_AT_byte_size(0x04)
    6560              $C$DW$735       .dwtag  DW_TAG_member
    6561                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$93)
    6562                      .dwattr $C$DW$735, DW_AT_name("OCTW_SET")
    6563                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_OCTW_SET")
    6564                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6565                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    6566              
    6567              $C$DW$736       .dwtag  DW_TAG_member
    6568                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$95)
    6569                      .dwattr $C$DW$736, DW_AT_name("GAIN")
    6570                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_GAIN")
    6571                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6572                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    6573              
    6574              $C$DW$737       .dwtag  DW_TAG_member
    6575                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$97)
    6576                      .dwattr $C$DW$737, DW_AT_name("DC_CAL_CH1p2")
    6577                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    6578                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6579                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6580              
    6581              $C$DW$738       .dwtag  DW_TAG_member
    6582                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$99)
    6583                      .dwattr $C$DW$738, DW_AT_name("OC_TOFF")
    6584                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_OC_TOFF")
    6585                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6586                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    6587              
    6588                      .dwendtag $C$DW$T$100
    6589              
    6590              $C$DW$T$106     .dwtag  DW_TAG_typedef
    6591                      .dwattr $C$DW$T$106, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    6592                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$100)
    6593                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    6594              
    6595              
    6596              $C$DW$T$101     .dwtag  DW_TAG_structure_type
    6597                      .dwattr $C$DW$T$101, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    6598                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x0b)
    6599              $C$DW$739       .dwtag  DW_TAG_member
    6600                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  127

    6601                      .dwattr $C$DW$739, DW_AT_name("FAULT")
    6602                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_FAULT")
    6603                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6604                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    6605              
    6606              $C$DW$740       .dwtag  DW_TAG_member
    6607                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$69)
    6608                      .dwattr $C$DW$740, DW_AT_name("GVDD_UV")
    6609                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_GVDD_UV")
    6610                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6611                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    6612              
    6613              $C$DW$741       .dwtag  DW_TAG_member
    6614                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$69)
    6615                      .dwattr $C$DW$741, DW_AT_name("PVDD_UV")
    6616                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_PVDD_UV")
    6617                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6618                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    6619              
    6620              $C$DW$742       .dwtag  DW_TAG_member
    6621                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$69)
    6622                      .dwattr $C$DW$742, DW_AT_name("OTSD")
    6623                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_OTSD")
    6624                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6625                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    6626              
    6627              $C$DW$743       .dwtag  DW_TAG_member
    6628                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$69)
    6629                      .dwattr $C$DW$743, DW_AT_name("OTW")
    6630                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_OTW")
    6631                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6632                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    6633              
    6634              $C$DW$744       .dwtag  DW_TAG_member
    6635                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$69)
    6636                      .dwattr $C$DW$744, DW_AT_name("FETHA_OC")
    6637                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_FETHA_OC")
    6638                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6639                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    6640              
    6641              $C$DW$745       .dwtag  DW_TAG_member
    6642                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$69)
    6643                      .dwattr $C$DW$745, DW_AT_name("FETLA_OC")
    6644                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_FETLA_OC")
    6645                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6646                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    6647              
    6648              $C$DW$746       .dwtag  DW_TAG_member
    6649                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$69)
    6650                      .dwattr $C$DW$746, DW_AT_name("FETHB_OC")
    6651                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_FETHB_OC")
    6652                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6653                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    6654              
    6655              $C$DW$747       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Tue Jul 26 20:21:17 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\aignacio\AppData\Local\Temp\0890010                         PAGE  128

    6656                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$69)
    6657                      .dwattr $C$DW$747, DW_AT_name("FETLB_OC")
    6658                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_FETLB_OC")
    6659                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6660                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    6661              
    6662              $C$DW$748       .dwtag  DW_TAG_member
    6663                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$69)
    6664                      .dwattr $C$DW$748, DW_AT_name("FETHC_OC")
    6665                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_FETHC_OC")
    6666                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6667                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    6668              
    6669              $C$DW$749       .dwtag  DW_TAG_member
    6670                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$69)
    6671                      .dwattr $C$DW$749, DW_AT_name("FETLC_OC")
    6672                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_FETLC_OC")
    6673                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6674                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    6675              
    6676                      .dwendtag $C$DW$T$101
    6677              
    6678              $C$DW$T$103     .dwtag  DW_TAG_typedef
    6679                      .dwattr $C$DW$T$103, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    6680                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$101)
    6681                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    6682              
    6683              
    6684              $C$DW$T$102     .dwtag  DW_TAG_structure_type
    6685                      .dwattr $C$DW$T$102, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    6686                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x02)
    6687              $C$DW$750       .dwtag  DW_TAG_member
    6688                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$69)
    6689                      .dwattr $C$DW$750, DW_AT_name("GVDD_OV")
