TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Thu Mar 02 13:47:56 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\guilherme\workspace_v6_2\proj_ITS\Flash")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    6489                      .dwattr $C$DW$636, DW_AT_const_value(0x08)
    6490              
    6491              $C$DW$637       .dwtag  DW_TAG_enumerator
    6492                      .dwattr $C$DW$637, DW_AT_name("PIE_GroupNumber_10")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  128

    6493                      .dwattr $C$DW$637, DW_AT_const_value(0x09)
    6494              
    6495              $C$DW$638       .dwtag  DW_TAG_enumerator
    6496                      .dwattr $C$DW$638, DW_AT_name("PIE_GroupNumber_11")
    6497                      .dwattr $C$DW$638, DW_AT_const_value(0x0a)
    6498              
    6499              $C$DW$639       .dwtag  DW_TAG_enumerator
    6500                      .dwattr $C$DW$639, DW_AT_name("PIE_GroupNumber_12")
    6501                      .dwattr $C$DW$639, DW_AT_const_value(0x0b)
    6502              
    6503                      .dwendtag $C$DW$T$226
    6504              
    6505              $C$DW$T$227     .dwtag  DW_TAG_typedef
    6506                      .dwattr $C$DW$T$227, DW_AT_name("PIE_GroupNumber_e")
    6507                      .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$226)
    6508                      .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    6509              
    6510              
    6511              $C$DW$T$229     .dwtag  DW_TAG_enumeration_type
    6512                      .dwattr $C$DW$T$229, DW_AT_byte_size(0x01)
    6513              $C$DW$640       .dwtag  DW_TAG_enumerator
    6514                      .dwattr $C$DW$640, DW_AT_name("CTRL_Type_PID_spd")
    6515                      .dwattr $C$DW$640, DW_AT_const_value(0x00)
    6516              
    6517              $C$DW$641       .dwtag  DW_TAG_enumerator
    6518                      .dwattr $C$DW$641, DW_AT_name("CTRL_Type_PID_Id")
    6519                      .dwattr $C$DW$641, DW_AT_const_value(0x01)
    6520              
    6521              $C$DW$642       .dwtag  DW_TAG_enumerator
    6522                      .dwattr $C$DW$642, DW_AT_name("CTRL_Type_PID_Iq")
    6523                      .dwattr $C$DW$642, DW_AT_const_value(0x02)
    6524              
    6525                      .dwendtag $C$DW$T$229
    6526              
    6527              $C$DW$T$230     .dwtag  DW_TAG_typedef
    6528                      .dwattr $C$DW$T$230, DW_AT_name("CTRL_Type_e")
    6529                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$229)
    6530                      .dwattr $C$DW$T$230, DW_AT_language(DW_LANG_C)
    6531              
    6532              
    6533              $C$DW$T$232     .dwtag  DW_TAG_enumeration_type
    6534                      .dwattr $C$DW$T$232, DW_AT_byte_size(0x01)
    6535              $C$DW$643       .dwtag  DW_TAG_enumerator
    6536                      .dwattr $C$DW$643, DW_AT_name("HAL_SensorType_Current")
    6537                      .dwattr $C$DW$643, DW_AT_const_value(0x00)
    6538              
    6539              $C$DW$644       .dwtag  DW_TAG_enumerator
    6540                      .dwattr $C$DW$644, DW_AT_name("HAL_SensorType_Voltage")
    6541                      .dwattr $C$DW$644, DW_AT_const_value(0x01)
    6542              
    6543                      .dwendtag $C$DW$T$232
    6544              
    6545              $C$DW$T$233     .dwtag  DW_TAG_typedef
    6546                      .dwattr $C$DW$T$233, DW_AT_name("HAL_SensorType_e")
    6547                      .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$232)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  129

    6548                      .dwattr $C$DW$T$233, DW_AT_language(DW_LANG_C)
    6549              
    6550              
    6551              $C$DW$T$235     .dwtag  DW_TAG_enumeration_type
    6552                      .dwattr $C$DW$T$235, DW_AT_byte_size(0x01)
    6553              $C$DW$645       .dwtag  DW_TAG_enumerator
    6554                      .dwattr $C$DW$645, DW_AT_name("PWM_Number_1")
    6555                      .dwattr $C$DW$645, DW_AT_const_value(0x00)
    6556              
    6557              $C$DW$646       .dwtag  DW_TAG_enumerator
    6558                      .dwattr $C$DW$646, DW_AT_name("PWM_Number_2")
    6559                      .dwattr $C$DW$646, DW_AT_const_value(0x01)
    6560              
    6561              $C$DW$647       .dwtag  DW_TAG_enumerator
    6562                      .dwattr $C$DW$647, DW_AT_name("PWM_Number_3")
    6563                      .dwattr $C$DW$647, DW_AT_const_value(0x02)
    6564              
    6565              $C$DW$648       .dwtag  DW_TAG_enumerator
    6566                      .dwattr $C$DW$648, DW_AT_name("PWM_Number_4")
    6567                      .dwattr $C$DW$648, DW_AT_const_value(0x03)
    6568              
    6569                      .dwendtag $C$DW$T$235
    6570              
    6571              $C$DW$T$236     .dwtag  DW_TAG_typedef
    6572                      .dwattr $C$DW$T$236, DW_AT_name("PWM_Number_e")
    6573                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$235)
    6574                      .dwattr $C$DW$T$236, DW_AT_language(DW_LANG_C)
    6575              
    6576              
    6577              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6578                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    6579                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    6580              $C$DW$649       .dwtag  DW_TAG_member
    6581                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$24)
    6582                      .dwattr $C$DW$649, DW_AT_name("ADCRESULT")
    6583                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_ADCRESULT")
    6584                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6585                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6586              
    6587              $C$DW$650       .dwtag  DW_TAG_member
    6588                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$25)
    6589                      .dwattr $C$DW$650, DW_AT_name("resvd_1")
    6590                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_resvd_1")
    6591                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6592                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6593              
    6594              $C$DW$651       .dwtag  DW_TAG_member
    6595                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$23)
    6596                      .dwattr $C$DW$651, DW_AT_name("ADCCTL1")
    6597                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_ADCCTL1")
    6598                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6599                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6600              
    6601              $C$DW$652       .dwtag  DW_TAG_member
    6602                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  130

    6603                      .dwattr $C$DW$652, DW_AT_name("ADCCTL2")
    6604                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_ADCCTL2")
    6605                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6606                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6607              
    6608              $C$DW$653       .dwtag  DW_TAG_member
    6609                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$26)
    6610                      .dwattr $C$DW$653, DW_AT_name("rsvd_2")
    6611                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_rsvd_2")
    6612                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6613                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6614              
    6615              $C$DW$654       .dwtag  DW_TAG_member
    6616                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$23)
    6617                      .dwattr $C$DW$654, DW_AT_name("ADCINTFLG")
    6618                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_ADCINTFLG")
    6619                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6620                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6621              
    6622              $C$DW$655       .dwtag  DW_TAG_member
    6623                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$23)
    6624                      .dwattr $C$DW$655, DW_AT_name("ADCINTFLGCLR")
    6625                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6626                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6627                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6628              
    6629              $C$DW$656       .dwtag  DW_TAG_member
    6630                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$23)
    6631                      .dwattr $C$DW$656, DW_AT_name("ADCINTOVF")
    6632                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_ADCINTOVF")
    6633                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6634                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6635              
    6636              $C$DW$657       .dwtag  DW_TAG_member
    6637                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$23)
    6638                      .dwattr $C$DW$657, DW_AT_name("ADCINTOVFCLR")
    6639                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6640                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6641                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6642              
    6643              $C$DW$658       .dwtag  DW_TAG_member
    6644                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$27)
    6645                      .dwattr $C$DW$658, DW_AT_name("INTSELxNy")
    6646                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_INTSELxNy")
    6647                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6648                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6649              
    6650              $C$DW$659       .dwtag  DW_TAG_member
    6651                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$28)
    6652                      .dwattr $C$DW$659, DW_AT_name("rsvd_3")
    6653                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_rsvd_3")
    6654                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6655                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6656              
    6657              $C$DW$660       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  131

    6658                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$23)
    6659                      .dwattr $C$DW$660, DW_AT_name("SOCPRICTRL")
    6660                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6661                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6662                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6663              
    6664              $C$DW$661       .dwtag  DW_TAG_member
    6665                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$23)
    6666                      .dwattr $C$DW$661, DW_AT_name("rsvd_4")
    6667                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_rsvd_4")
    6668                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6669                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6670              
    6671              $C$DW$662       .dwtag  DW_TAG_member
    6672                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$23)
    6673                      .dwattr $C$DW$662, DW_AT_name("ADCSAMPLEMODE")
    6674                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6675                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6676                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6677              
    6678              $C$DW$663       .dwtag  DW_TAG_member
    6679                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$23)
    6680                      .dwattr $C$DW$663, DW_AT_name("rsvd_5")
    6681                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_rsvd_5")
    6682                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6683                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6684              
    6685              $C$DW$664       .dwtag  DW_TAG_member
    6686                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$23)
    6687                      .dwattr $C$DW$664, DW_AT_name("ADCINTSOCSEL1")
    6688                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6689                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6690                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6691              
    6692              $C$DW$665       .dwtag  DW_TAG_member
    6693                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$23)
    6694                      .dwattr $C$DW$665, DW_AT_name("ADCINTSOCSEL2")
    6695                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6696                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6697                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6698              
    6699              $C$DW$666       .dwtag  DW_TAG_member
    6700                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$26)
    6701                      .dwattr $C$DW$666, DW_AT_name("rsvd_6")
    6702                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_rsvd_6")
    6703                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6704                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6705              
    6706              $C$DW$667       .dwtag  DW_TAG_member
    6707                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$23)
    6708                      .dwattr $C$DW$667, DW_AT_name("ADCSOCFLG1")
    6709                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6710                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6711                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6712              
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  132

    6713              $C$DW$668       .dwtag  DW_TAG_member
    6714                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$23)
    6715                      .dwattr $C$DW$668, DW_AT_name("rsvd_7")
    6716                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_rsvd_7")
    6717                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6718                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6719              
    6720              $C$DW$669       .dwtag  DW_TAG_member
    6721                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$23)
    6722                      .dwattr $C$DW$669, DW_AT_name("ADCSOCFRC1")
    6723                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6724                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6725                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6726              
    6727              $C$DW$670       .dwtag  DW_TAG_member
    6728                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$23)
    6729                      .dwattr $C$DW$670, DW_AT_name("rsvd_8")
    6730                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_rsvd_8")
    6731                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6732                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6733              
    6734              $C$DW$671       .dwtag  DW_TAG_member
    6735                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$23)
    6736                      .dwattr $C$DW$671, DW_AT_name("ADCSOCOVF1")
    6737                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6738                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6739                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6740              
    6741              $C$DW$672       .dwtag  DW_TAG_member
    6742                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$23)
    6743                      .dwattr $C$DW$672, DW_AT_name("rsvd_9")
    6744                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_rsvd_9")
    6745                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6746                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6747              
    6748              $C$DW$673       .dwtag  DW_TAG_member
    6749                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$23)
    6750                      .dwattr $C$DW$673, DW_AT_name("ADCSOCOVFCLR1")
    6751                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6752                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6753                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6754              
    6755              $C$DW$674       .dwtag  DW_TAG_member
    6756                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$23)
    6757                      .dwattr $C$DW$674, DW_AT_name("rsvd_10")
    6758                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_rsvd_10")
    6759                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6760                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6761              
    6762              $C$DW$675       .dwtag  DW_TAG_member
    6763                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$24)
    6764                      .dwattr $C$DW$675, DW_AT_name("ADCSOCxCTL")
    6765                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    6766                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6767                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  133

    6768              
    6769              $C$DW$676       .dwtag  DW_TAG_member
    6770                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$24)
    6771                      .dwattr $C$DW$676, DW_AT_name("rsvd_11")
    6772                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_rsvd_11")
    6773                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6774                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6775              
    6776              $C$DW$677       .dwtag  DW_TAG_member
    6777                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$23)
    6778                      .dwattr $C$DW$677, DW_AT_name("ADCREFTRIM")
    6779                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6780                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6781                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6782              
    6783              $C$DW$678       .dwtag  DW_TAG_member
    6784                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$23)
    6785                      .dwattr $C$DW$678, DW_AT_name("ADCOFFTRIM")
    6786                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6787                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6788                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6789              
    6790              $C$DW$679       .dwtag  DW_TAG_member
    6791                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$29)
    6792                      .dwattr $C$DW$679, DW_AT_name("resvd_12")
    6793                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_resvd_12")
    6794                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6795                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6796              
    6797              $C$DW$680       .dwtag  DW_TAG_member
    6798                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$23)
    6799                      .dwattr $C$DW$680, DW_AT_name("ADCREV")
    6800                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_ADCREV")
    6801                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6802                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6803              
    6804                      .dwendtag $C$DW$T$30
    6805              
    6806              $C$DW$T$238     .dwtag  DW_TAG_typedef
    6807                      .dwattr $C$DW$T$238, DW_AT_name("ADC_Obj")
    6808                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$30)
    6809                      .dwattr $C$DW$T$238, DW_AT_language(DW_LANG_C)
    6810              
    6811              $C$DW$T$116     .dwtag  DW_TAG_pointer_type
    6812                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$30)
    6813                      .dwattr $C$DW$T$116, DW_AT_address_class(0x20)
    6814              
    6815              $C$DW$T$117     .dwtag  DW_TAG_typedef
    6816                      .dwattr $C$DW$T$117, DW_AT_name("ADC_Handle")
    6817                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    6818                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    6819              
    6820              
    6821              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6822                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  134

    6823                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    6824              $C$DW$681       .dwtag  DW_TAG_member
    6825                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$31)
    6826                      .dwattr $C$DW$681, DW_AT_name("alpha_sf")
    6827                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_alpha_sf")
    6828                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6829                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6830              
    6831              $C$DW$682       .dwtag  DW_TAG_member
    6832                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$31)
    6833                      .dwattr $C$DW$682, DW_AT_name("beta_sf")
    6834                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_beta_sf")
    6835                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6836                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6837              
    6838              $C$DW$683       .dwtag  DW_TAG_member
    6839                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$32)
    6840                      .dwattr $C$DW$683, DW_AT_name("numSensors")
    6841                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_numSensors")
    6842                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6843                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6844              
    6845                      .dwendtag $C$DW$T$33
    6846              
    6847              $C$DW$T$44      .dwtag  DW_TAG_typedef
    6848                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Obj")
    6849                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    6850                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    6851              
    6852              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    6853                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    6854                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    6855              
    6856              $C$DW$T$43      .dwtag  DW_TAG_typedef
    6857                      .dwattr $C$DW$T$43, DW_AT_name("CLARKE_Handle")
    6858                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    6859                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    6860              
    6861              
    6862              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6863                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    6864                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    6865              $C$DW$684       .dwtag  DW_TAG_member
    6866                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$23)
    6867                      .dwattr $C$DW$684, DW_AT_name("XCLK")
    6868                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_XCLK")
    6869                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6870                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6871              
    6872              $C$DW$685       .dwtag  DW_TAG_member
    6873                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$23)
    6874                      .dwattr $C$DW$685, DW_AT_name("rsvd_1")
    6875                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_rsvd_1")
    6876                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6877                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  135

    6878              
    6879              $C$DW$686       .dwtag  DW_TAG_member
    6880                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$23)
    6881                      .dwattr $C$DW$686, DW_AT_name("CLKCTL")
    6882                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_CLKCTL")
    6883                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6884                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6885              
    6886              $C$DW$687       .dwtag  DW_TAG_member
    6887                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$34)
    6888                      .dwattr $C$DW$687, DW_AT_name("rsvd_2")
    6889                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_rsvd_2")
    6890                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6891                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6892              
    6893              $C$DW$688       .dwtag  DW_TAG_member
    6894                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$23)
    6895                      .dwattr $C$DW$688, DW_AT_name("LOSPCP")
    6896                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_LOSPCP")
    6897                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6898                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6899              
    6900              $C$DW$689       .dwtag  DW_TAG_member
    6901                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$23)
    6902                      .dwattr $C$DW$689, DW_AT_name("PCLKCR0")
    6903                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_PCLKCR0")
    6904                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6905                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6906              
    6907              $C$DW$690       .dwtag  DW_TAG_member
    6908                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$23)
    6909                      .dwattr $C$DW$690, DW_AT_name("PCLKCR1")
    6910                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_PCLKCR1")
    6911                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6912                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6913              
    6914              $C$DW$691       .dwtag  DW_TAG_member
    6915                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$26)
    6916                      .dwattr $C$DW$691, DW_AT_name("rsvd_3")
    6917                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_3")
    6918                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6919                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6920              
    6921              $C$DW$692       .dwtag  DW_TAG_member
    6922                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$23)
    6923                      .dwattr $C$DW$692, DW_AT_name("PCLKCR3")
    6924                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_PCLKCR3")
    6925                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6926                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6927              
    6928                      .dwendtag $C$DW$T$35
    6929              
    6930              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    6931                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$35)
    6932                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  136

    6933              
    6934              $C$DW$T$119     .dwtag  DW_TAG_typedef
    6935                      .dwattr $C$DW$T$119, DW_AT_name("CLK_Handle")
    6936                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    6937                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    6938              
    6939              
    6940              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6941                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    6942                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    6943              $C$DW$693       .dwtag  DW_TAG_member
    6944                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$32)
    6945                      .dwattr $C$DW$693, DW_AT_name("tmp")
    6946                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_tmp")
    6947                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6948                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6949              
    6950                      .dwendtag $C$DW$T$36
    6951              
    6952              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    6953                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$36)
    6954                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    6955              
    6956              $C$DW$T$121     .dwtag  DW_TAG_typedef
    6957                      .dwattr $C$DW$T$121, DW_AT_name("CPU_Handle")
    6958                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    6959                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    6960              
    6961              
    6962              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    6963                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    6964                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    6965              $C$DW$694       .dwtag  DW_TAG_member
    6966                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$37)
    6967                      .dwattr $C$DW$694, DW_AT_name("version")
    6968                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_version")
    6969                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6970                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6971              
    6972              $C$DW$695       .dwtag  DW_TAG_member
    6973                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$39)
    6974                      .dwattr $C$DW$695, DW_AT_name("state")
    6975                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_state")
    6976                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6977                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6978              
    6979              $C$DW$696       .dwtag  DW_TAG_member
    6980                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$39)
    6981                      .dwattr $C$DW$696, DW_AT_name("prevState")
    6982                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_prevState")
    6983                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6984                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6985              
    6986              $C$DW$697       .dwtag  DW_TAG_member
    6987                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$41)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  137

    6988                      .dwattr $C$DW$697, DW_AT_name("errorCode")
    6989                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_errorCode")
    6990                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6991                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6992              
    6993              $C$DW$698       .dwtag  DW_TAG_member
    6994                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$43)
    6995                      .dwattr $C$DW$698, DW_AT_name("clarkeHandle_I")
    6996                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6997                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6998                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6999              
    7000              $C$DW$699       .dwtag  DW_TAG_member
    7001                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$44)
    7002                      .dwattr $C$DW$699, DW_AT_name("clarke_I")
    7003                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_clarke_I")
    7004                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7005                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7006              
    7007              $C$DW$700       .dwtag  DW_TAG_member
    7008                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$43)
    7009                      .dwattr $C$DW$700, DW_AT_name("clarkeHandle_V")
    7010                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_clarkeHandle_V")
    7011                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7012                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7013              
    7014              $C$DW$701       .dwtag  DW_TAG_member
    7015                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$44)
    7016                      .dwattr $C$DW$701, DW_AT_name("clarke_V")
    7017                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_clarke_V")
    7018                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7019                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7020              
    7021              $C$DW$702       .dwtag  DW_TAG_member
    7022                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$46)
    7023                      .dwattr $C$DW$702, DW_AT_name("estHandle")
    7024                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_estHandle")
    7025                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7026                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7027              
    7028              $C$DW$703       .dwtag  DW_TAG_member
    7029                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$48)
    7030                      .dwattr $C$DW$703, DW_AT_name("parkHandle")
    7031                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_parkHandle")
    7032                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7033                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7034              
    7035              $C$DW$704       .dwtag  DW_TAG_member
    7036                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$49)
    7037                      .dwattr $C$DW$704, DW_AT_name("park")
    7038                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_park")
    7039                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7040                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7041              
    7042              $C$DW$705       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  138

    7043                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$51)
    7044                      .dwattr $C$DW$705, DW_AT_name("pidHandle_Id")
    7045                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_pidHandle_Id")
    7046                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7047                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7048              
    7049              $C$DW$706       .dwtag  DW_TAG_member
    7050                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$52)
    7051                      .dwattr $C$DW$706, DW_AT_name("pid_Id")
    7052                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_pid_Id")
    7053                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7054                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7055              
    7056              $C$DW$707       .dwtag  DW_TAG_member
    7057                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$51)
    7058                      .dwattr $C$DW$707, DW_AT_name("pidHandle_Iq")
    7059                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_pidHandle_Iq")
    7060                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7061                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7062              
    7063              $C$DW$708       .dwtag  DW_TAG_member
    7064                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$52)
    7065                      .dwattr $C$DW$708, DW_AT_name("pid_Iq")
    7066                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_pid_Iq")
    7067                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7068                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7069              
    7070              $C$DW$709       .dwtag  DW_TAG_member
    7071                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$51)
    7072                      .dwattr $C$DW$709, DW_AT_name("pidHandle_spd")
    7073                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_pidHandle_spd")
    7074                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7075                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7076              
    7077              $C$DW$710       .dwtag  DW_TAG_member
    7078                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$52)
    7079                      .dwattr $C$DW$710, DW_AT_name("pid_spd")
    7080                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_pid_spd")
    7081                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7082                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7083              
    7084              $C$DW$711       .dwtag  DW_TAG_member
    7085                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$54)
    7086                      .dwattr $C$DW$711, DW_AT_name("iparkHandle")
    7087                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_iparkHandle")
    7088                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    7089                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7090              
    7091              $C$DW$712       .dwtag  DW_TAG_member
    7092                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$55)
    7093                      .dwattr $C$DW$712, DW_AT_name("ipark")
    7094                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_ipark")
    7095                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7096                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7097              
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  139

    7098              $C$DW$713       .dwtag  DW_TAG_member
    7099                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$57)
    7100                      .dwattr $C$DW$713, DW_AT_name("svgenHandle")
    7101                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_svgenHandle")
    7102                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7103                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7104              
    7105              $C$DW$714       .dwtag  DW_TAG_member
    7106                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$58)
    7107                      .dwattr $C$DW$714, DW_AT_name("svgen")
    7108                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_svgen")
    7109                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7110                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7111              
    7112              $C$DW$715       .dwtag  DW_TAG_member
    7113                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$60)
    7114                      .dwattr $C$DW$715, DW_AT_name("trajHandle_Id")
    7115                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_trajHandle_Id")
    7116                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7117                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7118              
    7119              $C$DW$716       .dwtag  DW_TAG_member
    7120                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$61)
    7121                      .dwattr $C$DW$716, DW_AT_name("traj_Id")
    7122                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_traj_Id")
    7123                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7124                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7125              
    7126              $C$DW$717       .dwtag  DW_TAG_member
    7127                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$60)
    7128                      .dwattr $C$DW$717, DW_AT_name("trajHandle_spd")
    7129                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_trajHandle_spd")
    7130                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7131                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7132              
    7133              $C$DW$718       .dwtag  DW_TAG_member
    7134                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$61)
    7135                      .dwattr $C$DW$718, DW_AT_name("traj_spd")
    7136                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_traj_spd")
    7137                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7138                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7139              
    7140              $C$DW$719       .dwtag  DW_TAG_member
    7141                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$60)
    7142                      .dwattr $C$DW$719, DW_AT_name("trajHandle_spdMax")
    7143                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7144                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7145                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7146              
    7147              $C$DW$720       .dwtag  DW_TAG_member
    7148                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$61)
    7149                      .dwattr $C$DW$720, DW_AT_name("traj_spdMax")
    7150                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_traj_spdMax")
    7151                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7152                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  140

    7153              
    7154              $C$DW$721       .dwtag  DW_TAG_member
    7155                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$62)
    7156                      .dwattr $C$DW$721, DW_AT_name("motorParams")
    7157                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_motorParams")
    7158                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7159                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7160              
    7161              $C$DW$722       .dwtag  DW_TAG_member
    7162                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$65)
    7163                      .dwattr $C$DW$722, DW_AT_name("waitTimes")
    7164                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_waitTimes")
    7165                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7166                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7167              
    7168              $C$DW$723       .dwtag  DW_TAG_member
    7169                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$64)
    7170                      .dwattr $C$DW$723, DW_AT_name("counter_state")
    7171                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_counter_state")
    7172                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7173                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7174              
    7175              $C$DW$724       .dwtag  DW_TAG_member
    7176                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$66)
    7177                      .dwattr $C$DW$724, DW_AT_name("numIsrTicksPerCtrlTick")
    7178                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7179                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7180                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7181              
    7182              $C$DW$725       .dwtag  DW_TAG_member
    7183                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$66)
    7184                      .dwattr $C$DW$725, DW_AT_name("numCtrlTicksPerCurrentTick")
    7185                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7186                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7187                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7188              
    7189              $C$DW$726       .dwtag  DW_TAG_member
    7190                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$66)
    7191                      .dwattr $C$DW$726, DW_AT_name("numCtrlTicksPerSpeedTick")
    7192                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7193                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7194                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7195              
    7196              $C$DW$727       .dwtag  DW_TAG_member
    7197                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$66)
    7198                      .dwattr $C$DW$727, DW_AT_name("numCtrlTicksPerTrajTick")
    7199                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7200                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7201                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7202              
    7203              $C$DW$728       .dwtag  DW_TAG_member
    7204                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$64)
    7205                      .dwattr $C$DW$728, DW_AT_name("ctrlFreq_Hz")
    7206                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7207                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  141

    7208                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7209              
    7210              $C$DW$729       .dwtag  DW_TAG_member
    7211                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$64)
    7212                      .dwattr $C$DW$729, DW_AT_name("trajFreq_Hz")
    7213                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7214                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7215                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7216              
    7217              $C$DW$730       .dwtag  DW_TAG_member
    7218                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$31)
    7219                      .dwattr $C$DW$730, DW_AT_name("trajPeriod_sec")
    7220                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_trajPeriod_sec")
    7221                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7222                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7223              
    7224              $C$DW$731       .dwtag  DW_TAG_member
    7225                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$67)
    7226                      .dwattr $C$DW$731, DW_AT_name("ctrlPeriod_sec")
    7227                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7228                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7229                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7230              
    7231              $C$DW$732       .dwtag  DW_TAG_member
    7232                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$31)
    7233                      .dwattr $C$DW$732, DW_AT_name("maxVsMag_pu")
    7234                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7235                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7236                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7237              
    7238              $C$DW$733       .dwtag  DW_TAG_member
    7239                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$68)
    7240                      .dwattr $C$DW$733, DW_AT_name("Iab_in")
    7241                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_Iab_in")
    7242                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7243                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7244              
    7245              $C$DW$734       .dwtag  DW_TAG_member
    7246                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$68)
    7247                      .dwattr $C$DW$734, DW_AT_name("Iab_filt")
    7248                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_Iab_filt")
    7249                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7250                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7251              
    7252              $C$DW$735       .dwtag  DW_TAG_member
    7253                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$68)
    7254                      .dwattr $C$DW$735, DW_AT_name("Idq_in")
    7255                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_Idq_in")
    7256                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7257                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7258              
    7259              $C$DW$736       .dwtag  DW_TAG_member
    7260                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$68)
    7261                      .dwattr $C$DW$736, DW_AT_name("Vab_in")
    7262                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_Vab_in")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  142

    7263                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7264                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7265              
    7266              $C$DW$737       .dwtag  DW_TAG_member
    7267                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$31)
    7268                      .dwattr $C$DW$737, DW_AT_name("spd_out")
    7269                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_spd_out")
    7270                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7271                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7272              
    7273              $C$DW$738       .dwtag  DW_TAG_member
    7274                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$68)
    7275                      .dwattr $C$DW$738, DW_AT_name("Vab_out")
    7276                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_Vab_out")
    7277                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7278                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7279              
    7280              $C$DW$739       .dwtag  DW_TAG_member
    7281                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$68)
    7282                      .dwattr $C$DW$739, DW_AT_name("Vdq_out")
    7283                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_Vdq_out")
    7284                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7285                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7286              
    7287              $C$DW$740       .dwtag  DW_TAG_member
    7288                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$67)
    7289                      .dwattr $C$DW$740, DW_AT_name("Rhf")
    7290                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_Rhf")
    7291                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7292                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7293              
    7294              $C$DW$741       .dwtag  DW_TAG_member
    7295                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$67)
    7296                      .dwattr $C$DW$741, DW_AT_name("Lhf")
    7297                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_Lhf")
    7298                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7299                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7300              
    7301              $C$DW$742       .dwtag  DW_TAG_member
    7302                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$67)
    7303                      .dwattr $C$DW$742, DW_AT_name("RoverL")
    7304                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_RoverL")
    7305                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7306                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7307              
    7308              $C$DW$743       .dwtag  DW_TAG_member
    7309                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$31)
    7310                      .dwattr $C$DW$743, DW_AT_name("Kp_Id")
    7311                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_Kp_Id")
    7312                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7313                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7314              
    7315              $C$DW$744       .dwtag  DW_TAG_member
    7316                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$31)
    7317                      .dwattr $C$DW$744, DW_AT_name("Kp_Iq")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  143

    7318                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_Kp_Iq")
    7319                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7320                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7321              
    7322              $C$DW$745       .dwtag  DW_TAG_member
    7323                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$31)
    7324                      .dwattr $C$DW$745, DW_AT_name("Kp_spd")
    7325                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_Kp_spd")
    7326                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7327                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7328              
    7329              $C$DW$746       .dwtag  DW_TAG_member
    7330                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$31)
    7331                      .dwattr $C$DW$746, DW_AT_name("Ki_Id")
    7332                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_Ki_Id")
    7333                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7334                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7335              
    7336              $C$DW$747       .dwtag  DW_TAG_member
    7337                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$31)
    7338                      .dwattr $C$DW$747, DW_AT_name("Ki_Iq")
    7339                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_Ki_Iq")
    7340                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7341                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7342              
    7343              $C$DW$748       .dwtag  DW_TAG_member
    7344                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$31)
    7345                      .dwattr $C$DW$748, DW_AT_name("Ki_spd")
    7346                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_Ki_spd")
    7347                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7348                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7349              
    7350              $C$DW$749       .dwtag  DW_TAG_member
    7351                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$31)
    7352                      .dwattr $C$DW$749, DW_AT_name("Kd_Id")
    7353                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_Kd_Id")
    7354                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7355                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7356              
    7357              $C$DW$750       .dwtag  DW_TAG_member
    7358                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$31)
    7359                      .dwattr $C$DW$750, DW_AT_name("Kd_Iq")
    7360                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_Kd_Iq")
    7361                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7362                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7363              
    7364              $C$DW$751       .dwtag  DW_TAG_member
    7365                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$31)
    7366                      .dwattr $C$DW$751, DW_AT_name("Kd_spd")
    7367                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_Kd_spd")
    7368                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7369                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7370              
    7371              $C$DW$752       .dwtag  DW_TAG_member
    7372                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  144

    7373                      .dwattr $C$DW$752, DW_AT_name("Ui_Id")
    7374                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_Ui_Id")
    7375                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7376                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7377              
    7378              $C$DW$753       .dwtag  DW_TAG_member
    7379                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$31)
    7380                      .dwattr $C$DW$753, DW_AT_name("Ui_Iq")
    7381                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_Ui_Iq")
    7382                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7383                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7384              
    7385              $C$DW$754       .dwtag  DW_TAG_member
    7386                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$31)
    7387                      .dwattr $C$DW$754, DW_AT_name("Ui_spd")
    7388                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_Ui_spd")
    7389                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7390                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7391              
    7392              $C$DW$755       .dwtag  DW_TAG_member
    7393                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$68)
    7394                      .dwattr $C$DW$755, DW_AT_name("Idq_ref")
    7395                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_Idq_ref")
    7396                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7397                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7398              
    7399              $C$DW$756       .dwtag  DW_TAG_member
    7400                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$31)
    7401                      .dwattr $C$DW$756, DW_AT_name("IdRated")
    7402                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_IdRated")
    7403                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7404                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7405              
    7406              $C$DW$757       .dwtag  DW_TAG_member
    7407                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$31)
    7408                      .dwattr $C$DW$757, DW_AT_name("spd_ref")
    7409                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_spd_ref")
    7410                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7411                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7412              
    7413              $C$DW$758       .dwtag  DW_TAG_member
    7414                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$31)
    7415                      .dwattr $C$DW$758, DW_AT_name("spd_max")
    7416                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_spd_max")
    7417                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7418                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7419              
    7420              $C$DW$759       .dwtag  DW_TAG_member
    7421                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$66)
    7422                      .dwattr $C$DW$759, DW_AT_name("counter_current")
    7423                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_counter_current")
    7424                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7425                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7426              
    7427              $C$DW$760       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  145

    7428                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$66)
    7429                      .dwattr $C$DW$760, DW_AT_name("counter_isr")
    7430                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_counter_isr")
    7431                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7432                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7433              
    7434              $C$DW$761       .dwtag  DW_TAG_member
    7435                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$66)
    7436                      .dwattr $C$DW$761, DW_AT_name("counter_speed")
    7437                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_counter_speed")
    7438                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7439                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7440              
    7441              $C$DW$762       .dwtag  DW_TAG_member
    7442                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$66)
    7443                      .dwattr $C$DW$762, DW_AT_name("counter_traj")
    7444                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_counter_traj")
    7445                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7446                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7447              
    7448              $C$DW$763       .dwtag  DW_TAG_member
    7449                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$69)
    7450                      .dwattr $C$DW$763, DW_AT_name("flag_enableCtrl")
    7451                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7452                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7453                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7454              
    7455              $C$DW$764       .dwtag  DW_TAG_member
    7456                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$69)
    7457                      .dwattr $C$DW$764, DW_AT_name("flag_enableDcBusComp")
    7458                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7459                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7460                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7461              
    7462              $C$DW$765       .dwtag  DW_TAG_member
    7463                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$69)
    7464                      .dwattr $C$DW$765, DW_AT_name("flag_enablePowerWarp")
    7465                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7466                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7467                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7468              
    7469              $C$DW$766       .dwtag  DW_TAG_member
    7470                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$69)
    7471                      .dwattr $C$DW$766, DW_AT_name("flag_enableOffset")
    7472                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_flag_enableOffset")
    7473                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7474                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7475              
    7476              $C$DW$767       .dwtag  DW_TAG_member
    7477                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$69)
    7478                      .dwattr $C$DW$767, DW_AT_name("flag_enableSpeedCtrl")
    7479                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7480                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7481                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7482              
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  146

    7483              $C$DW$768       .dwtag  DW_TAG_member
    7484                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$69)
    7485                      .dwattr $C$DW$768, DW_AT_name("flag_enableUserMotorParams")
    7486                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7487                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7488                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7489              
    7490              $C$DW$769       .dwtag  DW_TAG_member
    7491                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$68)
    7492                      .dwattr $C$DW$769, DW_AT_name("Idq_offset_pu")
    7493                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7494                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7495                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7496              
    7497              $C$DW$770       .dwtag  DW_TAG_member
    7498                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$68)
    7499                      .dwattr $C$DW$770, DW_AT_name("Vdq_offset_pu")
    7500                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7501                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7502                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7503              
    7504              $C$DW$771       .dwtag  DW_TAG_member
    7505                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$31)
    7506                      .dwattr $C$DW$771, DW_AT_name("angle_pu")
    7507                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_angle_pu")
    7508                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7509                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7510              
    7511              $C$DW$772       .dwtag  DW_TAG_member
    7512                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$31)
    7513                      .dwattr $C$DW$772, DW_AT_name("speed_ref_pu")
    7514                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_speed_ref_pu")
    7515                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7516                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7517              
    7518              $C$DW$773       .dwtag  DW_TAG_member
    7519                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$31)
    7520                      .dwattr $C$DW$773, DW_AT_name("speed_fb_pu")
    7521                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_speed_fb_pu")
    7522                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7523                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7524              
    7525              $C$DW$774       .dwtag  DW_TAG_member
    7526                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$31)
    7527                      .dwattr $C$DW$774, DW_AT_name("speed_outMax_pu")
    7528                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7529                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7530                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7531              
    7532              $C$DW$775       .dwtag  DW_TAG_member
    7533                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$69)
    7534                      .dwattr $C$DW$775, DW_AT_name("flag_enableCurrentCtrl")
    7535                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7536                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7537                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  147

    7538              
    7539                      .dwendtag $C$DW$T$70
    7540              
    7541              $C$DW$T$239     .dwtag  DW_TAG_typedef
    7542                      .dwattr $C$DW$T$239, DW_AT_name("CTRL_Obj")
    7543                      .dwattr $C$DW$T$239, DW_AT_type(*$C$DW$T$70)
    7544                      .dwattr $C$DW$T$239, DW_AT_language(DW_LANG_C)
    7545              
    7546              $C$DW$T$240     .dwtag  DW_TAG_pointer_type
    7547                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$239)
    7548                      .dwattr $C$DW$T$240, DW_AT_address_class(0x20)
    7549              
    7550              $C$DW$T$201     .dwtag  DW_TAG_pointer_type
    7551                      .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$70)
    7552                      .dwattr $C$DW$T$201, DW_AT_address_class(0x20)
    7553              
    7554              $C$DW$T$202     .dwtag  DW_TAG_typedef
    7555                      .dwattr $C$DW$T$202, DW_AT_name("CTRL_Handle")
    7556                      .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$201)
    7557                      .dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
    7558              
    7559              $C$DW$776       .dwtag  DW_TAG_TI_far_type
    7560                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$202)
    7561              
    7562              $C$DW$T$241     .dwtag  DW_TAG_const_type
    7563                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$776)
    7564              
    7565              
    7566              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    7567                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    7568                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    7569              $C$DW$777       .dwtag  DW_TAG_member
    7570                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$22)
    7571                      .dwattr $C$DW$777, DW_AT_name("rsvd")
    7572                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_rsvd")
    7573                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7574                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7575              
    7576              $C$DW$778       .dwtag  DW_TAG_member
    7577                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$72)
    7578                      .dwattr $C$DW$778, DW_AT_name("targetProc")
    7579                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_targetProc")
    7580                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7581                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7582              
    7583              $C$DW$779       .dwtag  DW_TAG_member
    7584                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$22)
    7585                      .dwattr $C$DW$779, DW_AT_name("major")
    7586                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_major")
    7587                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7588                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7589              
    7590              $C$DW$780       .dwtag  DW_TAG_member
    7591                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$22)
    7592                      .dwattr $C$DW$780, DW_AT_name("minor")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  148

    7593                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_minor")
    7594                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7595                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7596              
    7597                      .dwendtag $C$DW$T$73
    7598              
    7599              $C$DW$T$37      .dwtag  DW_TAG_typedef
    7600                      .dwattr $C$DW$T$37, DW_AT_name("CTRL_Version")
    7601                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    7602                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    7603              
    7604              $C$DW$T$249     .dwtag  DW_TAG_pointer_type
    7605                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$37)
    7606                      .dwattr $C$DW$T$249, DW_AT_address_class(0x20)
    7607              
    7608              
    7609              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    7610                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8301_Obj_")
    7611                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    7612              $C$DW$781       .dwtag  DW_TAG_member
    7613                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$75)
    7614                      .dwattr $C$DW$781, DW_AT_name("spiHandle")
    7615                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_spiHandle")
    7616                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7617                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7618              
    7619              $C$DW$782       .dwtag  DW_TAG_member
    7620                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$77)
    7621                      .dwattr $C$DW$782, DW_AT_name("gpioHandle")
    7622                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_gpioHandle")
    7623                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7624                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7625              
    7626              $C$DW$783       .dwtag  DW_TAG_member
    7627                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$79)
    7628                      .dwattr $C$DW$783, DW_AT_name("gpioNumber")
    7629                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_gpioNumber")
    7630                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7631                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7632              
    7633              $C$DW$784       .dwtag  DW_TAG_member
    7634                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$69)
    7635                      .dwattr $C$DW$784, DW_AT_name("RxTimeOut")
    7636                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_RxTimeOut")
    7637                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7638                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7639              
    7640              $C$DW$785       .dwtag  DW_TAG_member
    7641                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$69)
    7642                      .dwattr $C$DW$785, DW_AT_name("enableTimeOut")
    7643                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_enableTimeOut")
    7644                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7645                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7646              
    7647                      .dwendtag $C$DW$T$80
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  149

    7648              
    7649              $C$DW$T$149     .dwtag  DW_TAG_typedef
    7650                      .dwattr $C$DW$T$149, DW_AT_name("DRV8301_Obj")
    7651                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$80)
    7652                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    7653              
    7654              $C$DW$T$147     .dwtag  DW_TAG_pointer_type
    7655                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$80)
    7656                      .dwattr $C$DW$T$147, DW_AT_address_class(0x20)
    7657              
    7658              $C$DW$T$148     .dwtag  DW_TAG_typedef
    7659                      .dwattr $C$DW$T$148, DW_AT_name("DRV8301_Handle")
    7660                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$147)
    7661                      .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
    7662              
    7663              
    7664              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    7665                      .dwattr $C$DW$T$91, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    7666                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x05)
    7667              $C$DW$786       .dwtag  DW_TAG_member
    7668                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$82)
    7669                      .dwattr $C$DW$786, DW_AT_name("DRV8301_CURRENT")
    7670                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    7671                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7672                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7673              
    7674              $C$DW$787       .dwtag  DW_TAG_member
    7675                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$84)
    7676                      .dwattr $C$DW$787, DW_AT_name("DRV8301_RESET")
    7677                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_DRV8301_RESET")
    7678                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7679                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7680              
    7681              $C$DW$788       .dwtag  DW_TAG_member
    7682                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$86)
    7683                      .dwattr $C$DW$788, DW_AT_name("PWM_MODE")
    7684                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_PWM_MODE")
    7685                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7686                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7687              
    7688              $C$DW$789       .dwtag  DW_TAG_member
    7689                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$88)
    7690                      .dwattr $C$DW$789, DW_AT_name("OC_MODE")
    7691                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_OC_MODE")
    7692                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7693                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7694              
    7695              $C$DW$790       .dwtag  DW_TAG_member
    7696                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$90)
    7697                      .dwattr $C$DW$790, DW_AT_name("OC_ADJ_SET")
    7698                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    7699                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7700                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7701              
    7702                      .dwendtag $C$DW$T$91
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  150

    7703              
    7704              $C$DW$T$105     .dwtag  DW_TAG_typedef
    7705                      .dwattr $C$DW$T$105, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    7706                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$91)
    7707                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    7708              
    7709              
    7710              $C$DW$T$100     .dwtag  DW_TAG_structure_type
    7711                      .dwattr $C$DW$T$100, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    7712                      .dwattr $C$DW$T$100, DW_AT_byte_size(0x04)
    7713              $C$DW$791       .dwtag  DW_TAG_member
    7714                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$93)
    7715                      .dwattr $C$DW$791, DW_AT_name("OCTW_SET")
    7716                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_OCTW_SET")
    7717                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7718                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7719              
    7720              $C$DW$792       .dwtag  DW_TAG_member
    7721                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$95)
    7722                      .dwattr $C$DW$792, DW_AT_name("GAIN")
    7723                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_GAIN")
    7724                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7725                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7726              
    7727              $C$DW$793       .dwtag  DW_TAG_member
    7728                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$97)
    7729                      .dwattr $C$DW$793, DW_AT_name("DC_CAL_CH1p2")
    7730                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    7731                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7732                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7733              
    7734              $C$DW$794       .dwtag  DW_TAG_member
    7735                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$99)
    7736                      .dwattr $C$DW$794, DW_AT_name("OC_TOFF")
    7737                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_OC_TOFF")
    7738                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7739                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7740              
    7741                      .dwendtag $C$DW$T$100
    7742              
    7743              $C$DW$T$106     .dwtag  DW_TAG_typedef
    7744                      .dwattr $C$DW$T$106, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    7745                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$100)
    7746                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    7747              
    7748              
    7749              $C$DW$T$101     .dwtag  DW_TAG_structure_type
    7750                      .dwattr $C$DW$T$101, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    7751                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x0b)
    7752              $C$DW$795       .dwtag  DW_TAG_member
    7753                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$69)
    7754                      .dwattr $C$DW$795, DW_AT_name("FAULT")
    7755                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_FAULT")
    7756                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7757                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  151

    7758              
    7759              $C$DW$796       .dwtag  DW_TAG_member
    7760                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$69)
    7761                      .dwattr $C$DW$796, DW_AT_name("GVDD_UV")
    7762                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_GVDD_UV")
    7763                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7764                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7765              
    7766              $C$DW$797       .dwtag  DW_TAG_member
    7767                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$69)
    7768                      .dwattr $C$DW$797, DW_AT_name("PVDD_UV")
    7769                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_PVDD_UV")
    7770                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7771                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7772              
    7773              $C$DW$798       .dwtag  DW_TAG_member
    7774                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$69)
    7775                      .dwattr $C$DW$798, DW_AT_name("OTSD")
    7776                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_OTSD")
    7777                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7778                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7779              
    7780              $C$DW$799       .dwtag  DW_TAG_member
    7781                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$69)
    7782                      .dwattr $C$DW$799, DW_AT_name("OTW")
    7783                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_OTW")
    7784                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7785                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7786              
    7787              $C$DW$800       .dwtag  DW_TAG_member
    7788                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$69)
    7789                      .dwattr $C$DW$800, DW_AT_name("FETHA_OC")
    7790                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_FETHA_OC")
    7791                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7792                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7793              
    7794              $C$DW$801       .dwtag  DW_TAG_member
    7795                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$69)
    7796                      .dwattr $C$DW$801, DW_AT_name("FETLA_OC")
    7797                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_FETLA_OC")
    7798                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7799                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7800              
    7801              $C$DW$802       .dwtag  DW_TAG_member
    7802                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$69)
    7803                      .dwattr $C$DW$802, DW_AT_name("FETHB_OC")
    7804                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_FETHB_OC")
    7805                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7806                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7807              
    7808              $C$DW$803       .dwtag  DW_TAG_member
    7809                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$69)
    7810                      .dwattr $C$DW$803, DW_AT_name("FETLB_OC")
    7811                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_FETLB_OC")
    7812                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 13:47:57 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\0674410                         PAGE  152

    7813                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7814              
    7815              $C$DW$804       .dwtag  DW_TAG_member
    7816                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$69)
    7817                      .dwattr $C$DW$804, DW_AT_name("FETHC_OC")
    7818                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_FETHC_OC")
    7819                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7820                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7821              
    7822              $C$DW$805       .dwtag  DW_TAG_member
    7823                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$69)
    7824                      .dwattr $C$DW$805, DW_AT_name("FETLC_OC")
    7825                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_FETLC_OC")
    7826                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7827                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7828              
    7829                      .dwendtag $C$DW$T$101
    7830              
    7831              $C$DW$T$103     .dwtag  DW_TAG_typedef
    7832                      .dwattr $C$DW$T$103, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    7833                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$101)
    7834                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    7835              
    7836              
    7837              $C$DW$T$102     .dwtag  DW_TAG_structure_type
    7838                      .dwattr $C$DW$T$102, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    7839                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x02)
    7840              $C$DW$806       .dwtag  DW_TAG_member
    7841                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$69)
    7842                      .dwattr $C$DW$806, DW_AT_name("GVDD_OV")
