TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Thu Mar 02 12:12:46 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\guilherme\workspace_v6_2\proj_ITS\Flash")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("EST_setLs_d_pu")

    3444                      .dwattr $C$DW$338, DW_AT_const_value(0x5f)
    3445              
    3446              $C$DW$339       .dwtag  DW_TAG_enumerator
    3447                      .dwattr $C$DW$339, DW_AT_name("USER_ErrorCode_estFreq_Hz_High")
    3448                      .dwattr $C$DW$339, DW_AT_const_value(0x60)
    3449              
    3450              $C$DW$340       .dwtag  DW_TAG_enumerator
    3451                      .dwattr $C$DW$340, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low")
    3452                      .dwattr $C$DW$340, DW_AT_const_value(0x61)
    3453              
    3454              $C$DW$341       .dwtag  DW_TAG_enumerator
    3455                      .dwattr $C$DW$341, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High")
    3456                      .dwattr $C$DW$341, DW_AT_const_value(0x62)
    3457              
    3458              $C$DW$342       .dwtag  DW_TAG_enumerator
    3459                      .dwattr $C$DW$342, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low")
    3460                      .dwattr $C$DW$342, DW_AT_const_value(0x63)
    3461              
    3462              $C$DW$343       .dwtag  DW_TAG_enumerator
    3463                      .dwattr $C$DW$343, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High")
    3464                      .dwattr $C$DW$343, DW_AT_const_value(0x64)
    3465              
    3466              $C$DW$344       .dwtag  DW_TAG_enumerator
    3467                      .dwattr $C$DW$344, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low")
    3468                      .dwattr $C$DW$344, DW_AT_const_value(0x65)
    3469              
    3470              $C$DW$345       .dwtag  DW_TAG_enumerator
    3471                      .dwattr $C$DW$345, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High")
    3472                      .dwattr $C$DW$345, DW_AT_const_value(0x66)
    3473              
    3474              $C$DW$346       .dwtag  DW_TAG_enumerator
    3475                      .dwattr $C$DW$346, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low")
    3476                      .dwattr $C$DW$346, DW_AT_const_value(0x67)
    3477              
    3478              $C$DW$347       .dwtag  DW_TAG_enumerator
    3479                      .dwattr $C$DW$347, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High")
    3480                      .dwattr $C$DW$347, DW_AT_const_value(0x68)
    3481              
    3482              $C$DW$348       .dwtag  DW_TAG_enumerator
    3483                      .dwattr $C$DW$348, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low")
    3484                      .dwattr $C$DW$348, DW_AT_const_value(0x69)
    3485              
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   69

    3486              $C$DW$349       .dwtag  DW_TAG_enumerator
    3487                      .dwattr $C$DW$349, DW_AT_name("USER_numErrorCodes")
    3488                      .dwattr $C$DW$349, DW_AT_const_value(0x6a)
    3489              
    3490                      .dwendtag $C$DW$T$74
    3491              
    3492              $C$DW$T$75      .dwtag  DW_TAG_typedef
    3493                      .dwattr $C$DW$T$75, DW_AT_name("USER_ErrorCode_e")
    3494                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3495                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3496              
    3497              $C$DW$350       .dwtag  DW_TAG_TI_far_type
    3498                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$75)
    3499              
    3500              $C$DW$T$77      .dwtag  DW_TAG_const_type
    3501                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$350)
    3502              
    3503              
    3504              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    3505                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    3506              $C$DW$351       .dwtag  DW_TAG_enumerator
    3507                      .dwattr $C$DW$351, DW_AT_name("CTRL_Type_PID_spd")
    3508                      .dwattr $C$DW$351, DW_AT_const_value(0x00)
    3509              
    3510              $C$DW$352       .dwtag  DW_TAG_enumerator
    3511                      .dwattr $C$DW$352, DW_AT_name("CTRL_Type_PID_Id")
    3512                      .dwattr $C$DW$352, DW_AT_const_value(0x01)
    3513              
    3514              $C$DW$353       .dwtag  DW_TAG_enumerator
    3515                      .dwattr $C$DW$353, DW_AT_name("CTRL_Type_PID_Iq")
    3516                      .dwattr $C$DW$353, DW_AT_const_value(0x02)
    3517              
    3518                      .dwendtag $C$DW$T$82
    3519              
    3520              $C$DW$T$83      .dwtag  DW_TAG_typedef
    3521                      .dwattr $C$DW$T$83, DW_AT_name("CTRL_Type_e")
    3522                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3523                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3524              
    3525              $C$DW$354       .dwtag  DW_TAG_TI_far_type
    3526                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$83)
    3527              
    3528              $C$DW$T$84      .dwtag  DW_TAG_const_type
    3529                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$354)
    3530              
    3531              
    3532              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3533                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    3534                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    3535              $C$DW$355       .dwtag  DW_TAG_member
    3536                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$20)
    3537                      .dwattr $C$DW$355, DW_AT_name("alpha_sf")
    3538                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_alpha_sf")
    3539                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3540                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   70

    3541              
    3542              $C$DW$356       .dwtag  DW_TAG_member
    3543                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    3544                      .dwattr $C$DW$356, DW_AT_name("beta_sf")
    3545                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_beta_sf")
    3546                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3547                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3548              
    3549              $C$DW$357       .dwtag  DW_TAG_member
    3550                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$22)
    3551                      .dwattr $C$DW$357, DW_AT_name("numSensors")
    3552                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_numSensors")
    3553                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3554                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3555              
    3556                      .dwendtag $C$DW$T$23
    3557              
    3558              $C$DW$T$31      .dwtag  DW_TAG_typedef
    3559                      .dwattr $C$DW$T$31, DW_AT_name("CLARKE_Obj")
    3560                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    3561                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3562              
    3563              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3564                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    3565                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3566              
    3567              $C$DW$T$30      .dwtag  DW_TAG_typedef
    3568                      .dwattr $C$DW$T$30, DW_AT_name("CLARKE_Handle")
    3569                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3570                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3571              
    3572              
    3573              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3574                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    3575                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    3576              $C$DW$358       .dwtag  DW_TAG_member
    3577                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$24)
    3578                      .dwattr $C$DW$358, DW_AT_name("version")
    3579                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_version")
    3580                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3581                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3582              
    3583              $C$DW$359       .dwtag  DW_TAG_member
    3584                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$26)
    3585                      .dwattr $C$DW$359, DW_AT_name("state")
    3586                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_state")
    3587                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3588                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3589              
    3590              $C$DW$360       .dwtag  DW_TAG_member
    3591                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$26)
    3592                      .dwattr $C$DW$360, DW_AT_name("prevState")
    3593                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_prevState")
    3594                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3595                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   71

    3596              
    3597              $C$DW$361       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$28)
    3599                      .dwattr $C$DW$361, DW_AT_name("errorCode")
    3600                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_errorCode")
    3601                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3602                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3603              
    3604              $C$DW$362       .dwtag  DW_TAG_member
    3605                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$30)
    3606                      .dwattr $C$DW$362, DW_AT_name("clarkeHandle_I")
    3607                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3608                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3609                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3610              
    3611              $C$DW$363       .dwtag  DW_TAG_member
    3612                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$31)
    3613                      .dwattr $C$DW$363, DW_AT_name("clarke_I")
    3614                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_clarke_I")
    3615                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3616                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3617              
    3618              $C$DW$364       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$30)
    3620                      .dwattr $C$DW$364, DW_AT_name("clarkeHandle_V")
    3621                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3622                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3623                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3624              
    3625              $C$DW$365       .dwtag  DW_TAG_member
    3626                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$31)
    3627                      .dwattr $C$DW$365, DW_AT_name("clarke_V")
    3628                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_clarke_V")
    3629                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3630                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3631              
    3632              $C$DW$366       .dwtag  DW_TAG_member
    3633                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$33)
    3634                      .dwattr $C$DW$366, DW_AT_name("estHandle")
    3635                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_estHandle")
    3636                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3637                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3638              
    3639              $C$DW$367       .dwtag  DW_TAG_member
    3640                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$35)
    3641                      .dwattr $C$DW$367, DW_AT_name("parkHandle")
    3642                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_parkHandle")
    3643                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3644                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3645              
    3646              $C$DW$368       .dwtag  DW_TAG_member
    3647                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$36)
    3648                      .dwattr $C$DW$368, DW_AT_name("park")
    3649                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_park")
    3650                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   72

    3651                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3652              
    3653              $C$DW$369       .dwtag  DW_TAG_member
    3654                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$38)
    3655                      .dwattr $C$DW$369, DW_AT_name("pidHandle_Id")
    3656                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_pidHandle_Id")
    3657                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3658                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3659              
    3660              $C$DW$370       .dwtag  DW_TAG_member
    3661                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$39)
    3662                      .dwattr $C$DW$370, DW_AT_name("pid_Id")
    3663                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_pid_Id")
    3664                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3665                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3666              
    3667              $C$DW$371       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$38)
    3669                      .dwattr $C$DW$371, DW_AT_name("pidHandle_Iq")
    3670                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3671                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3672                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3673              
    3674              $C$DW$372       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$39)
    3676                      .dwattr $C$DW$372, DW_AT_name("pid_Iq")
    3677                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_pid_Iq")
    3678                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3679                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3680              
    3681              $C$DW$373       .dwtag  DW_TAG_member
    3682                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$38)
    3683                      .dwattr $C$DW$373, DW_AT_name("pidHandle_spd")
    3684                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_pidHandle_spd")
    3685                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3686                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3687              
    3688              $C$DW$374       .dwtag  DW_TAG_member
    3689                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$39)
    3690                      .dwattr $C$DW$374, DW_AT_name("pid_spd")
    3691                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_pid_spd")
    3692                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3693                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3694              
    3695              $C$DW$375       .dwtag  DW_TAG_member
    3696                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$41)
    3697                      .dwattr $C$DW$375, DW_AT_name("iparkHandle")
    3698                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_iparkHandle")
    3699                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3700                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3701              
    3702              $C$DW$376       .dwtag  DW_TAG_member
    3703                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$42)
    3704                      .dwattr $C$DW$376, DW_AT_name("ipark")
    3705                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_ipark")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   73

    3706                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3707                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3708              
    3709              $C$DW$377       .dwtag  DW_TAG_member
    3710                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$44)
    3711                      .dwattr $C$DW$377, DW_AT_name("svgenHandle")
    3712                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_svgenHandle")
    3713                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3714                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3715              
    3716              $C$DW$378       .dwtag  DW_TAG_member
    3717                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$45)
    3718                      .dwattr $C$DW$378, DW_AT_name("svgen")
    3719                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_svgen")
    3720                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3721                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3722              
    3723              $C$DW$379       .dwtag  DW_TAG_member
    3724                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$47)
    3725                      .dwattr $C$DW$379, DW_AT_name("trajHandle_Id")
    3726                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_trajHandle_Id")
    3727                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3728                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3729              
    3730              $C$DW$380       .dwtag  DW_TAG_member
    3731                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$48)
    3732                      .dwattr $C$DW$380, DW_AT_name("traj_Id")
    3733                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_traj_Id")
    3734                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3735                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3736              
    3737              $C$DW$381       .dwtag  DW_TAG_member
    3738                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$47)
    3739                      .dwattr $C$DW$381, DW_AT_name("trajHandle_spd")
    3740                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_trajHandle_spd")
    3741                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3742                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3743              
    3744              $C$DW$382       .dwtag  DW_TAG_member
    3745                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$48)
    3746                      .dwattr $C$DW$382, DW_AT_name("traj_spd")
    3747                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_traj_spd")
    3748                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3749                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3750              
    3751              $C$DW$383       .dwtag  DW_TAG_member
    3752                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$47)
    3753                      .dwattr $C$DW$383, DW_AT_name("trajHandle_spdMax")
    3754                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3755                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3756                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3757              
    3758              $C$DW$384       .dwtag  DW_TAG_member
    3759                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$48)
    3760                      .dwattr $C$DW$384, DW_AT_name("traj_spdMax")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   74

    3761                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_traj_spdMax")
    3762                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3763                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3764              
    3765              $C$DW$385       .dwtag  DW_TAG_member
    3766                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$49)
    3767                      .dwattr $C$DW$385, DW_AT_name("motorParams")
    3768                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_motorParams")
    3769                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3770                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3771              
    3772              $C$DW$386       .dwtag  DW_TAG_member
    3773                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$52)
    3774                      .dwattr $C$DW$386, DW_AT_name("waitTimes")
    3775                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_waitTimes")
    3776                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3777                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3778              
    3779              $C$DW$387       .dwtag  DW_TAG_member
    3780                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$51)
    3781                      .dwattr $C$DW$387, DW_AT_name("counter_state")
    3782                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_counter_state")
    3783                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3784                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3785              
    3786              $C$DW$388       .dwtag  DW_TAG_member
    3787                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$53)
    3788                      .dwattr $C$DW$388, DW_AT_name("numIsrTicksPerCtrlTick")
    3789                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3790                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3791                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3792              
    3793              $C$DW$389       .dwtag  DW_TAG_member
    3794                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$53)
    3795                      .dwattr $C$DW$389, DW_AT_name("numCtrlTicksPerCurrentTick")
    3796                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3797                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3798                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3799              
    3800              $C$DW$390       .dwtag  DW_TAG_member
    3801                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$53)
    3802                      .dwattr $C$DW$390, DW_AT_name("numCtrlTicksPerSpeedTick")
    3803                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3804                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3805                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3806              
    3807              $C$DW$391       .dwtag  DW_TAG_member
    3808                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$53)
    3809                      .dwattr $C$DW$391, DW_AT_name("numCtrlTicksPerTrajTick")
    3810                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3811                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3812                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3813              
    3814              $C$DW$392       .dwtag  DW_TAG_member
    3815                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$51)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   75

    3816                      .dwattr $C$DW$392, DW_AT_name("ctrlFreq_Hz")
    3817                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3818                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3819                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3820              
    3821              $C$DW$393       .dwtag  DW_TAG_member
    3822                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$51)
    3823                      .dwattr $C$DW$393, DW_AT_name("trajFreq_Hz")
    3824                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3825                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3826                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3827              
    3828              $C$DW$394       .dwtag  DW_TAG_member
    3829                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    3830                      .dwattr $C$DW$394, DW_AT_name("trajPeriod_sec")
    3831                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3832                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3833                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3834              
    3835              $C$DW$395       .dwtag  DW_TAG_member
    3836                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$54)
    3837                      .dwattr $C$DW$395, DW_AT_name("ctrlPeriod_sec")
    3838                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3839                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3840                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3841              
    3842              $C$DW$396       .dwtag  DW_TAG_member
    3843                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    3844                      .dwattr $C$DW$396, DW_AT_name("maxVsMag_pu")
    3845                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3846                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3847                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3848              
    3849              $C$DW$397       .dwtag  DW_TAG_member
    3850                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$55)
    3851                      .dwattr $C$DW$397, DW_AT_name("Iab_in")
    3852                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_Iab_in")
    3853                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3854                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3855              
    3856              $C$DW$398       .dwtag  DW_TAG_member
    3857                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$55)
    3858                      .dwattr $C$DW$398, DW_AT_name("Iab_filt")
    3859                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_Iab_filt")
    3860                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3861                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3862              
    3863              $C$DW$399       .dwtag  DW_TAG_member
    3864                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$55)
    3865                      .dwattr $C$DW$399, DW_AT_name("Idq_in")
    3866                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_Idq_in")
    3867                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3868                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3869              
    3870              $C$DW$400       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   76

    3871                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$55)
    3872                      .dwattr $C$DW$400, DW_AT_name("Vab_in")
    3873                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_Vab_in")
    3874                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3875                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3876              
    3877              $C$DW$401       .dwtag  DW_TAG_member
    3878                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
    3879                      .dwattr $C$DW$401, DW_AT_name("spd_out")
    3880                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_spd_out")
    3881                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3882                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3883              
    3884              $C$DW$402       .dwtag  DW_TAG_member
    3885                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$55)
    3886                      .dwattr $C$DW$402, DW_AT_name("Vab_out")
    3887                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_Vab_out")
    3888                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3889                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3890              
    3891              $C$DW$403       .dwtag  DW_TAG_member
    3892                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$55)
    3893                      .dwattr $C$DW$403, DW_AT_name("Vdq_out")
    3894                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_Vdq_out")
    3895                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3896                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3897              
    3898              $C$DW$404       .dwtag  DW_TAG_member
    3899                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$54)
    3900                      .dwattr $C$DW$404, DW_AT_name("Rhf")
    3901                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_Rhf")
    3902                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3903                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3904              
    3905              $C$DW$405       .dwtag  DW_TAG_member
    3906                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$54)
    3907                      .dwattr $C$DW$405, DW_AT_name("Lhf")
    3908                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_Lhf")
    3909                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3910                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3911              
    3912              $C$DW$406       .dwtag  DW_TAG_member
    3913                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$54)
    3914                      .dwattr $C$DW$406, DW_AT_name("RoverL")
    3915                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_RoverL")
    3916                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3917                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3918              
    3919              $C$DW$407       .dwtag  DW_TAG_member
    3920                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    3921                      .dwattr $C$DW$407, DW_AT_name("Kp_Id")
    3922                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_Kp_Id")
    3923                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3924                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3925              
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   77

    3926              $C$DW$408       .dwtag  DW_TAG_member
    3927                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    3928                      .dwattr $C$DW$408, DW_AT_name("Kp_Iq")
    3929                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Kp_Iq")
    3930                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3931                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3932              
    3933              $C$DW$409       .dwtag  DW_TAG_member
    3934                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    3935                      .dwattr $C$DW$409, DW_AT_name("Kp_spd")
    3936                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Kp_spd")
    3937                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3938                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3939              
    3940              $C$DW$410       .dwtag  DW_TAG_member
    3941                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    3942                      .dwattr $C$DW$410, DW_AT_name("Ki_Id")
    3943                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Ki_Id")
    3944                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3945                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3946              
    3947              $C$DW$411       .dwtag  DW_TAG_member
    3948                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    3949                      .dwattr $C$DW$411, DW_AT_name("Ki_Iq")
    3950                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Ki_Iq")
    3951                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3952                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3953              
    3954              $C$DW$412       .dwtag  DW_TAG_member
    3955                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    3956                      .dwattr $C$DW$412, DW_AT_name("Ki_spd")
    3957                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Ki_spd")
    3958                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3959                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3960              
    3961              $C$DW$413       .dwtag  DW_TAG_member
    3962                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$20)
    3963                      .dwattr $C$DW$413, DW_AT_name("Kd_Id")
    3964                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Kd_Id")
    3965                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3966                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3967              
    3968              $C$DW$414       .dwtag  DW_TAG_member
    3969                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    3970                      .dwattr $C$DW$414, DW_AT_name("Kd_Iq")
    3971                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Kd_Iq")
    3972                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3973                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3974              
    3975              $C$DW$415       .dwtag  DW_TAG_member
    3976                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
    3977                      .dwattr $C$DW$415, DW_AT_name("Kd_spd")
    3978                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Kd_spd")
    3979                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3980                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   78

    3981              
    3982              $C$DW$416       .dwtag  DW_TAG_member
    3983                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    3984                      .dwattr $C$DW$416, DW_AT_name("Ui_Id")
    3985                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Ui_Id")
    3986                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3987                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3988              
    3989              $C$DW$417       .dwtag  DW_TAG_member
    3990                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    3991                      .dwattr $C$DW$417, DW_AT_name("Ui_Iq")
    3992                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_Ui_Iq")
    3993                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3994                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3995              
    3996              $C$DW$418       .dwtag  DW_TAG_member
    3997                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    3998                      .dwattr $C$DW$418, DW_AT_name("Ui_spd")
    3999                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Ui_spd")
    4000                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4001                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4002              
    4003              $C$DW$419       .dwtag  DW_TAG_member
    4004                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$55)
    4005                      .dwattr $C$DW$419, DW_AT_name("Idq_ref")
    4006                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Idq_ref")
    4007                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4008                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4009              
    4010              $C$DW$420       .dwtag  DW_TAG_member
    4011                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    4012                      .dwattr $C$DW$420, DW_AT_name("IdRated")
    4013                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_IdRated")
    4014                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4015                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4016              
    4017              $C$DW$421       .dwtag  DW_TAG_member
    4018                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    4019                      .dwattr $C$DW$421, DW_AT_name("spd_ref")
    4020                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_spd_ref")
    4021                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4022                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4023              
    4024              $C$DW$422       .dwtag  DW_TAG_member
    4025                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    4026                      .dwattr $C$DW$422, DW_AT_name("spd_max")
    4027                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_spd_max")
    4028                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4029                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4030              
    4031              $C$DW$423       .dwtag  DW_TAG_member
    4032                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$53)
    4033                      .dwattr $C$DW$423, DW_AT_name("counter_current")
    4034                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_counter_current")
    4035                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   79

    4036                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4037              
    4038              $C$DW$424       .dwtag  DW_TAG_member
    4039                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$53)
    4040                      .dwattr $C$DW$424, DW_AT_name("counter_isr")
    4041                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_counter_isr")
    4042                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4043                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4044              
    4045              $C$DW$425       .dwtag  DW_TAG_member
    4046                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$53)
    4047                      .dwattr $C$DW$425, DW_AT_name("counter_speed")
    4048                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_counter_speed")
    4049                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4050                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4051              
    4052              $C$DW$426       .dwtag  DW_TAG_member
    4053                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$53)
    4054                      .dwattr $C$DW$426, DW_AT_name("counter_traj")
    4055                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_counter_traj")
    4056                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4057                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4058              
    4059              $C$DW$427       .dwtag  DW_TAG_member
    4060                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$56)
    4061                      .dwattr $C$DW$427, DW_AT_name("flag_enableCtrl")
    4062                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4063                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4064                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4065              
    4066              $C$DW$428       .dwtag  DW_TAG_member
    4067                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$56)
    4068                      .dwattr $C$DW$428, DW_AT_name("flag_enableDcBusComp")
    4069                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4070                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4071                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4072              
    4073              $C$DW$429       .dwtag  DW_TAG_member
    4074                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$56)
    4075                      .dwattr $C$DW$429, DW_AT_name("flag_enablePowerWarp")
    4076                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4077                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4078                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4079              
    4080              $C$DW$430       .dwtag  DW_TAG_member
    4081                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$56)
    4082                      .dwattr $C$DW$430, DW_AT_name("flag_enableOffset")
    4083                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_flag_enableOffset")
    4084                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4085                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4086              
    4087              $C$DW$431       .dwtag  DW_TAG_member
    4088                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$56)
    4089                      .dwattr $C$DW$431, DW_AT_name("flag_enableSpeedCtrl")
    4090                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   80

    4091                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4092                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4093              
    4094              $C$DW$432       .dwtag  DW_TAG_member
    4095                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$56)
    4096                      .dwattr $C$DW$432, DW_AT_name("flag_enableUserMotorParams")
    4097                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4098                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4099                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4100              
    4101              $C$DW$433       .dwtag  DW_TAG_member
    4102                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$55)
    4103                      .dwattr $C$DW$433, DW_AT_name("Idq_offset_pu")
    4104                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4105                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4106                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4107              
    4108              $C$DW$434       .dwtag  DW_TAG_member
    4109                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$55)
    4110                      .dwattr $C$DW$434, DW_AT_name("Vdq_offset_pu")
    4111                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4112                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4113                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4114              
    4115              $C$DW$435       .dwtag  DW_TAG_member
    4116                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    4117                      .dwattr $C$DW$435, DW_AT_name("angle_pu")
    4118                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_angle_pu")
    4119                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4120                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4121              
    4122              $C$DW$436       .dwtag  DW_TAG_member
    4123                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    4124                      .dwattr $C$DW$436, DW_AT_name("speed_ref_pu")
    4125                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_speed_ref_pu")
    4126                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4127                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4128              
    4129              $C$DW$437       .dwtag  DW_TAG_member
    4130                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
    4131                      .dwattr $C$DW$437, DW_AT_name("speed_fb_pu")
    4132                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_speed_fb_pu")
    4133                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4134                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4135              
    4136              $C$DW$438       .dwtag  DW_TAG_member
    4137                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    4138                      .dwattr $C$DW$438, DW_AT_name("speed_outMax_pu")
    4139                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4140                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4141                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4142              
    4143              $C$DW$439       .dwtag  DW_TAG_member
    4144                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$56)
    4145                      .dwattr $C$DW$439, DW_AT_name("flag_enableCurrentCtrl")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   81

    4146                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4147                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4148                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4149              
    4150                      .dwendtag $C$DW$T$57
    4151              
    4152              $C$DW$T$85      .dwtag  DW_TAG_typedef
    4153                      .dwattr $C$DW$T$85, DW_AT_name("CTRL_Obj")
    4154                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
    4155                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4156              
    4157              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    4158                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    4159                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    4160              
    4161              $C$DW$T$87      .dwtag  DW_TAG_typedef
    4162                      .dwattr $C$DW$T$87, DW_AT_name("CTRL_Handle")
    4163                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    4164                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4165              
    4166              $C$DW$440       .dwtag  DW_TAG_TI_far_type
    4167                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$87)
    4168              
    4169              $C$DW$T$88      .dwtag  DW_TAG_const_type
    4170                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$440)
    4171              
    4172              
    4173              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4174                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    4175                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    4176              $C$DW$441       .dwtag  DW_TAG_member
    4177                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$21)
    4178                      .dwattr $C$DW$441, DW_AT_name("rsvd")
    4179                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_rsvd")
    4180                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4181                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4182              
    4183              $C$DW$442       .dwtag  DW_TAG_member
    4184                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$59)
    4185                      .dwattr $C$DW$442, DW_AT_name("targetProc")
    4186                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_targetProc")
    4187                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4188                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4189              
    4190              $C$DW$443       .dwtag  DW_TAG_member
    4191                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$21)
    4192                      .dwattr $C$DW$443, DW_AT_name("major")
    4193                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_major")
    4194                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4195                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4196              
    4197              $C$DW$444       .dwtag  DW_TAG_member
    4198                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$21)
    4199                      .dwattr $C$DW$444, DW_AT_name("minor")
    4200                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_minor")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   82

    4201                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4202                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4203              
    4204                      .dwendtag $C$DW$T$60
    4205              
    4206              $C$DW$T$24      .dwtag  DW_TAG_typedef
    4207                      .dwattr $C$DW$T$24, DW_AT_name("CTRL_Version")
    4208                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    4209                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    4210              
    4211              
    4212              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4213                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    4214                      .dwattr $C$DW$T$19, DW_AT_declaration
    4215                      .dwendtag $C$DW$T$19
    4216              
    4217              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    4218                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    4219                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    4220              
    4221              $C$DW$T$33      .dwtag  DW_TAG_typedef
    4222                      .dwattr $C$DW$T$33, DW_AT_name("EST_Handle")
    4223                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4224                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4225              
    4226              
    4227              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4228                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    4229                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    4230              $C$DW$445       .dwtag  DW_TAG_member
    4231                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$20)
    4232                      .dwattr $C$DW$445, DW_AT_name("sinTh")
    4233                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_sinTh")
    4234                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4235                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4236              
    4237              $C$DW$446       .dwtag  DW_TAG_member
    4238                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
    4239                      .dwattr $C$DW$446, DW_AT_name("cosTh")
    4240                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_cosTh")
    4241                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4242                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4243              
    4244                      .dwendtag $C$DW$T$61
    4245              
    4246              $C$DW$T$42      .dwtag  DW_TAG_typedef
    4247                      .dwattr $C$DW$T$42, DW_AT_name("IPARK_Obj")
    4248                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    4249                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4250              
    4251              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    4252                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    4253                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    4254              
    4255              $C$DW$T$41      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   83

    4256                      .dwattr $C$DW$T$41, DW_AT_name("IPARK_Handle")
    4257                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    4258                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4259              
    4260              
    4261              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4262                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    4263                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    4264              $C$DW$447       .dwtag  DW_TAG_member
    4265                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$62)
    4266                      .dwattr $C$DW$447, DW_AT_name("value")
    4267                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_value")
    4268                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4269                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4270              
    4271                      .dwendtag $C$DW$T$63
    4272              
    4273              $C$DW$T$55      .dwtag  DW_TAG_typedef
    4274                      .dwattr $C$DW$T$55, DW_AT_name("MATH_vec2")
    4275                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    4276                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4277              
    4278              
    4279              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4280                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    4281                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    4282              $C$DW$448       .dwtag  DW_TAG_member
    4283                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$65)
    4284                      .dwattr $C$DW$448, DW_AT_name("type")
    4285                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_type")
    4286                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4287                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4288              
    4289              $C$DW$449       .dwtag  DW_TAG_member
    4290                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$53)
    4291                      .dwattr $C$DW$449, DW_AT_name("numPolePairs")
    4292                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_numPolePairs")
    4293                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4294                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4295              
    4296              $C$DW$450       .dwtag  DW_TAG_member
    4297                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$54)
    4298                      .dwattr $C$DW$450, DW_AT_name("Lr_H")
    4299                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_Lr_H")
    4300                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4301                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4302              
    4303              $C$DW$451       .dwtag  DW_TAG_member
    4304                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$54)
    4305                      .dwattr $C$DW$451, DW_AT_name("Ls_d_H")
    4306                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_Ls_d_H")
    4307                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4308                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4309              
    4310              $C$DW$452       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   84

    4311                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$54)
    4312                      .dwattr $C$DW$452, DW_AT_name("Ls_q_H")
    4313                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_Ls_q_H")
    4314                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4315                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4316              
    4317              $C$DW$453       .dwtag  DW_TAG_member
    4318                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$54)
    4319                      .dwattr $C$DW$453, DW_AT_name("Rr_Ohm")
    4320                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_Rr_Ohm")
    4321                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4322                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4323              
    4324              $C$DW$454       .dwtag  DW_TAG_member
    4325                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$54)
    4326                      .dwattr $C$DW$454, DW_AT_name("Rs_Ohm")
    4327                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_Rs_Ohm")
    4328                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4329                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4330              
    4331              $C$DW$455       .dwtag  DW_TAG_member
    4332                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$54)
    4333                      .dwattr $C$DW$455, DW_AT_name("ratedFlux_VpHz")
    4334                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    4335                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4336                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4337              
    4338                      .dwendtag $C$DW$T$66
    4339              
    4340              $C$DW$T$49      .dwtag  DW_TAG_typedef
    4341                      .dwattr $C$DW$T$49, DW_AT_name("MOTOR_Params")
    4342                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    4343                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4344              
    4345              
    4346              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4347                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    4348                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    4349              $C$DW$456       .dwtag  DW_TAG_member
    4350                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    4351                      .dwattr $C$DW$456, DW_AT_name("sinTh")
    4352                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_sinTh")
    4353                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4354                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4355              
    4356              $C$DW$457       .dwtag  DW_TAG_member
    4357                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    4358                      .dwattr $C$DW$457, DW_AT_name("cosTh")
    4359                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_cosTh")
    4360                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4361                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4362              
    4363                      .dwendtag $C$DW$T$67
    4364              
    4365              $C$DW$T$36      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   85

    4366                      .dwattr $C$DW$T$36, DW_AT_name("PARK_Obj")
    4367                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    4368                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4369              
    4370              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4371                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    4372                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    4373              
    4374              $C$DW$T$35      .dwtag  DW_TAG_typedef
    4375                      .dwattr $C$DW$T$35, DW_AT_name("PARK_Handle")
    4376                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4377                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4378              
    4379              
    4380              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    4381                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    4382                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    4383              $C$DW$458       .dwtag  DW_TAG_member
    4384                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    4385                      .dwattr $C$DW$458, DW_AT_name("Kp")
    4386                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_Kp")
    4387                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4388                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4389              
    4390              $C$DW$459       .dwtag  DW_TAG_member
    4391                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$20)
    4392                      .dwattr $C$DW$459, DW_AT_name("Ki")
    4393                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_Ki")
    4394                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4395                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4396              
    4397              $C$DW$460       .dwtag  DW_TAG_member
    4398                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    4399                      .dwattr $C$DW$460, DW_AT_name("Kd")
    4400                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_Kd")
    4401                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4402                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4403              
    4404              $C$DW$461       .dwtag  DW_TAG_member
    4405                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    4406                      .dwattr $C$DW$461, DW_AT_name("Ui")
    4407                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_Ui")
    4408                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4409                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4410              
    4411              $C$DW$462       .dwtag  DW_TAG_member
    4412                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    4413                      .dwattr $C$DW$462, DW_AT_name("refValue")
    4414                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_refValue")
    4415                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4416                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4417              
    4418              $C$DW$463       .dwtag  DW_TAG_member
    4419                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$20)
    4420                      .dwattr $C$DW$463, DW_AT_name("fbackValue")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   86

    4421                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_fbackValue")
    4422                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4423                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4424              
    4425              $C$DW$464       .dwtag  DW_TAG_member
    4426                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$20)
    4427                      .dwattr $C$DW$464, DW_AT_name("outMin")
    4428                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_outMin")
    4429                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4430                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4431              
    4432              $C$DW$465       .dwtag  DW_TAG_member
    4433                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$20)
    4434                      .dwattr $C$DW$465, DW_AT_name("outMax")
    4435                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_outMax")
    4436                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4437                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4438              
    4439                      .dwendtag $C$DW$T$68
    4440              
    4441              $C$DW$T$39      .dwtag  DW_TAG_typedef
    4442                      .dwattr $C$DW$T$39, DW_AT_name("PID_Obj")
    4443                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    4444                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4445              
    4446              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4447                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    4448                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    4449              
    4450              $C$DW$T$38      .dwtag  DW_TAG_typedef
    4451                      .dwattr $C$DW$T$38, DW_AT_name("PID_Handle")
    4452                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4453                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4454              
    4455              
    4456              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    4457                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    4458                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    4459              $C$DW$466       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
    4461                      .dwattr $C$DW$466, DW_AT_name("maxModulation")
    4462                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_maxModulation")
    4463                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4464                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4465              
    4466                      .dwendtag $C$DW$T$69
    4467              
    4468              $C$DW$T$45      .dwtag  DW_TAG_typedef
    4469                      .dwattr $C$DW$T$45, DW_AT_name("SVGEN_Obj")
    4470                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    4471                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4472              
    4473              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4474                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    4475                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   87

    4476              
    4477              $C$DW$T$44      .dwtag  DW_TAG_typedef
    4478                      .dwattr $C$DW$T$44, DW_AT_name("SVGEN_Handle")
    4479                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4480                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4481              
    4482              
    4483              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4484                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    4485                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    4486              $C$DW$467       .dwtag  DW_TAG_member
    4487                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$20)
    4488                      .dwattr $C$DW$467, DW_AT_name("targetValue")
    4489                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_targetValue")
    4490                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4491                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4492              
    4493              $C$DW$468       .dwtag  DW_TAG_member
    4494                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
    4495                      .dwattr $C$DW$468, DW_AT_name("intValue")
    4496                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_intValue")
    4497                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4498                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4499              
    4500              $C$DW$469       .dwtag  DW_TAG_member
    4501                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
    4502                      .dwattr $C$DW$469, DW_AT_name("minValue")
    4503                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_minValue")
    4504                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4505                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4506              
    4507              $C$DW$470       .dwtag  DW_TAG_member
    4508                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$20)
    4509                      .dwattr $C$DW$470, DW_AT_name("maxValue")
    4510                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_maxValue")
    4511                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4512                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4513              
    4514              $C$DW$471       .dwtag  DW_TAG_member
    4515                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
    4516                      .dwattr $C$DW$471, DW_AT_name("maxDelta")
    4517                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_maxDelta")
    4518                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4519                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4520              
    4521                      .dwendtag $C$DW$T$70
    4522              
    4523              $C$DW$T$48      .dwtag  DW_TAG_typedef
    4524                      .dwattr $C$DW$T$48, DW_AT_name("TRAJ_Obj")
    4525                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    4526                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4527              
    4528              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4529                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    4530                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   88

    4531              
    4532              $C$DW$T$47      .dwtag  DW_TAG_typedef
    4533                      .dwattr $C$DW$T$47, DW_AT_name("TRAJ_Handle")
    4534                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4535                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4536              
    4537              
    4538              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4539                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    4540                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    4541              $C$DW$472       .dwtag  DW_TAG_member
    4542                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$54)
    4543                      .dwattr $C$DW$472, DW_AT_name("iqFullScaleCurrent_A")
    4544                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    4545                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4546                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4547              
    4548              $C$DW$473       .dwtag  DW_TAG_member
    4549                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$54)
    4550                      .dwattr $C$DW$473, DW_AT_name("iqFullScaleVoltage_V")
    4551                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    4552                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4553                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4554              
    4555              $C$DW$474       .dwtag  DW_TAG_member
    4556                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$54)
    4557                      .dwattr $C$DW$474, DW_AT_name("iqFullScaleFreq_Hz")
    4558                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    4559                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4560                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4561              
    4562              $C$DW$475       .dwtag  DW_TAG_member
    4563                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$53)
    4564                      .dwattr $C$DW$475, DW_AT_name("numIsrTicksPerCtrlTick")
    4565                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4566                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4567                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4568              
    4569              $C$DW$476       .dwtag  DW_TAG_member
    4570                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$53)
    4571                      .dwattr $C$DW$476, DW_AT_name("numCtrlTicksPerCurrentTick")
    4572                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4573                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4574                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4575              
    4576              $C$DW$477       .dwtag  DW_TAG_member
    4577                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$53)
    4578                      .dwattr $C$DW$477, DW_AT_name("numCtrlTicksPerEstTick")
    4579                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    4580                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4581                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4582              
    4583              $C$DW$478       .dwtag  DW_TAG_member
    4584                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$53)
    4585                      .dwattr $C$DW$478, DW_AT_name("numCtrlTicksPerSpeedTick")
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   89

    4586                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4587                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4588                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4589              
    4590              $C$DW$479       .dwtag  DW_TAG_member
    4591                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$53)
    4592                      .dwattr $C$DW$479, DW_AT_name("numCtrlTicksPerTrajTick")
    4593                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4594                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4595                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4596              
    4597              $C$DW$480       .dwtag  DW_TAG_member
    4598                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$22)
    4599                      .dwattr $C$DW$480, DW_AT_name("numCurrentSensors")
    4600                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_numCurrentSensors")
    4601                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4602                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4603              
    4604              $C$DW$481       .dwtag  DW_TAG_member
    4605                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$22)
    4606                      .dwattr $C$DW$481, DW_AT_name("numVoltageSensors")
    4607                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_numVoltageSensors")
    4608                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4609                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4610              
    4611              $C$DW$482       .dwtag  DW_TAG_member
    4612                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$54)
    4613                      .dwattr $C$DW$482, DW_AT_name("offsetPole_rps")
    4614                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_offsetPole_rps")
    4615                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4616                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4617              
    4618              $C$DW$483       .dwtag  DW_TAG_member
    4619                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$54)
    4620                      .dwattr $C$DW$483, DW_AT_name("fluxPole_rps")
    4621                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_fluxPole_rps")
    4622                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4623                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4624              
    4625              $C$DW$484       .dwtag  DW_TAG_member
    4626                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$54)
    4627                      .dwattr $C$DW$484, DW_AT_name("zeroSpeedLimit")
    4628                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    4629                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4630                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4631              
    4632              $C$DW$485       .dwtag  DW_TAG_member
    4633                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$54)
    4634                      .dwattr $C$DW$485, DW_AT_name("forceAngleFreq_Hz")
    4635                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    4636                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4637                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4638              
    4639              $C$DW$486       .dwtag  DW_TAG_member
    4640                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   90

    4641                      .dwattr $C$DW$486, DW_AT_name("maxAccel_Hzps")
    4642                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    4643                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4644                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4645              
    4646              $C$DW$487       .dwtag  DW_TAG_member
    4647                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$54)
    4648                      .dwattr $C$DW$487, DW_AT_name("maxAccel_est_Hzps")
    4649                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    4650                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4651                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4652              
    4653              $C$DW$488       .dwtag  DW_TAG_member
    4654                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$54)
    4655                      .dwattr $C$DW$488, DW_AT_name("directionPole_rps")
    4656                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_directionPole_rps")
    4657                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4658                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4659              
    4660              $C$DW$489       .dwtag  DW_TAG_member
    4661                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$54)
    4662                      .dwattr $C$DW$489, DW_AT_name("speedPole_rps")
    4663                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_speedPole_rps")
    4664                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4665                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4666              
    4667              $C$DW$490       .dwtag  DW_TAG_member
    4668                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$54)
    4669                      .dwattr $C$DW$490, DW_AT_name("dcBusPole_rps")
    4670                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_dcBusPole_rps")
    4671                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4672                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4673              
    4674              $C$DW$491       .dwtag  DW_TAG_member
    4675                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$54)
    4676                      .dwattr $C$DW$491, DW_AT_name("fluxFraction")
    4677                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_fluxFraction")
    4678                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4679                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4680              
    4681              $C$DW$492       .dwtag  DW_TAG_member
    4682                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$54)
    4683                      .dwattr $C$DW$492, DW_AT_name("indEst_speedMaxFraction")
    4684                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    4685                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4686                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4687              
    4688              $C$DW$493       .dwtag  DW_TAG_member
    4689                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$54)
    4690                      .dwattr $C$DW$493, DW_AT_name("powerWarpGain")
    4691                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_powerWarpGain")
    4692                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4693                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4694              
    4695              $C$DW$494       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   91

    4696                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$53)
    4697                      .dwattr $C$DW$494, DW_AT_name("systemFreq_MHz")
    4698                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_systemFreq_MHz")
    4699                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4700                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4701              
    4702              $C$DW$495       .dwtag  DW_TAG_member
    4703                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$54)
    4704                      .dwattr $C$DW$495, DW_AT_name("pwmPeriod_usec")
    4705                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    4706                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4707                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4708              
    4709              $C$DW$496       .dwtag  DW_TAG_member
    4710                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$54)
    4711                      .dwattr $C$DW$496, DW_AT_name("voltage_sf")
    4712                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_voltage_sf")
    4713                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4714                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4715              
    4716              $C$DW$497       .dwtag  DW_TAG_member
    4717                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$54)
    4718                      .dwattr $C$DW$497, DW_AT_name("current_sf")
    4719                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_current_sf")
    4720                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4721                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4722              
    4723              $C$DW$498       .dwtag  DW_TAG_member
    4724                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$54)
    4725                      .dwattr $C$DW$498, DW_AT_name("voltageFilterPole_rps")
    4726                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    4727                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4728                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    4729              
    4730              $C$DW$499       .dwtag  DW_TAG_member
    4731                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
    4732                      .dwattr $C$DW$499, DW_AT_name("maxVsMag_pu")
    4733                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4734                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4735                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    4736              
    4737              $C$DW$500       .dwtag  DW_TAG_member
    4738                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$54)
    4739                      .dwattr $C$DW$500, DW_AT_name("estKappa")
    4740                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_estKappa")
    4741                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4742                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    4743              
    4744              $C$DW$501       .dwtag  DW_TAG_member
    4745                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$65)
    4746                      .dwattr $C$DW$501, DW_AT_name("motor_type")
    4747                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_motor_type")
    4748                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4749                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    4750              
TMS320C2000 Assembler PC v15.12.3 Thu Mar 02 12:12:47 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\GUILHE~1\AppData\Local\Temp\1281610                         PAGE   92

    4751              $C$DW$502       .dwtag  DW_TAG_member
    4752                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$53)
    4753                      .dwattr $C$DW$502, DW_AT_name("motor_numPolePairs")
    4754                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_motor_numPolePairs")
    4755                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4756                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    4757              
    4758              $C$DW$503       .dwtag  DW_TAG_member
    4759                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$54)
    4760                      .dwattr $C$DW$503, DW_AT_name("motor_ratedFlux")
    4761                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_motor_ratedFlux")
    4762                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4763                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    4764              
    4765              $C$DW$504       .dwtag  DW_TAG_member
    4766                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$54)
    4767                      .dwattr $C$DW$504, DW_AT_name("motor_Rr")
    4768                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_motor_Rr")
    4769                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4770                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    4771              
    4772              $C$DW$505       .dwtag  DW_TAG_member
    4773                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$54)
    4774                      .dwattr $C$DW$505, DW_AT_name("motor_Rs")
    4775                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_motor_Rs")
    4776                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4777                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    4778              
    4779              $C$DW$506       .dwtag  DW_TAG_member
    4780                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$54)
    4781                      .dwattr $C$DW$506, DW_AT_name("motor_Ls_d")
    4782                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_motor_Ls_d")
    4783                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4784                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    4785              
    4786              $C$DW$507       .dwtag  DW_TAG_member
    4787                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$54)
    4788                      .dwattr $C$DW$507, DW_AT_name("motor_Ls_q")
    4789                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_motor_Ls_q")
    4790                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4791                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    4792              
    4793              $C$DW$508       .dwtag  DW_TAG_member
    4794                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$54)
    4795                      .dwattr $C$DW$508, DW_AT_name("maxCurrent")
    4796                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_maxCurrent")
    4797                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4798                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    4799              
